[[0.0, ["Start; what to do"], "Use the photos and questions together to answer the trivia and identify the location;  photos often provide googlable hints to the locations"], [0.2, ["Pentominos"], "These seem like they should fit together; can you find anything in the pentominos themselves to guide you to fitting them together?"], [5.0, ["Trivia answers"], "Enumeration is given by number of squares below the question; The shaded squares indicate the relevant letters"], [10.0, ["Blue Bike", " Station Locations", " Map"], "You may notice a common element in all photos (besides Sir Bunny).  Locals will recognize this, but if you're not local, try googling the most obvious names.  This should lead you to a site that will provide a good deal of useful information."], [20.0, ["Rows", " Columns", " Headers", " Grid"], "[Instruction phrase is: COLUMN HEADERS TENS; ROW HEADERS ONES - this assumes they've identified this]\r\n\r\nWhere could you find numbers with tens values & ones values (there may be other digits, but you can ignore them). What can you find rows and columns?\r\n\r\nFind the Station Number for each blue bike station to get the relevant tens and ones digits"], [25.0, ["Station Numbers"], "[If they've gone to the Blue Bikes site and found the map, but can't find station numbers]\r\n\r\nClicking on the bike icon on the map gives the Station number of blue bike station"], [50.1, ["Individual clue: 37 foot Monster"], "There's a famous Monster associated with Boston. If you don't know, try asking a sports fan."], [50.2, ["Individual clue: Fiercely competitive racer"], "The map near Sir Bunny can help provide a location, the path named is relatively short, but you can find it on a map."], [50.3, ["Individual clue: Wise counciler and someone who refused to give up her seat"], "There are many structures in Boston (and elsewhere) named for the person who gave up her seat, often in conjunction with another woman, so you may need to Google further than your first hit - or you can try entering her name in the map at the relevant site for this puzzle [it's the Blue Bikes site, which they hopefully have already found - if not, give them hint 10.0]"], [50.4, ["Individual clue:  spectral bird", " haunting call"], "There is a very famous bird with a haunting call that matches the enumeration; once you ID the bird, you can probably find the location by searching a famous statue"], [50.5, ["Individual clue:  see all the stars", " start of a trail"], "In what building can you see all the stars? [It's the Museum of Science, which has a planetarium]"], [50.6, ["Individual clue:  emerald-colored dragon"], "\"Wings\" refers to a specific street, the dragon refers to a pub"], [50.7, ["Individual clue:   five riders from a foreign nation"], "This refers to a specific statue. There aren't many statues in Boston that include 5 people"], [100.0, ["C32025", " Final clue phrase", " Final location"], "[If they've gone to the Blue Bike site but can't find the document with all station numbers and locations]\r\n\r\nOn the System Data page of the Blue Bikes site is a link to a spreadsheet with the information you want (all station #s & locations), you can use this to find the relevant station."]]