[[1.0, ["getting started", " start", " movies", " clips"], "The puzzle consists of 8 movie clips plus one other short video.  You do not need to identify the movies in the clips in order to solve the puzzle."], [2.0, ["movies", " clips", " getting started"], "Have you found the scene inserted into each of the movie clips?"], [5.0, ["clapboard", " sticks", " clapper", " title", " scene", " take"], "When the clapboards are placed in the correct order, the information on them will give you instructions as to what to do next."], [5.1, ["clapboard", " sticks", " order", " clapper", " title", " scene", " take"], "The directors on the clapboard provide the proper order."], [5.2, ["clapboard", " sticks", " clapper", " order", " title", " scene", " take"], "The directors' last names start with the letters A-I.  Once placed in alphabetical order, check out the titles."], [5.3, ["clapboard", " sticks", " order", " clapper", " title", " scene", " take"], "After ordering the clapboards by Director, read down the first words and the last words of the titles."], [10.0, ["Coming soon", " video 9"], "If you can't see the images in the \"Coming Soon\" video, one of the hidden messages in the other videos will lead you to a helpful tool."], [10.1, ["Coming soon", " video 9", " order"], "Look carefully at the words blocking the movie titles to determine the order in which to read the blocked words"], [20.0, ["clapboard", " upside down", " tail slate"], "When the board is upside-down, the man holding it says \"Tail slate.\"  Google it!"], [50.0, ["Clips", " movies", " frames", " pause"], "You have been directed to certain points in each movie clip.  What do these points have in common?"], [60.0, ["Clips", " movies", " frames", " pause", " sound", " dialogue"], "There has been a lot of mention of frames in the flavor text and instructions. A frame is too short to contain any dialogue."], [100.0, ["Extraction", " pause", " frame", " movies"], "The guy with the clapboard keeps yelling \"Quiet on the set!\" and the flavor text says \"We've got movie sign!\""], [100.1, ["Extraction", " pause", " frame", " movies"], "All of these actors deserved an Oscar, hands down."], [100.2, ["Extraction", " pause", " frame", " movies"], "If you've paused at the right place, someone's hand should be prominently placed in the frame."], [100.3, ["extraction", " pause", " frame", " movies"], "Once you've paused the video in the right place, look for an ASL letter."]]