[[0.0, ["sections"], "The sections are labeled FIRST, THEN, FINALLY. It's important to do them in order."], [10.0, ["answers"], "These clues should be very easy to solve. The answers are in alphabetical order. [see solution doc for answers to each one.]"], [20.0, ["interpreting answers"], "Note the flavor text says \"six kinds of shady\". Each of these answers can be associated with 1-3… what?"], [20.1, ["colors"], "Each of these answers can be associated with 1-3 colors. There are only 6 colors total. No combination of colors is used more than once."], [20.2, ["colors"], "The six colors are RED, ORANGE, YELLOW, GREEN, BLUE and WHITE."], [20.3, ["colors"], "You can find the six colors on a very well-known puzzle-y object."], [20.4, ["colors"], "These are the same six colors than can be found on a Rubik's Cube."], [30.0, ["clue weirdness"], "For such easy answers, these clues seems to be extremely tortured. Inspect the clues and find the word or phrase that is most unnecessary or superfluous."], [30.1, ["clue count"], "Note that there are 26 clues."], [30.2, ["clue weirdness"], "These extra clues can be associated with something. The easiest ones to start with might be \"cell block\",  \"Don't preach\", \"doodle\", and \"Rio\"."], [30.3, ["clue weirdness"], "Each clue has an extra word or phrase that can be paired with a letter in the NATO alphabet. e.g. \"cell block TANGO\", \"PAPA Don't preach\", \"YANKEE doodle\", and \"Rio BRAVO\"."], [40.0, ["mapping clues to cube"], "There are 26 cubelets on a Rubik's Cube. Using the NATO letters and the color combos, you can now map each of the 26 letters of the alphabet to a cubelet. You can do this by writing on a real cube, or getting creative with Sheets."], [40.1, ["mapping clues to cube"], "Example for how to do it in sheets (this image indicates which letter goes where): https://cln.sh/DFHRcdxhAm66Tdsjspto"], [50.0, ["Part 2: \"Then\""], "Some of these clues have several answers. To solve this part, turn the cube to form these words. Each clue represents one 90 degree turn of one face of the cube."], [50.1, ["Answers to part 2"], "[see answer page]"], [60.0, ["Final extraction"], "Once done, the cube should have a nice snake-like path traversing all six sides. Find the letters in this path. Use the final enumeration to help read the message."], [100.0, ["Interpreting final message"], "[if teams are confused by how to interpret X IS ART BY WHOM]. \"That is the correct message. Inspect X and figure out what piece of art it looks like.\""], [100.1, ["What is X"], "What two colors are on that cubelet? Google them along with \"art\"."]]