[[0.0, ["song"], "It says to look up the film Midnight Madness; this would be a good idea."], [0.1, ["song", " message", " first", " priority"], "Everything with a black background relates to one part of this puzzle."], [0.2, ["song", " message", " first", " priority"], "Specifically, the First Priority items relate to the (Midnight Madness) game's later clues."], [0.3, ["song", " message", " first", " priority", " order"], "The game's later clues, clued by the First Priority items, provide an ordering mechanism."], [1.0, ["red", " alert"], "Each Red Alert item contains two clues."], [1.1, ["red", " alert"], "The two clues in each Red Alert item clue two words that are related in some way."], [1.2, ["red", " alert"], "The two words clued by each red alert item indicate a single letter to be extracted from one of the words."], [1.3, ["red", " alert", " order"], "The Red Alert letters, in the First Priority order, form a word."], [2.0, ["yellow", " alert"], "The three people mentioned in each Yellow Alert item have something in common."], [2.1, ["yellow", " alert"], "The three people mentioned in each Yellow Alert item were in a movie together."], [2.2, ["yellow", " alert"], "Most of the movie titles involved have something in common; the two that don't have something else in common."], [2.3, ["yellow", " alert"], "Each movie title has a number or a direction in it."], [2.4, ["yellow", " alert", " order"], "The Yellow Alert numbers and directions, in the First Priority order, form most of a meaningful expression."], [2.5, ["yellow", " alert"], "The \"dotty\" and \"loopy\" indicators refer to symbols that can be added after the numbers from the titles they go with."], [2.6, ["yellow", " alert", " order"], "With . added after the \"dotty\" numbers, and ° after the \"loopy\" numbers, the Yellow Alert numbers in the First Priority order form a set of latitude and longitude coordinates."], [2.7, ["yellow", " alert"], "The latitude and longitude coordinates should lead you to a single word."], [3.0, ["green", " alert"], "All of the individuals mentioned have something in common."], [3.1, ["green", " alert"], "All of the individuals mentioned played for the LA Rams. They have even more in common than this."], [3.2, ["green", " alert"], "All of the individuals mentioned had a number retired by the LA Rams. That number is their \"figure.\""], [3.3, ["green", " alert"], "In each case, R letter and Y letter refer to corresponding letters from the final words that Red Alert and Yellow Alert gave."], [3.4, ["green", " alert"], "|R letter - Y letter| is the distance between the corresponding letters from the Red Alert final word and the Yellow Alert final word. Note that this is 0 precisely where no LA Ram is specified."], [3.5, ["green", " alert"], "In each case, you will take the given multiple of |R letter - Y letter| number, and (if |R letter - Y letter| is not 0) multply the LA Ram's retired number by it."], [3.6, ["green alert"], "You will then take the sum of all these products."], [100.0, ["extraction"], "The final sum from Green Alert, the final word from Yellow Alert, and the final word from Red Alert, in that order, form a meaningful phrase."], [100.1, ["extraction"], "Specifically, the final sum from Green Alert, final word from Yellow Alert, and final word from Red Alert form an address in LA."], [100.2, ["extraction", " song"], "What you want at that address is hinted at in a few ways, but knowing the answer to the Itari clue mentioned will be particularly helpful."], [100.3, ["extraction", " song"], "Specifically, you want to find one of the Hollywood Walk of Fame stars at that address."], [100.4, ["extraction", " image", " circle"], "There are multiple stars at that address; the image at the bottom of the puzzle is intended to indicate which one you want."], [100.5, ["extraction", " image", " circle"], "Specifically, you want the star with a name that is so long that it is on two lines, instead of just one."]]