[[1.0, ["completely stuck", " theme", " start"], "There are several particular phrases used in the flavor text and in the individual passages that hint at an underlying theme for this puzzle. Those bookmarks also look a bit familiar..."], [2.0, ["completely stuck", " theme"], "The phrases \"tasks\", \"crew\", and \"crewmate\" appear many times throughout the puzzle. The flavor text also refers to these tasks as \"suspicious\" and her completing them as \"the name of the game\""], [3.0, ["completely stuck", " theme"], "The repeated references to tasks and crewmates in this puzzle allude to Among Us"], [10.0, ["text", " bolded clues"], "Each entry in the book has a bolded phrase and a parenthetical number (sometimes more than one), similar to a crossword clue"], [11.0, ["text", " crossword clues", " bolded clues"], "Some clues may not seem to have unique solutions, but determining a few and looking at them in book order may help to disambiguate"], [11.5, ["text", " crossword clues", " bolded clues", " answers"], "The answers are provided in alphabetical order and all of the answers have a general feature in common, with one minor difference between them"], [11.7, ["text", " crossword clues", " bolded clues", " answers", " stuck"], "All of the answers contain the substring U?S, with a different letter between the U and S for each clue"], [13.0, ["text", " crossword clues", " bolded clues", " answers", " confirm answers"], "Note to hint provider: If a team asks to confirm any of their clue answers, feel free to validate them using the puzzle solution page"], [20.0, ["images", " theme not identified"], "Something seems suspicious about this puzzle, there are many phrases repeated throughout the text and flavor text that seem to hint at an underlying theme. Identifying that first will help to figure out what is going on in these images."], [21.0, ["images", " Among Us", " stuck"], "Try describing what is going on in some of these images. Do any of Amelia's tasks sound familiar to you?"], [22.0, ["images", " Among Us", " stuck", " cannot identify what images are describing"], "These images do not seem to directly depict tasks from Among Us, but seem somewhat close to them..."], [22.5, ["images", " Among Us", " stuck", " cannot identify what images are describing"], "One of the images appears to represent the task \"PICK UP VOWELS\", and another appears to represent \"SCAR BOARDING PASS\"."], [23.0, ["images", " Among Us", " stuck"], "Each image provided corresponds to a task from Among Us with exactly 1 letter changed"], [24.0, ["images", " Among Us", " confirm answers"], "Note to hint provider: If a team asks to confirm any of their answers, feel free to validate them using the puzzle solution page"], [80.0, ["ordering", " all clues identified"], "The crossword answers you have identified are currently in alphabetical order in reading order; what characteristics of your answers could provide a unique ordering? There is also a hint hidden somewhere else in the puzzle that can provide a more explicit ordering instruction."], [80.1, ["ordering", " all clues identified", " stuck"], "Look at the first letter of each image's description, and you should get a phrase telling you how to sort your answers (remember that Amelia reads her tasks literally)"], [100.0, ["extraction"], "Each answer is identical to a task from Among Us with a single letter changed; how could we use that new letter?"], [100.5, ["extraction", " final answer"], "Reading the new task letters spells out a phrase linking you to an actor's name; there's one unused element of the puzzle that should tell you how to submit their name"]]