[[1.0, ["story", " coded words not found yet"], "The opening quote talks about finding a message hidden within a certain type of information which happens to be scattered throughout the story. It's easy as A,B,C..."], [1.1, ["story", " decoded word list", " AZ1-26 cipher"], "There are 8 spaces for answers from the story and 19 words, so the words will have to be combined. Googling the more unusual words from the list and/or combinations of those words should lead to the correct combinations."], [1.2, ["story", " decoded word list", " AZ1-26 cipher", " googled", " how to combine/pair"], "Try looking up the words on the list that aren't in the dictionary at TVTROPES.org."], [1.6, ["story", " found tropes", " ordering"], "You have an unordered list of tropes. There are 8 tropes and 8 story sections. Look for a connection."], [1.7, ["story", " found tropes", " ordering", " can't find connection"], "Each section of the story pointedly displays one of the 8 tropes, so you have to know what the tropes mean. A good  place to start is the sections of the story that vary dramatically in tone."], [2.0, ["Punnett squares", " what to do with them"], "There are 8 Punnett squares that need to be \"solved.\" Solving means using the clues in the \"Notes\" sections to figure out the genotypes of the two parents as well as the genotype of the pod that those parents spawned."], [2.1, ["Punnett squares", " logic puzzle", " hints re. genetics part of logic puzzle", " NOT probability"], "Double check that you are: (1) Not using concepts of dominant/recessive from Terran genetics. Look at Lt.s Gemna's Science Logs to see how Ovaxian genetics work. (2) Entering the parents' alleles in the order specified in Lt.s Gemna's example. (3) Not working linearly. If you are stuck on one Punnett square, go on to another one."], [2.11, ["Punnett squares", " Solving squares", " logic puzzle"], "Helpful info for Punnett squares: (1) Given a phenotype, you can always eliminate one possibility from the possible genotypes. E.g., a Mouth-Breather must have a genotype of either MM or MN, and cannot have a T allele. (Why not? Because if the alleles were MT, it would be a Tongue-Breather.)  (2) Each pod comes from one cell in the Punnett square. It may be helpful to know that the genotype in that square has exactly a 1/16 probability of occurring. (3) To figure out EVERY pod's phenotype, you will have to solve the logic puzzle involving the chambers and numbers of eggs."], [2.3, ["Punnett squares", " logic puzzle", " hints re. probability"], "Ovaxian & Terran genetics differ, so any probability information you find online for dihybrid crosses will not be helpful. Here, each of the 16 cells represents a 1/16 chance that the offspring will have the genotype and phenotype of that cell. If 2 of the 16 cells result in, say, mouth-breathing umami-breathed squirts, then the probability of those traits occurring in the pod is: 2/16 = 1/8."], [2.8, ["Punnett squares", " logic puzzle", " number of eggs", " not enough information"], "Have you gotten ALL the information you can from the boxes representing the chambers in which the eggs will be placed? Section 6 in the story talks about something missing from SOME of the chambers. But that information is still somewhere..."], [2.9, ["Punnett squares", " logic puzzle", " number of eggs", " not enough information"], "Some of the color-coded labels indicating a pod's phenotype remained on the box with the chambers. Look at the representation of that box in the puzzle."], [3.1, ["tropes listed in order", " Punnett squares solved", " what now?"], "Lt. Vrolid's notes hold a clue. Remember how Sklerigny said she looked to \"the digits of my displays\" to find her answers."], [3.2, ["tropes listed in order", " Punnett squares solved", " what now?"], "The table in Lt. Vrolid's notes can be decoded in the same way as the trope names were decoded."], [10.1, ["tropes in order", " Punnetts solved", " Vrolid's clue decoded", " now what?"], "Decoding the table yields: CONCATENATE STORY ANSWERS AND ENTER ROW BY ROW ACROSS CHAMBERS. Enter the trope names in the order determined by the story into the grid representing the chambers. It should fit exactly."], [10.2, ["tropes entered into grid", " extraction"], "There are 8 chambers, each holding a particular pod's eggs. Each chamber is 4x4, just as each of the 8 Punnett squares is 4x4. How can you use these together?"], [10.3, ["tropes entered into grid", " extraction", " superimposed Punnett squares on chambers"], "The goal of solving each Punnett square was to figure out the genotype/phenotype of the pod. In every case, there was a 1/16 probability of the pod's genotype and phenotype occurring. That means that a particular cell in each Punnett square represents that pod."], [10.4, ["tropes entered into grid", " extraction"], "Highlight the cell in each Punnett square that represents the pod's genetics. When each Punnett square is superimposed on the chamber grid in the chamber set aside for that pod, that cell will indicate a single letter. This should result in 8 letters, one from each chamber, being extracted."], [10.5, ["ordering final extraction"], "What was it that the Ovaxians believe foretells the order in which their lives will unfold?"], [10.6, ["ordering final extraction"], "Ovaxians believe that the number of eggs foretells the ORDER in which one's life will unfold. And one's extraction. Place the letters obtained for each pod in order based on the number of eggs produced for each pod, from 1-8."]]