[[0.0, ["start"], "Start by exploring the webpage, chat, or by requesting email assistance"], [1.0, ["webpage", " headers"], "What kinds of things have headers?"], [1.01, ["headers", " web"], "Your browser might have a way of checking various headers - what tools might a developer use to inspect them?"], [1.1, ["web", " get"], "Look in the request headers - what does it ask you to do?"], [1.2, ["web", " post"], "[How to do this?] Have you tried searching for a tool that would let you send a POST request?"], [1.21, ["web", " post"], "POST requests are usually used to INSERT things - can you do that with the elements? What kind of elements would make sense for a web page?"], [1.3, ["web", " head"], "[How to do this?] Have you tried searching for a tool that would let you send a HEAD request?"], [1.31, ["web", " head"], "beHEADing is removing the start of a word; what might HEAD mean?"], [1.4, ["web", " put"], "[How to do this?] Have you tried searching for a tool that would let you send a PUT request?"], [1.41, ["web", " put"], "PUT requests are used to modify things - could you do this, somehow?"], [1.5, ["web", " delete"], "[How to do this?] Have you tried searching for a tool that would let you send a DELETE request?"], [1.51, ["web", " delete"], "DELETE requests are usually used to remove things"], [1.6, ["web", " rfc"], "[if they have solved the other four parts and have 3971] an RFC document is referred to by a number, usually - have you tried searching for this?\r\n[otherwise] You'll need this, but RFC documents are referred to by a number, so you might need more info than you have at the moment."], [2.0, ["email", " headers"], "What kinds of things have headers?"], [2.01, ["email", " headers"], "If you're viewing this in a browser, you don't want your page headers - but emails can have headers, too..."], [2.02, ["email", " alias", " plus"], "Have you tried searching for this? You may be able to receive emails using addresses different to your usual one."], [2.1, ["email", " logical conjunction"], "Have you tried googling this?"], [2.2, ["email", " x86", " x64"], "These are CPU architectures - have you tried searching for this?"], [2.3, ["email", " anhalt", " zerbst"], "What goes on vehicles, perhaps to help identify them?"], [2.4, ["email", " Istanbul", " Turkish", " waist"], "Google translate is your friend"], [2.5, ["return soon", " email"], "This is a question you want to answer, briefly."], [2.6, ["airport", " geographer", " email"], "You might see this on your checked luggage."], [2.7, ["abc", " chair"], "You're looking for someone from a land down under."], [2.8, ["email", " iso", " sums", " isosums"], "What do the answers to the questions have in common? Can you change them to a form that can be summed?"], [2.81, ["united states", " usa", " us", " america"], "Have you tried requesting assistance using this as an alias to your email? [Solvers should receive further guidance if they do so]"], [3.0, ["chat", " rules"], "try typing in the ten hundred most common words"], [3.01, ["chat", " words"], "There are a few different lists of words that might be used here, but a simple writer might help you find them."], [3.1, ["chat", " emoji"], "The different emoji react differently to different input - try to figure them out"], [3.9, ["chat", " mtproto"], "mtproto is a clue here - what does the chat app say about this?"], [100.0, ["extraction"], "There are three parts - have you read the available information to determine the order in which to use them?"]]