[[0.0, ["title", " flavortext"], "The title and flavortext contain references to something specific that it will be helpful to find."], [1.0, ["clues"], "Each clue refers to a specific fictional work."], [1.1, ["clues"], "Specifically, each clue refers to a romantic comedy film (from the year given)."], [1.2, ["clues", " films"], "In each clue, the three characters other than \"I/me\" are characters in the actual film, but \"I/me\" is not."], [1.3, ["clues", " films"], "Identifying the titles of the films will help."], [1.4, ["films"], "Specifically, the titles of the films, as a group, have a useful property."], [1.5, ["films"], "Specifically, the film titles start with the fourteen letters A to N, and their alphabetical order is important."], [1.6, ["films"], "The alphabetical order of the film titles is the only way the identities of the films are used."], [2.0, ["title", " flavortext"], "What the title and flavortext refer to is Descartes' Theorem about sets of four kissing/tangent/osculating circles. (Useful info on this can be found in Wikipedia article about it, among other places.)"], [2.1, ["title", " flavortext", " poem"], "Specifically, Descartes' Theorem relates the curvatures/bends of four mutually-kissing circles, and enables you to compute one from the other three. The poem suggests an application of this."], [2.2, ["poem", " clues", " bendiness"], "As suggested in the poem, you should compute the \"bendiness\" (curvature/bend) for \"I/me\" based on the \"bendiness\" of the other three characters."], [2.3, ["clues", " bendiness"], "The formula for calculating the unknown bend has a plus-or-minus in it, and thus gives two answers; the \"low bendiness\" or \"high bendiness\" is used to disambiguate."], [2.4, ["clues", " bendiness"], "Each bendiness you calculate should be of the form x.y (no rounding will be involved)."], [2.5, ["clues", " bendiness"], "For the clues where someone embraces the others, their bendiness is given only as an absolute value; that is because when one circle embraces all the rest, the bend used in the formula is *negative* one over the radius (if you try to use *positive* one over the radius for an embracing circle, you will get an answer not of the form x.y)."], [3.0, ["poem", " bendiness"], "As per the poem, each bendiness score will pick one word of the poem."], [3.1, ["poem", " bendiness"], "Specifically, a bendiness of the form x.y picks out line x, word y."], [3.2, ["poem", " bendiness"], "Also as per the poem, you must take the first sound of each word you get."], [100.0, ["extraction", " poem", " bendiness", " films"], "When you order the sounds by the alphabetical order of the film titles, you get NOW USE SODDY'S POEM"], [100.1, ["extraction"], "\"Soddy's poem\" in the extracted message is a poem by Frederic Soddy about Descartes' Theorem."], [100.2, ["extraction"], "Applying the same word-and-sound extraction to the first stanza of Soddy's poem gives a clue to the answer."]]