[[0.0, ["getting started"], "You're going to need to solve the minipuzzles. The next couple hints are for each of the minipuzzles."], [10.0, ["123 to the zoo", " getting started"], "Each list of letters contains two things in it. Get your tech people on this one."], [10.1, ["123 to the zoo", " still stuck"], "Specifically, get your people who know Mac OS X versions on this."], [11.0, ["the lamb and the butterfly", " drawing lines"], "AND is the keyword here."], [11.1, ["the lamb and the butterfly", " extraction"], "The flavor text mentions \"cross\" at the end. Where do the lines cross?"], [12.0, ["my very first book of motion", " getting started"], "This is a baseball scorecard. With baseball and the flavor text, you should be able to point to a specific thing in baseball that this puzzle is about."], [12.1, ["my very first book of notion", " id'd award", " now stuck"], "Isn't it interesting how the award winners of those years had six letter last names and every person had six at-bats in this game? Maybe each at-bat result can be associated with a letter."], [13.0, ["the nonsense show", " getting started"], "Each poem is cluing two words. They are very similar."], [13.1, ["the nonsense show", " still stuck"], "The top word is the bottom word minus the first two letters."], [13.2, ["the nonsense show", " extraction"], "The cluephrase clues the long word. You need the short word. Your answer will be five letters long."], [14.0, ["what's your favorite color", " getting started"], "This is a Boston-area specific puzzle. In particular, the letter T should mean something special there."], [14.1, ["what's your favorite color", " top pictures"], "These can all be associated with T stops, and they are an exhaustive set."], [14.2, ["what's your favorite color", " bottom pictures"], "The second one is an index into the first one."], [20.0, ["meta", " can't start"], "The Voracious Bookwyrm is a reference to a specific literary figure. Why were these books picked for this puzzle?"], [30.0, ["meta", " found book", " still stuck"], "The past 5 days the Voracious Bookwyrm has eaten certain fruits. What do those fruits have to do with these puzzles? Not the answers - the puzzles themselves."], [31.0, ["meta", " having trouble getting fruit from puzzles"], "For example, What's Your Favorite Color was about the Orangle Line on the T, and one of the fruits is an orange."], [40.0, ["meta", " extraction"], "The voracious bookwyrm ate certain fruits on certain days. Which letters did it eat?"]]