[[0.0, ["start"], "What do you do with these diagrams?  There's a hint in the title and flavortext."], [0.1, ["start"], "As suggested by the title and \"compels me to return\", you'll need to make a loop in each of these diagrams."], [0.2, ["start"], "There's an additional constraint suggested in the flavortext."], [0.3, ["start"], "What might be meant by \"I will go anywhere once\"?"], [0.4, ["start"], "The loop will visit each node (circle) once.  Not every edge will get used."], [2.0, ["diagrams", " paths", " loops"], "A node with only two available exits must use both of them."], [2.1, ["diagrams", " paths", " loops"], "If the node at one end of an edge can't use that edge, the node at the other end can't either."], [2.2, ["diagrams", " paths", " loops"], "Sometimes a connected section will have only two available exits; it must use both of them."], [3.0, ["letters", " now what"], "Do the letters spell anything?"], [3.1, ["letters", " now what"], "Did you see what you've missed?  Do those letters spell anything?"], [3.2, ["letters", " now what"], "Have you looked down, and also changed the perspective?"], [3.3, ["letters", " now what"], "The unused letters, listed from top to bottom within each diagram, are the ones to use."], [3.4, ["letters", " now what"], "But they need to be read in a different direction: all the first letters, then all the second, etc."], [4.0, ["knots", " Rolfsen", " message"], "Can you  identify what knot is pictured in each diagram?  Express your answers in terms of the table mentioned in the message."], [5.0, ["braid index", " braid length"], "The braid index and braid length of the knots in the puzzle has been provided so that you can confirm the knot identifications you've made."], [100.0, ["extraction"], "Each knot is identified using two numbers.  Can you see a way to read an answer from these?"], [100.1, ["extraction"], "The first number is just the number of crossings of the knot.  The second number is where the knot is in a list."], [100.2, ["extraction"], "The second numbers used in the puzzle range from 1 to somewhere in the 20s."], [100.3, ["extraction"], "The second number should be read as a letter."]]