[[0.0, ["starting"], "No really, text that number. It works."], [10.0, ["answering questions"], "Most of these are googleable. Hints for individual questions follow"], [10.1, ["26-100"], "This isn't looking for a specific number. It really wants you to estimate."], [10.2, ["Christmas"], "This is in reference to a song from 1991. Try googling \"haziest laziest Christmas song\""], [10.3, ["ambidexterous"], "This is a common joke. The enumeration you're looking for here is 5 3."], [10.4, ["Mannequin"], "You're looking for an actress with enumeration 3 8."], [10.5, ["Favorite Robot"], "There's a common theme between most of the answers here. We were being very cute with \"Crow\" Facts."], [20.0, ["have map"], "The Crow Fact #s will prove helpful in interpreting this map"], [30.0, ["have song", " still stuck"], "The crow facts clue specific monsters. Only those points on the map are relevant"], [40.0, ["NOW GO ONTO TWITTER"], "There's a twitter account at @CrowFacts3000 that is relevant to the puzzle."], [50.0, ["so many tweets"], "As indicated by Crow's last set of tweets, you're going to have to split this set of tweets into a number of groups. As indicated by the profile, what the tweets end with is the most important part. The rest is there to be funny."], [60.0, ["can't group the tweets"], "Each of the original 8 Crow Facts from the phone is a clue towards one of the groups. The next 8 clues are designed to help you get the groups according to the monster."], [61.0, ["Bubak Group"], "Bubak is known as the \"bag\" man, and he's got being scary in the \"bag\"."], [62.0, ["Déélgééd Group"], "Déélgééd sure has a lot of accents. Maybe it can lend some out to other words, like to the deja vu at the end of its fact."], [63.0, ["Peng Group"], "\"Body of water\" is the operative word here. However, we didn't necessarily pick obvious ones."], [64.0, ["Baba Yaga Group"], "This is a wordplay one, based on Baba Yaga's name."], [65.0, ["Impundulu Group"], "\"I'M CROW\" seems very close to \"CROW\". Anything else work like that?"], [66.0, ["Sasquatch Group"], "\"lengths\", \"feet\". There's a lot of them, so we had to go with some obscure ones. Sorry."], [67.0, ["Tatzelwurm Group"], "The fact ends with \"army knife\". This is not a big group."], [68.0, ["Kinga Group"], "Kinga is the villain from MST3K who forces people to watch the terrible videos the series is famous for."], [70.0, ["extraction"], "We couldn't tell you how many items were in each group from the start because that is involved with extraction."]]