[[0.0, ["map"], "Draw a map of what downtown Noir-leans looks like based on the information in the story."], [10.0, ["grid", " streets", " avenues"], "There are streets numbered 1 to 9 running east/west and avenues starting with A to I running north/south. The avenues are named after famous mystery authors, but avenue E is never named explicitly, which is an indication that you don't need to do anything with the author names."], [20.0, ["neighborhoods", " districts"], "There are also several references to neighborhoods or districts like Northwest, South Central, Central East, and Mid-Downtown. A careful reading reveals that 6th & F is Mid-Downtown but 7th & F is South Central, which suggests that North/Central/South divides downtown into thirds. Later on, 8th & H is referred to as \"the middle of Southeast\", which suggests that West/Central/East also divides into thirds."], [30.0, ["grid"], "Add it all up and you have a 9x9 grid divided into nine 3x3 subregions. What does that suggest to you?"], [40.0, ["grid", " sudoku"], "This is a sudoku."], [45.0, ["sudoku", " variant", " dragnets"], "The theme of the story and the idea of dragnets covering some number of contiguous city blocks suggests what kind of sudoku variant this is."], [50.0, ["sudoku", " killer", " dragnets", " hidden"], "This is a kind of killer sudoku. The dragnets are killer cages, in which the digits may not repeat and must sum to the given total. The story tells you that the sizes of the dragnets increase with every month, from 2 in February to 5 in May, so the month number is the killer cage size. What do you think the day of the month signifies?"], [55.0, ["sudoku", " killer", " dragnets", " date", " cage totals"], "The day of the month indicates the cage total. But you still need to figure out exactly how the cages are arranged; you only know one cell in each cage (the block where the body was found)."], [70.0, ["sudoku", " killer"], "Note to hint giver: If solvers are stuck at a specific part of the first Sudoku, and they send you an image of their grid, you can try fast forwarding through https://youtu.be/HFsLOaE1lUk until you find a similar-looking position and identify the next logical step they can take."], [80.0, ["message", " shift", " 9th", " east"], "The story refers to a ciphered message found \"on shift patrolling east along 9th street\". This is a hint that row 9 of the solved sudoku is the key to that cipher. You can use it to decode the message by Caesar-shifting."], [90.0, ["sudoku", " killer"], "The clue phrase is a URL that takes you to a second hidden killer sudoku puzzle. In this puzzle, all cages are 3-cell cages."], [91.0, ["sudoku", " killer", " count"], "This sudoku has 26 cage clues. 26 x 3 = 78, so the killer cages will cover every cell in the grid other than the three given digits. So you can use deductions like \"this cage is the only one that can reach this cell\"."], [95.0, ["sudoku", " killer", " anonymous", " tip"], "Note to hint giver: If solvers are stuck at a specific part of the anonymous tip Sudoku, and they send you an image of their grid, you can try fast forwarding through https://youtu.be/loinN3FoC7E until you find a similar-looking position and identify the next logical step they can take."], [100.0, ["extraction"], "You now have two completed sudoku grids, plus a little bit of flavor from the story that you haven't used yet: a reference to \"a kind of three-card poker\" with aces high and no combinations. How can you combine these to figure out where the killer is hiding?"], [100.1, ["extraction"], "The dragnets in the first sudoku covered almost all, but not quite all, of the 81 square blocks in the city. Perhaps the killer is in one of the areas that hasn't yet been covered."], [100.2, ["extraction"], "There are eight cells in the first sudoku grid that are not part of cages. In the completed grid, those cells contain the digits 1 through 8 with no repeats."], [100.3, ["extraction"], "In the second sudoku, there are 26 three-cell cages. That is an interesting number."], [100.4, ["extraction", " letters", " ordering", " poker"], "You can map each cage in the second sudoku to a letter of the alphabet if you can apply an ordering to the cages. Since each cage contains three digits, perhaps the three-card poker comes into play here. Note that the cages don't all have unique totals, but they do have unique compositions (e.g. the two 8 cages are 1-2-5 and 1-3-4, rather than both containing the same set of digits)."], [100.5, ["extraction", " letters", " ordering", " poker"], "Treat each cage as a poker hand (with 1 = ace). Rank the hands by poker order; there are no pairs or trips, since digits cannot repeat in a cage, and straights don't count. So it's just a high-card ranking, with tiebreaker being second-highest card."], [100.6, ["extraction"], "When you have sorted the cages from highest to lowest in poker order, map that to the letters A to Z. Then find the corresponding letter for each of the eight squares of interest from the first sudoku, reading them off in 1-to-8 order. That is the final answer."]]