[[0.0, ["grid"], "The four small grids shown must be assembled (with repeats) into an infinitely large grid."], [0.1, ["grid"], "Because the grids repeat, most clue numbers will appear repeatedly in the grid."], [1.0, ["clues"], "The \"clues\" use cryptic cluing, but not every \"clue\" is a single cryptic clue."], [1.1, ["clues"], "Specifically, each \"clue\" is actually 1–4 cryptic clues in succession; the parenthesized number(s) at the end is/are the enumeration(s) for the answer(s)."], [1.2, ["clues", " grid"], "If \"clue\" has multiple answers, each answer will be entered in the grid at at least once instance of the corresponding grid number"], [2.0, ["grid"], "Which entry will be used for a particular number must be deduced from the crossings."], [2.1, ["grid"], "The pattern of which entries are used in the grid forms repeating patterns."], [2.2, ["grid"], "The pattern of entries in the subgrids along the top repeats every 5 subgrids."], [2.3, ["grid"], "The pattern of entries in the subgrids along the left repeats every 3 subgrids."], [2.4, ["grid"], "The repeats in the subgrids along the top and the left cause the non-edge subgrids to repeat in 5x3 (horizontal x vertical) blocks."], [3.0, ["clues", " boldface"], "The boldface clues refer to items that are important for the final extraction."], [3.1, ["clues", " boldface"], "1 Down refers to an item that will appear multiple times in the competed grid."], [3.2, ["clues", " boldface"], "3 Down refers to an \"item\" that must be imagined as placed where described, in relation to the item from 1 Down."], [3.3, ["clues", " boldface"], "The items from 1 Down are the Y's in the grid; the items from 3 Down are mirrors which reflect everything on both sides."], [100.0, ["grid", " purple squares", " extraction"], "The letters in the purple squares are important for the final extraction."], [100.1, ["grid", " purple squares", " extraction"], "The letters in the purple squares should be examined with the mirrors in place."], [100.2, ["grid", " purple squares", " extraction"], "Looking between adjacent (widely-spaced) mirrors, you will see an infinite repeating pattern of Xs and Os in the purple squares."], [100.3, ["grid", " purple squares", " extraction"], "The repeating block of Xs and Os in this infinite repeating pattern is 8 x 3 (horizontal x vertical)."], [100.4, ["grid", " purple squares", " extraction"], "This 8 x 3 pattern can be read as 4 Braille letters."]]