[[0.0, ["images"], "The puzzle consists of a tournament-style bracket and a collection of images. Start by trying to identify the images; there's nothing you can do with the bracket until you know what's happening with the images."], [10.0, ["images", " google"], "Try to identify who or what is in each image and then maybe google combinations of people or things that appear in the same image."], [20.0, ["images", " 20"], "If you're still stuck on what is going on with these images, look at image #20. This image is a juxtaposition of two readily identifiable people (one real, one fictional). Google their names together and take a look at the first few results."], [30.0, ["images", " names"], "Every image represents the name of a real person."], [40.0, ["flavortext", " title", " bracket"], "There's a reason these images appear in a puzzle whose structure is a tournament bracket and in a puzzle called \"How to Install a Handle\". The puzzle has to do with a tournament bracket of interesting names."], [50.0, ["images", " names"], "There used to be (still is, maybe?) something called the \"Name of the Year\" tournament. Every year they would publish a bracket of incredible names, all verified real names of real people. Every image in this puzzle represents a name that has appeared in a Name of the Year bracket."], [55.0, ["ordering"], "The names are grouped by year, and the years are ordered from oldest to newest. Within each year, the names are given in the same order they appear on the bracket."], [60.0, ["bracket"], "Once you have identified the images, turn your attention to the bracket. Each name goes with its correspondingly \"seed\" number. What might you do with the list of numbers on the bracket line next to each seed number?"], [70.0, ["indexing", " bracket"], "Use the numbers to index into the names (exactly as the names appear on the Name of the Year bracket). The result of indexing into each name is an English word."], [80.0, ["matchup", " bracket"], "Each matchup in the bracket is at a specific location. Use that location's name as a way to manipulate the two competitors and find what goes on to the next round."], [81.0, ["matchup", " venue", " mixing bowl"], "For the Mixing Bowl, notice how the answer has the same number of letters as the two feeders combined."], [81.5, ["matchup", " venue", " mixing bowl"], "Anagram all the letters in both feeders to find the answer."], [82.0, ["matchup", " venue", " midway"], "For Midway Stadium, notice how both feeders and the answer all have the same number of letters."], [82.5, ["matchup", " venue", " midway"], "Find the letter halfway between each letter in the feeders for your answer. For example, if one feeder is A and the other G, your answer would be D."], [83.0, ["matchup", " venue", " portmanplex"], "For the PortmanPlex, it has nothing to do with Natalie Portman or suplexes. What ways of combining words would make sense?"], [83.5, ["matchup", " venue", " portmanplex"], "Create a portmanteau of the two feeders. The feeder on top will always begin the answer."], [84.0, ["matchup", " venue", " alternate"], "For Alternate Venue, notice how both feeders and the answer all have the same number of letters."], [84.5, ["matchup", " venue", " alternate"], "Alternate letters between one feeder and the other to find the answer. The feeder on top will always begin the answer."], [85.0, ["matchup", " venue", " mutual", " associate"], "For Mutual Associate Arena, each feeder can be found in a number of different groups - people, places, things, etc."], [85.5, ["matchup", " venue", " mutual", " associate"], "Find the answer that is part of a group alongside each feeder. For example, if the feeders were DIME (coins) and SHELDON (Big Bang Theory characters) the answer would be PENNY."]]