[[0.0, ["note", " labyrinth"], "The constructor's note indicates that the labyrinth will be 4x4; since there are 2 squares and 28 rectangles, each \"unit\" will be either a square or two rectangles put together."], [0.1, ["intro", " labyrinth"], "As suggested in the intro, not all the squares will be upright in the assembled labyrinth."], [1.0, ["intro", " minotaurs", " rectangles"], "The puzzle intro refers to twice-seven (i.e., fourteen) minotaurs; the fact that there are 14 rectangles with horned heads and 14 rectangles with legs is not a coincidence."], [1.1, ["minotaurs", " rectangles"], "Each rectangle with a head must be combined with a rectangle with legs to form a square with a minotaur."], [1.2, ["minotaurs", " rectangles", " clues"], "The phrases on the rectangles are crossword-style clues; they will help you match up the rectangles that form squares."], [1.3, ["clues"], "The answers to \"head\" clues and answers to \"tail\" clues can be matched up in pairs that resemble each other somewhat."], [1.4, ["minotaurs", " rectangles", " clues"], "Heads and legs can be matched up so that each \"legs\" answer is the result of removing the string MOO or the string LOW from the corresponding \"heads\" answer."], [2.0, ["note", " labyrinth"], "Once the minotaur squares have been assembled, the set of 16 squares that now exist can be uniquely assembled into the complete 4x4 labyrinth based purely on ensuring that every line where two squares meet has matching (black) paths on both sides."], [2.1, ["labyrinth", " logic"], "As a first step in figuring out how to assemble the labyrinth, note that the path pattern no path, no path, path, no path (clockwise) occurs on the edges of multiple squares, but the pattern that would match it does not occur at all."], [2.2, ["labyrinth", " logic"], "Specifically, every edge with the no-no-yes-no path pattern must be an exterior edge of the labyrinth."], [2.3, ["labyrinth", " logic"], "The 2x2 square in the middle of the labyrinth must be entirely made of squares that do not have the no-no-yes-no path pattern on any edge."], [2.4, ["labyrinth", " logic"], "In fact, there is only one way to assemble a 2x2 square out of four of the eight squares that have no no-no-yes-no edges. Finding it means that you have the 2x2 center of the labyrinth completely determined."], [3.0, ["labyrinth", " intro", " damsel"], "The damsel is the figure wearing a dress; as per the intro, once the labyrinth is assembled it must be rotated so this figure is upright."], [3.1, ["labyrinth", " intro", " damsel"], "According to the intro, the damsel shows the route out. In fact, once the labyrinth is assembled, there is indeed a single path which can be followed through all the squares to the damsel and then out."], [100.0, ["extraction", " intro"], "Following the path out of the labyrinth, you first encounter VIR, and then on each subsequence square encounter one or two consonants on the way in and a vowel on the way out. The significance of these letter groups you encounter is hinted at in the intro."], [100.1, ["extraction", " intro"], "The intro refers to things being written down in an old-fashioned and linear manner, and mentions Crete. This hints at what the significance of VIR and the consonant(s)-vowel combinations are."], [100.2, ["extraction", " intro"], "VIR and all the consonant(s)-vowel combinations are represented by characters in Linear B; thus, each square along the path indicates one Linear B character."], [100.3, ["extraction", " intro"], "The intro indicates that not every \"character\" is upright; this is important for reading the Linear B characters."], [100.4, ["extraction"], "If you write the Linear B characters, each rotated as per the square it is on, in the order they occur on the path outward, they will look like a sequence of English letters."], [100.5, ["extraction"], "The sequence of English letters that the Linear B characters (rotated, in path order outwards) resemble is a clue to the final answer."]]