[[0.0, ["What's going on?"], "Start by solving the first 4 puzzles -- they are a standard Yajilin (also known as \"Arrow Ring\") and 3 variants, whose rules are specified. There is nothing hidden or unexpected involved in solving the 8 puzzles."], [10.0, ["the 4 unnumbered grids"], "Each unlabeled grid, the ones after the 4 numbered grids) is the same type as one of the labeled grids. Figure out which is which, and then solve those additional grids."], [20.0, ["which unnumbered grid is which?"], "The unnumbered grid types, in left to right, top to bottom, order, are: Full Lane, One Off, Clued Loop, Standard"], [30.0, ["Tips?"], "There are many sites online that provide tips for solving Yajilin puzzles. In general, fill in as much \"immediate\" information as you can, drawing a line where a line must be, a dot where a line of unknown shape must be, and a black square where a black square must be. For example, in a standard Yajilin, a zero clue allows you to mark all squares in thet direction with dots. And in a completely blank 2x2 corner, you can mark the square 1 up and the square 1 over with dots, because if a black square were in either, you could never reach the empty corner. Mark all the \"easy\" steps, then certain other steps will become\"easy\" and you can mark those,\" and keep going. Sometimes you might need to look a step or two ahead, but you should never have to \"guess\" at any point and run out the logic of that guess for many steps. The various varants can require a bit deeper logic, but in general they are solved the same sort of way."], [100.0, ["extraction (1)"], "Once the grids are finished, pair them up by type. How might you extract a letter from each?"], [101.0, ["extraction (2)"], "What information in the puzzle have you not used yet?"], [103.0, ["extraction (3)"], "You haven't yet used the shapes above the upper right corner of each grid. How might you use those shapes to extract a letter from each pair of grids?"], [104.0, ["extraction (4)"], "For each pair of similar grids, overlap the grids, then count the number of squares displaying the intersections of the type shown."]]