[[0.0, ["clues"], "All the phrases under \"General locations\" and \"Cloaked visitors\" are crossword-style clues; the word-lengths for the answers are given in parentheses afterwards."], [1.0, ["locations", " clues"], "The answers to the \"General locations\" clues are all in a particular category."], [1.1, ["locations", " clues", " flavortext"], "The category containing all the \"General locations\" answers is hinted at in the flavortext."], [1.2, ["locations", " clues"], "All the \"General locations\" answers are names of past Mystery Hunt puzzles."], [1.3, ["locations", " clues"], "Specifically, all the \"General locations\" answers are names of past Mystery Hunt puzzles involving crosswords."], [2.0, ["visitors", " clues"], "The answers to the \"Cloaked visitors\" clues all have something in common."], [2.1, ["visitors", " clues"], "The term \"Cloaked\" hints at what the \"Cloaked visitors\" answers all have in common."], [2.2, ["visitors", " clues"], "The \"Cloaked visitors\" answers all can have their first and last letter removed to form something that is a reasonable crossword entry."], [3.0, ["locations", " visitors"], "Each \"Cloaked visitor\" answer, with its first and last letter removed, is an entry in (at least) one of the \"General locations\" crosswords."], [3.1, ["locations", " visitors", " flavortext"], "The flavortext hints at an important fact about the inclusion of the uncloaked \"Cloaked visitors\" answers in the \"General locations\" crosswords."], [3.2, ["locations", " visitors", " flavortext"], "As hinted at by the phrase \"same specific location\" in the flavortext, each uncloaked \"Cloaked visitor\" answer appears in the same location (clue number and direction) in one of the \"General locations\" crosswords."], [100.0, ["extraction", " flavortext"], "The second sentence of the flavortext hints at what to do with the answers to the first-letter and last-letter clues."], [100.1, ["extraction"], "Putting the \"Cloaked visitor\" answers in order by the \"General locations\" they correspond to, their first letters and last letters spell out clues."], [100.2, ["extraction", " flavortext"], "To get the final answer, you have to take the answers to the first-letter and last-letter clues, and separate them with the location (clue number and direction, the former in Roman numerals) at which all the uncloaked \"Cloaked visitor\" answers appear in their respective crosswords."]]