[[0.0, ["zero feeders"], "[ This hint is for any team that sends a hint request before they've solved any of the feeder puzzles. ]\r\nYou haven't solved any of this round's feeder puzzles yet.  Please wait until you've solved at least one before requesting any hints on the metapuzzle."], [1.0, ["KenKen", " calcudoku"], "What type of puzzle has regions labeled with a number and a mathematical operation?"], [2.0, ["KenKen", " letters", " numbers"], "[ Hint for teams who know they need to turn letters into numbers, but haven't yet figured out the right way to do that ]\r\nKenKen uses numbers, but feeder answers are made of letters.  Is there anything in the flavor text that seems to hint at a connection between numbers and letters?"], [2.1, ["KenKen", " letters", " numbers", " 1432", " nuts", " 13254", " bolts"], "The number 1432 is associated with the word \"nuts\" and the number 13254 is associated with the word \"bolts\".  Can you discover the puzzly method for turning those words into those numbers?"], [2.2, ["KenKen", " letters", " numbers", " alphabetical"], "Number the letters of each answer according to their alphabetical order.  The alphabetically earliest letter in the word will be numbered 1 and the alphabetically last letter will be numbered 9."], [3.0, ["KenKen", " numbers", " rows", " 3x3", " square"], "[ Note to hinters: A team may be uncertain whether to enter one 9-digit number per row or one per 3x3 square subsection.  This hint is for such hint requests. ]\r\nWe cannot confirm which method of entering digits into the grid is correct.  You will have to try them both and determine by process of elimination which is correct."], [3.1, ["KenKen", " numbers", " rows", " 3x3", " square"], "[ On the other hand, there may be teams who only think of entering one 9-digit number per 3x3 square subsection, and reach a dead end because they are stuck on that.  You may give those teams this nudge. ]\r\nCan you think of another, perhaps more straightforward, way of entering the 9-digit numbers in the grid?"], [100.0, ["KenKen", " extraction", " missing information"], "The flavortext says \"one of the diagrams seems to be missing important information\".  What information is missing from this puzzle that would be given in a non-Mystery-Hunt KenKen?"], [100.1, ["KenKen", " extraction", " missing", " target numbers"], "Several cages in this KenKen are missing their target numbers.  You should calculate those missing target numbers."], [100.2, ["KenKen", " extraction", " target numbers", " range"], "The target numbers are all within a certain range.  What common puzzle technique uses numbers in that range to indicate letters?"], [100.3, ["KenKen", " extraction", " target numbers", " alphabet index"], "The target numbers are an alphabet index.  A=1, B=2...Z=26  Convert the target numbers to letters for the final answer."]]