[[0.0, ["flavortext"], "The flavortext makes reference to a mural. This is important."], [0.1, ["flavortext"], "The flavortext makes reference to a mural. This is referring to an actual mural that exists in real life."], [0.2, ["flavortext"], "The flavortext makes reference to a mural. This is referring to an actual mural near Hayden at MIT."], [0.3, ["flavortext"], "The flavortext makes reference to a mural. This is referring to an actual mural near Hayden at MIT, which can be found by Googling \"mural\" \"Hayden\" \"MIT\"."], [0.4, ["flavortext"], "The flavortext makes reference to a mural. This is referring to an actual mural near Hayden at MIT; if you Google \"mural\" \"Hayden\" \"MIT\", you will find pictures of it, such as http://tech.mit.edu/V130/N18/graphics/topplaces-13.html"], [1.0, ["locations", " ministers"], "You are given descriptions of what the ministers are doing; where can the ministers be seen doing those things?"], [1.1, ["locations", " ministers"], "You are given descriptions of what the ministers are doing; you can find them doing these things in the mural mentioned in the flavortext."], [1.2, ["locations", " ministers"], "When you see the ministers doing these things in the mural, that establishes a left-to-right order of the ministers."], [2.0, ["ministers", " meta", " answers"], "Each minister's meta answer is a description. This is important."], [2.1, ["ministers", " meta", " answers"], "Each minister's meta answer is a description; for any item you may encounter, that description will be a correct or incorrect description of that item."], [2.2, ["ministers", " meta", " answers"], "Each minister's meta answer is a description. For each description, for each of the 25 individual puzzle answers, that description will be either a correct or incorrect description of that answer."], [10.0, ["ministers", " barker"], "The word \"somewhat\" can mean \"in part.\""], [10.1, ["ministers", " barker"], "Barker's description is a correct description of an individual puzzle answer if that answer contains the name of a bug."], [20.0, ["ministers", " dewey"], "There is a particular set of letters associated with colors that is important here."], [20.1, ["ministers", " dewey"], "There is a particular small set of letters associated with a particular small set of colors that is important here."], [20.2, ["ministers", " dewey"], "Dewey's description is a correct description of an individual puzzle answer if that answer's initial letter is in the set ROYGBIV."], [30.0, ["ministers", " hayden"], "How long is \"War and Peace\"?"], [30.1, ["ministers", " hayden"], "Hayden's description is a correct description of an individual puzzle answer if that answer has more than 11 letters."], [40.0, ["ministers", " lewis"], "Some individual puzzle answers do indeed have multiple component parts."], [40.1, ["ministers", " lewis"], "Lewis's description is a correct description of an individual puzzle answer if that answer has more than one word."], [50.0, ["ministers", " rotch"], "The term \"width\" can mean \"size measured horizontally on the page.\""], [50.1, ["ministers", " rotch"], "The Rotches' description is a correct description of an individual puzzle answer if that answer has an even number of letters."], [100.0, ["extraction"], "What Tock says hints at how you use the information about descriptions applying to individual puzzle answers."], [100.1, ["extraction"], "For each individual puzzle answer, you have five descriptions that may or may not be correct descriptions of that answer."], [100.2, ["extraction"], "For each individual puzzle answer, taking the five descriptions in mural order and seeing whether or not they are correct descriptions of  the answer gives you a five-bit sequence."], [100.3, ["extraction"], "Each five-bit sequence gives you a letter."], [100.4, ["extraction"], "Read the letters given by the five-bit sequences, in the order of the corresponding puzzles on the Puzzle List, to get the final answer."]]