[[5.0, ["albums", " covers", " art", " picture", " image", " graphic"], "These repeating pictures come from somewhere -- maybe the fact that they're on album covers is relevant?"], [10.0, ["albums", " covers", " art", " picture", " image", " graphic"], "The individual pictures are all from album covers -- and all from the same band"], [11.0, ["albums", " covers", " art", " picture", " image", " graphic", " Sparks"], "Sparks sure put out a lot of studio albums! How many have they published exactly?"], [12.0, ["albums", " covers", " art", " picture", " image", " graphic", " Sparks"], "There are close to 26 different clips of art among all the covers -- try to match them with letters."], [13.0, ["albums", " covers", " art", " picture", " image", " graphic", " letters"], "Matching the album art with letters is a straightforward chronological match -- A for the first album released, B for the second, and so on until Z for the last."], [20.0, ["albums", " covers", " art", " picture", " image", " graphic", " Sparks", " alphabet"], "There are as many album covers as there are pairs of sentences below -- try to find a one-to-one correspondence."], [30.0, ["Sentences", " text", " phrases"], "Can you find any famous stories that the pairs of sentences are describing?"], [31.0, ["Sentences", " text", " phrases"], "Each pair of sentences describes a story about a famous pair of siblings."], [90.0, ["siblings", " characters", " names", " scramble", " anagram", " bank", " pool", " leftover", " extra"], "Each cover seems to have extra letters beyond the scrambled character names -- try finding where the extra letters are on the album covers."], [100.0, ["siblings", " characters", " names", " scramble", " anagram", " bank", " pool", " index", " sentence"], "Each sentence has the same number of words as the number of letters in the name of the character it describes. Note where the Mael brother's name appears in each sentence."], [100.1, ["square", " sta", " north", " neighbour"], "The extracted clue is \"Russell Square Sta. North Neighbour.\" 'Sta' stands for station, and 'neighbour' suggests looking across the pond."]]