[[0.0, ["getting started"], "This puzzle is about an online experience that has happened over the past two years. If you don't recognize it, the best way to get it is to tackle the trigrams."], [10.0, ["puzzle structure"], "This puzzle consists of eight separate tracks of information, each corresponding to a different set of extra info at the bottom. \r\nThe next set of hints will be in reading order of the blanks on the page"], [20.0, ["Group 1"], "This deals with the props that the actress uses when the blue-bordered numbers appear on screen."], [20.1, ["Group 1", " need source"], "The relevant webpage is this: https://www.blaseball.wiki/w/Modifications"], [20.2, ["Group 1", " extraction"], "Those blue-bordered numbers are good indices."], [21.0, ["Group 2"], "This deals with the pictures that are on the left side of the whiteboard. You can ignore anything that the actress says while pointing to them."], [21.1, ["Group 2", " need break-in point"], "The name of the singing duo in the first video is a good break-in point here. Search the first word of that group name on the blaseball wiki."], [21.2, ["Group 2", " need source"], "The relevant webpage is: https://www.blaseball.wiki/w/Player_Attributes"], [21.3, ["Group 2", " extraction"], "The different number of people in each group is your index."], [22.0, ["Group 3"], "This deals with the team champion logos on the right side of each whiteboard."], [22.1, ["Group 3", " need break-in point"], "This is the stream of info that is closest to the original videos: https://www.youtube.com/watch?v=diAHuUV2Meg"], [22.2, ["Group 3", " don't recognize symbols"], "All of these are unicode emoji, as given by the link. Also, blaseball team logos are also unicode emoji."], [22.3, ["Group 3", " need source"], "The relevant webpage is: https://www.blaseball.wiki/w/Internet_Series"], [22.4, ["Group 3", " extraction"], "If you convert to numbers as per that site and subtract, you should get positive whole numbers in a puzzly range."], [23.0, ["Group 4"], "This deals with the symbols that show up whenever the video cuts to static."], [23.1, ["Group 4", " don't recognize symbols", " need source"], "The relevant webpage is: https://www.blaseball.wiki/w/Decrees"], [23.2, ["Group 4", " extraction"], "The number of symbols is your index."], [24.0, ["Group 5"], "This deals with the player names that are being said throughout the videos."], [24.1, ["Group 5", " need spelling"], "Certain accessibility features may help you here."], [24.2, ["Group 5", " need source"], "The relevant webpage is: https://www.blaseball.wiki/w/Incineration"], [24.3, ["Group 5", " need extraction"], "The added letters are your extraction."], [25.0, ["Group 6"], "This deals with the numbers and words written in the middle of the whiteboard in each video."], [25.1, ["Group 6", " don't recognize phrases"], "These refer to a specific person's Twitter account and their blaseball art: https://twitter.com/betaraycarrie"], [25.2, ["Group 6", " need source"], "Here are the links to each of her poster compilations per team: https://docs.google.com/document/d/e/2PACX-1vSHqGaWhfpQf0Fdd4UirDpOE2gX7IPnwv_dcckVM4RuMLzIM4n3I9Sa-pn2fGh1dEplnZsPoZysDLDC/pub"], [25.3, ["Group 6", " extraction"], "Each number can be replaced with a team to make the chain work. Index into the team's FULL NAME."], [26.0, ["Group 7"], "This uses specific words that the actress says throughout the videos."], [26.1, ["Group 7", " need source"], "This is the relevant page: https://www.blaseball.wiki/w/Category:History"], [26.2, ["Group 7", " need extraction", " missing some"], "Each year of the Mlystery Hunt has exactly one phrase, and each phrase can be associated with a blaseball season number."], [27.0, ["Group 8"], "This uses various plot points that are referenced in the video."], [27.1, ["Group 8", " having trouble with trigrams"], "Some of the words aren't traditional English words. Some words that might be tripping you up are UNDERBRACKET, ATTRACTORS, EARLSIESTA, and BLAGONBALL."], [27.2, ["Group 8", " can't relate trigrams to video"], "The messages in the trigrams are events from Blaseball's history. The video contains discussions about what it would look like if those events happened in the Mystery Hunt instead. You should be able to line up one trigram message per Mystery Hunt year."], [27.3, ["Group 8", " extraction"], "You should be able to line up each blaseball event to a specific season."], [30.0, ["these messages don't make any sense"], "There's an extra letter in each of them. When you remove the extra letters, the messages should hopefully make more sense."], [31.0, ["extra letters removed", " still don't make sense"], "Each one of these messages can describe a different data stream."], [40.0, ["extraction"], "The messages form a loop. Order the extra letters by that loop. Keep in mind that it's a loop, and doesn't have to start at the beginning."]]