[[0.0, ["joon"], "HINTERS: joon or Diana can handle hint requests on this puzzle, especially ones that involve how the individual bridge hands should be solved. If neither of us is on hinting shift, wake up joon (617-640-2089)."], [1.0, ["bridge"], "This sure is a puzzle about bridge! If you don't know how to play bridge, you should probably not be the person from your team who is tackling this puzzle."], [10.0, ["opening bid", " auction"], "In each auction, the opening bid has been obscured. You're probably going to want to figure out what it was."], [20.0, ["bidding system"], "The bidding system, as hinted in the flavortext, is Bridge World Standard:\r\n\r\nhttps://www.bridgeworld.com/pages/readingroom/bws/bwscompletesystem.html\r\n\r\nBoth North/South and East/West are using the same system."], [20.07, ["opening bid", " 7"], "East has opened the bidding on board 7, and South has come in with a 4D overcall to show a game-forcing two-suiter with diamonds and spades. What could East have bid? Take a look at the section of the Bridge World Standard notes called \"Initial Defensive-Action Requirements\" and scroll down to \"special situation defenses\"."], [20.1, ["opening bid", " 10"], "The opening bid in deal #10 is marked with an asterisk, meaning it is a conventional bid rather than a natural one. Take a look at the section of the Bridge World Standard notes marked \"Opening Bid Requirements\" and scan it carefully for something that looks like a good description of the South hand."], [20.11, ["opening bid", " 11"], "What on earth is the opening bid on deal #11 that would cause North to respond 5D? It must be an ace-asking bid. This isn't in the opening bids section of the Bridge World Standard system notes, but it is in Slam-Bidding Methods, section III (c)."], [30.0, ["declarer", " south"], "South is declarer on every deal, as is typically the case when bridge problems are presented in a book or article."], [40.0, ["declarer", " play"], "You'll need to figure out the next card to play on each deal. There's a clear-cut right answer in each case. Your goal is to give yourself the best chance to make the contract."], [50.0, ["rebus", " image"], "The page of images are rebus-style hints to the names of the cardplay techniques used in the deals. They are given in alphabetical order, which is not the same as the order in which the deals are presented."], [60.0, ["unique", " rank"], "The flavortext suggests that you won't be reusing any rank of card (aces, kings, queens, etc.) as the correct answers to the eleven play problems. This is indeed the case. If the answer to one deal is the jack of hearts, no other deal will require have a jack as the answer."], [70.0, ["ordering"], "The deals are presented in order of their final contract (with ties broken arbitrarily). This is not the order you should be extracting in. What might you use as an ordering?"], [80.0, ["opening bids", " unique"], "The 11 opening bids are not all different, so they are not the ordering mechanism."], [90.0, ["ordering", " cards"], "The answers to the 11 play problems are cards with 11 different ranks. Not only that, they are consecutive ranks from ace down to four. This is the ordering you should put the hands in (from high to low, which is the way cards are always ordered when you are shown a bridge hand)."], [100.0, ["extraction", " images"], "For extracting the final answer, you don't need to do anything with the names of the cardplay techniques suggested by the rebuses. They are just hints to help you with the play problems. Instead, focus on the two pieces of information you've been asked to figure out for each deal: the opening bid, and the next card played."], [100.1, ["extraction", " opening bids"], "The cards are the ordering mechanism. What about the opening bids? How might you convert them into letters for a final extraction?"], [100.2, ["extraction", " opening bids", " letters"], "There are 35 possible bridge bids from 1 club up to 7 notrump. This puzzle doesn't use any of the opening bids at the 5-, 6-, or 7-level, so if you converted each bid into a number, you wouldn't get anything above 26."], [100.3, ["extraction"], "Assign each opening bid a letter starting with 1 club = A, 1 diamond = B, etc. Read off these letters in the order indicated by the eleven different cards (from high to low). It might not look like words, but it can be parsed into a clue phrase."]]