[[0.0, ["getting started", " minipuzzles"], "The puzzle consists of 9 minipuzzles whose answers feed into \"The Grand Finale.\""], [1.0, ["getting started", " minipuzzles"], "In each minipuzzle, you will extract five numbers, which you will then use to get the solution to that minipuzzle."], [1.5, ["getting started", " minipuzzles"], "The way you will use the extracted numbers to reach the solution to each minipuzzle is hinted at in the flavortext of the overall puzzle."], [2.0, ["getting started", " minipuzzles"], "In each minipuzzle, you will extract 5 numbers (which could be of any size) in a certain order and, using the D'Hondt allocation method, allocate the given number of lanterns among them to generate the minipuzzle's solution. (There are D'Hondt calculators available online.)"], [2.1, ["minipuzzles", " d'hondt method"], "Generally speaking, the extracted numbers are analogous to votes and the lanterns are analogous to seats."], [10.0, ["afghan", "logic"], "Deduce the number of panels each knitter made and order those numbers alphabetically by the names of the knitters."], [20.0, ["dachshund"], "Calculate the number of buns left over each week."], [30.0, ["greyhound"], "Each shade of gray has a particular RGB value; those values have something in common."], [30.1, ["greyhound"], "In each given shade of gray, the red, green, and blue values are identical. Extract that common value for each square."], [40.0, ["Irish wolfhound"], "Take the radius of the largest moon of each planet listed, multiply by the factor shown, and round to the nearest whole number."], [50.0, ["otterhound"], "The abbreviations AB, RBI, BB, HR, and R refer to statistics in a certain sport."], [50.1, ["otterhound"], "During the years given, there was a baseball player on the New York Giants whose name frequently appears in puzzles and is suggested by the title of the minipuzzle."], [50.2, ["otterhound"], "Find the indicated statistics for noted Giants slugger Mel Ott."], [60.0, ["pharaoh hound", " cryptic"], "Note what appears in the unclued, highlighted grid entries."], [70.0, ["plott hound"], "Plot the given functions from 0 to 1, flip the x and y axes, and note the shape of the resulting line or curve."], [80.0, ["shikoku", " logic", " sudoku", " shikaku"], "The grid can be solved as a sudoku using all the given numbers and as a shikaku using only the highlighted numbers."], [80.1, ["shikoku", "logic", "shikaku"], "To solve a shikaku, divide the grid into rectangles, each of which contains a highlighted number and is the same size (in grid squares) as that number."], [80.2, ["shikoku", "logic", "shikaku"], "When the shikaku is solved, 5 of the rectangles in the grid will be of the same size and shape."], [80.3, ["shikoku", "logic", "shikaku", "sudoku"], "When the sudoku and shikaku are solved, there will be 5 rectangles that are 5 squares long, giving 5 5-digit numbers."], [90.0, ["trigg hound"], "Calculate the tangent of each given number in radians."], [100.0, ["extraction"], "The solution to each of the 9 minipuzzles was a 5-digit number. What significance do 5-digit numbers have in the US?"], [100.1, ["extraction"], "Each 5-digit number is the ZIP code of a place in the US. Those places have something in common."], [100.2, ["extraction"], "Each 5-digit number is the ZIP code of a place ending in -ville and starting with a letter from A-I, giving an order."], [100.3, ["extraction"], "Allocate the 99 lanterns among the ZIP codes using the D'Hondt method."], [100.4, ["extraction"], "Allocating the 99 lanterns among the ZIP codes results in 9 numbers, all of which are between 1 and 26."], [100.5, ["extraction"], "Translate the 9 numbers into letters (A=1, B=2, etc.)."]]