[[1.0, ["Starting point", " start", " walls", " houses", " pictures"], "Your goal is to re-assemble the animals' houses from the individual walls."], [5.0, ["logic", " walls", " photos", " houses"], "You can't re-assemble all the houses solely from the information in the pictures and HOA minutes."], [10.0, ["Walls", " photos", " houses"], "Do any of those inspirational sayings seem familiar?"], [10.1, ["walls", " photos", " houses"], "If the sayings don't seem familiar, maybe focus on the numbers.  584 seems like an awfully specific number."], [10.2, ["Walls", " photos", " houses"], "If you're having trouble finding a list of 584 things, maybe Perry Pig can help you look."], [15.0, ["walls", " photos", " houses"], "What are the two unique elements of Wall 16?"], [18.0, ["walls", " photos", " houses"], "Google \"Perry Index.\""], [20.0, ["Perry", " index", " aesop", " fables"], "The Perry Index wikipedia page is not the most reliable resource.  You might want to look for another online resource as well."], [30.0, ["Aesop", " fables"], "Do the specific fables that the posters reference have anything in common?"], [30.1, ["Aesop", " fables"], "You may have to refer to multiple sources, but you can find a title for each fable in the format \"The X and the Y,\" where X and Y are animals"], [40.0, ["walls", " photos", " houses", " matching", " assembly"], "If you've figured out what the numbers on the posters mean, then you should be able to use the furniture and the guidelines from the HOA to assemble the houses and choose between the two possible owners."], [50.0, ["houses", " assembly"], "The map in the HOA minutes will help you figure out how to arrange the assembled houses."], [80.0, ["Extraction", " houses complete"], "What else is different from house to house?"], [80.1, ["Extraction", " houses complete"], "Granted, the Decorative Wicker Ball is the world's most classy interior design element, guaranteed to raise your home's value, but might there be an additional reason that every house has them?"], [80.2, ["Extraction", " houses complete"], "There is more than one extraction in this puzzle.  The first one uses the wicker balls and the homeowners.  The result will tell you what to do next."], [100.0, ["Extraction", " walls", " blow down", " red"], "Which walls did the wolf blow down?"], [100.1, ["Extraction", " walls", " blow down", " red"], "What kind of code might the Three Pigs use?"], [100.5, ["Extraction", " walls", " blow down", " red"], "\"Blow down\" the red brick walls by removing them.  The resulting walls form a Pigpen Cipher (##XX).  Don't forget to place those disco balls!"]]