[[0.0, ["qr"], "Scanning the first QR code is a good first step."], [0.1, ["qr", " url"], "Note that the first QR code only gives a filename; you will need to attach it to the end of the URL given to give a full URL you can browse to."], [0.2, ["qr", " url"], "If you are wondering how to correct the URL, you might want to take a look at the filename the QR code gave you and see if you can see anything wrong with it."], [0.3, ["qr", " url"], "Specifically, the filename the QR code gave you has a misspelling that must be corrected."], [1.0, ["qr", " webpage"], "When a webpage has two black-and-white grids, the one marked with a direction is a complete QR code, while the one marked \"Here\" is not."], [1.1, ["qr", " webpage"], "You will need to do the same thing to the QR code marked with a direction that you did to the original QR code at the start."], [1.2, ["webpage", " directions"], "The directions over the QR codes will enable you to arrange the webpages in a 2-dimensional array."], [1.3, ["qr", " webpage", " directions"], "When you know how the webpages are arranged, this lets you put the 15x15 black-and-white patterns together into a 45x45 QR code."], [1.4, ["qr", " webpage", " directions"], "The 45x45 QR code you get, when scanned, gives an instruction directly (not a URL)."], [2.0, ["qr", " decode"], "The 21x21 QR codes referred to in the instruction (from the 45x45 QR code) are the 21x21 QR codes you already used to get the URLs."], [2.1, ["qr", " decode"], "As per the instruction (from the 45x45 QR code), you will need to directly decode the 21x21 QR codes, which is likely to involve some research to find out how this is done. (The Wikipedia article on QR codes has useful information on this, and you may find other sources on the web.)"], [2.2, ["qr", " decode"], "The \"data-encoding region\" referred to in the instruction (from the 45x45 QR code) is the part of the QR code that has the encoded text written directly in it in a binary code; you will need to find it, apply a \"mask\" pattern of 0s and 1s to it, and read it off. The \"ignoring all error correction\" part means you should not do (and thus don't need to worry about) any of the fancy error-correction math that QR code scanners automatically do."], [2.3, ["qr", " decode"], "Four things that you need to know about a QR code before you decode it are (1) its size, (2) its error correction level, (3) its mask pattern, and (4) its encoding mode (numeric, alphanumeric, byte, or kanji/kana)."], [2.4, ["qr", " decode"], "You know the size; the error correction level and mask pattern are indicated in the \"format info\" section of the QR code, and the encoding mode (once the QR code has had its mask applied) is encoded in the lower right-hand corner."], [2.5, ["qr", " decode"], "As a time-saver: The size (21x21), error correction level (L), mask pattern (alternating horizontal rows of 1s and 0s), and encoding mode (bytes) are exactly the same as in the example in the Wikipedia article in the right-hand diagram under \"Encoding\"."], [2.6, ["qr", " decode"], "You can use the right-hand diagram in the Wikipedia \"QR Code\" article under \"Encoding\" to find out exactly which squares give which bits in which bytes of the encoded message. (Don't forget to apply the mask to the bits.)"], [100.0, ["extraction"], "The result of directly decoding each 21x21 QR code will differ from the filename you got by scanning it. (This is because the scanner applied error correction, and you did not.)"], [100.1, ["extraction"], "Specifically, the result you get by directly decoding has an underscore in place of one of the letters in the filename you got by scanning."], [100.2, ["extraction"], "Each correction you made to a filename to get to the right web page involved a inserting a missing letter."], [100.3, ["extraction"], "The letters replaced by underscores, ordered by the missing letters you originally reinserted, will give the final answer."]]