[[0.0, ["games", " genius", " korean", " rules", " aha"], "These are 8 games from the Korean show The Genius. You will need to know the rules for each game first in order to solve each mini-puzzle."], [1.0, ["first", " mini game", " 1", " 5:5 game", " rules"], "The first mini-game is the 5:5 game."], [1.1, ["first", " mini game", " 1", " 5:5 game", " rules"], "You need to identify the set of uppercase letters that would provide 5 \"Yes\" and 5 \"No\" answers to all of the questions."], [2.0, ["second", " mini game", " 2", " black", " white", " rules"], "The second mini-game is Black and White II."], [2.1, ["second", " mini game", " 2", " black", " white", " rules"], "You need to determine the sequence of play based on the logical clues provided."], [3.0, ["third", " mini game", " 3", " gyul", " hap"], "This is the game Gyul, Hap!"], [3.1, ["third", " mini game", " 3", " gyul", " hap"], "There are 64 Haps to be found across the 14 boards."], [3.9, ["third", " mini game", " 3", " gyul", " hap"], "The total number of Haps found for each pair of boards matched to the final row of 7 cards can be used to extract a letter."], [4.0, ["fourth", " mini", " game", " 4", " indian", " hold'em", " rules"], "The fourth mini-game is Indian Hold'em."], [4.1, ["fourth", " mini", " game", " 4", " indian", " hold'em", " rules"], "You need to determine the unknown Player 1 cards and use all the cards in his 7 winning hands to get the answer for this mini-game."], [5.0, ["fifth", " mini", " game", " 5", " monorail", " rules"], "The fifth mini-game is Monorail."], [5.1, ["fifth", " mini", " game", " 5", " monorail", " rules"], "You need to determine the next winning move by Player 1 in each of the 8 positions, and overlay those tiles to trace out the answer for this mini-game."], [6.0, ["sixth", " mini", " game", " open", " pass", " rules"], "The sixth mini-game is Open, Pass."], [6.1, ["sixth", " mini", " game", " open", " pass", " rules"], "You need to choose a deck of cards, and create a mathematical equation to beat the target score. Remember that the equation is built right-to-left, but read left-to-right."], [6.5, ["sixth", " mini", " game", " open", " pass", " rules"], "While you may get lucky, the easiest path to victory is by knowing exactly where your multiplication signs are in the deck."], [7.0, ["seventh", " mini", " game", " 7", " truth", " detector", " rules"], "The seventh mini-game is Truth Detector."], [7.1, ["seventh", " mini", " game", " 7", " truth", " detector", " rules"], "You need to determine the secret 4-digit number for each player, and extract from PLAYER1/2 to get the answer for this mini-game."], [8.0, ["eighth", " mini", " game", " 8", " twelve", " janggi", " rules"], "The eighth mini-game is Twelve Janggi."], [8.1, ["eighth", " mini", " game", " 8", " twelve", " janggi", " rules"], "You need to solve how Player 1 could mate with 4 moves using the General, with optimal play by Player 2. Like a chess puzzle, the correct mating sequence, has possible variations depending on Player 2's defence, but the longest Player 2 can delay the mate is until move 4. The simulator will provide the answer for this mini-game when a correct move sequence is played."], [100.0, ["meta", " new", " ninth", " last", " mini", " game", " 9", " rules", " extraction"], "The last mini-game is not from The Genius and is a mini-meta which uses the 8 answers from the other mini-games."], [100.1, ["meta", " new", " ninth", " last", " mini", " game", " 9", " rules", " extraction"], "Each of the 8 mini-games give a 7-letter answer. You need to use these answers with the last mini-game/meta."], [100.2, ["meta", " new", " ninth", " last", " mini", " game", " 9", " rules", " extraction"], "The given image of the actual garnet from The Genius is important to how you can use the eight 7-letter answers for the mini-meta. Notice that it has been image-edited to include an arrow-head."], [100.3, ["meta", " new", " ninth", " last", " mini", " game", " 9", " rules", " stacking", " extraction"], "The 7 letters of each answer should each be filled on the corners of a garnet in the order of the arrow shown in the given garnet image. The garnets then should be stacked in a tower such that 3 matching letters on adjacent faces touch (rotating as necessary). The fourth letter of one garnet touches the unknown letter of the adjacent garnet and this is used for the extraction."], [100.4, ["meta", " new", " ninth", " last", " mini", " game", " 9", " rules", " extraction"], "The answer SUPPORT is at the base of the garnet tower."], [100.5, ["meta", " new", " ninth", " last", " mini", " game", " 9", " rules", " stacking", " visualize", " extraction"], "A possible way to represent the cubes in 2D format for solving online could be to follow the given garnet image and use two diamonds to represent the corners of the top and bottom faces, and fill the corresponding letters there in the right order (rotating if necessary) to match and stack them up."]]