[[0.0, ["video clips", " star wars", " ordering"], "These are short video clips from Star Wars (1977). The clips are not given in chronological order in the movie. Reordering them might be a good start. You've probably seen this movie, but even if you haven't (or you don't remember it perfectly), you can find a script by googling."], [10.0, ["captions"], "Each clip has three captions. Some of the captions are Star Wars-adjacent, but try not to be distracted by that. Some of them obviously have no surface sense, and that's okay because the meanings of the captions are utterly irrelevant."], [20.0, ["captions", " flavortext", " celebrity disguises"], "The flavortext mentions \"celebrity disguises\". Have you ever seen that phrase in a puzzle before?"], [25.0, ["captions"], "The three captions on each video are three different kinds of clues to the same answer. You have to figure out which is which because they're not given in the same order."], [30.0, ["captions", " flavortext", " celebrity disguises"], "The flavortext also mentions \"initially\", \"mixed up\", and \"seeing the pattern\". This are three hints as to what to do with the captions."], [40.0, ["captions", " celebrity disguises"], "This is a Celebrity Disguises puzzle, of the kind sometimes seen in Games Magazine or Kappa variety puzzles. Each set of captions clues a famous person. One caption has the same initials, one is an anagram of the person's name, and one has the same vowel/consonant pattern and enumeration. (Y is treated as a vowel.)"], [50.0, ["anagrams", " lengths"], "You might wonder, if one clue is an anagram and one has the same enumeration as the answer, why aren't there always two captions with the same number of letters? The answer is that each of the anagrams includes two extraneous letters."], [55.0, ["lengths", " anagrams", " initials", " vowel/consonant pattern"], "You can figure out which caption is which kind of clue by noting that the person's initials must appear in the anagram, and the anagram must be two letters longer than the vowel/consonant pattern."], [60.0, ["anagrams", " extra letters"], "Extracting the two extra letters (leave them in the same order relative to each other as they appeared in the anagram) and reading them off in movie order spells out a clue phrase."], [70.0, ["celebrities"], "Why these 14 celebrities? They certainly don't have anything to do with Star Wars. Do they have anything to do with each other?"], [80.0, ["celebrities", " sgt. pepper", " album cover"], "All of these celebrities are depicted on the cover of Sgt. Pepper's Lonely Hearts Club Band (by the Beatles). So the message you extracted from the extra bigrams applies to the liner notes of Sgt. Pepper."], [90.0, ["sgt. pepper", " star wars"], "Okay, so why is this puzzle about Star Wars now suddenly a puzzle about Sgt. Pepper?"], [99.0, ["sgt. pepper", " star wars", " princess leia's stolen death star plans"], "There is a parody album called \"Princess Leia's Stolen Death Star Plans\" by a band called Palette-Swap Ninja. It is basically a note-for-note cover of Sgt. Pepper with all the lyrics changed into the entire plot of Star Wars. You can find the whole album as a YouTube playlist; that album is what this puzzle is about."], [100.0, ["extraction"], "Use the numbers you got from the Sgt. Pepper CD liner notes for each celebrity appearing on the album cover. Index those numbers into the corresponding track title from Princess Leia's Stolen Death Star Plans."], [100.1, ["ordering", " extraction"], "Remember the original ordering of the video clips? You haven't used it yet. Read off the letters you've extracted in the original video order to get a clue phrase."]]