[[0.0, ["base 12", " duodecimal"], "Yes.  The fact that each keyphrase has twelve unique letters, and the presence of the digit B in Prof. Upham's deductions confirm that these division problems use base 12 (duodecimal) arithmetic."], [0.1, ["double key", " colors"], "The two colors in each cryptarithm represent different and completely independent keys.  When a letter represents a digit in one key, it does not necessarily represent that same digit in the other key.  This is confirmed by the given values in the first cryptarithm:  In \"FRANTICGHOUL\" (the dark red letters) R = 1, but R does not equal 1 in \"WEIRDPHANTOM\" (the blue letters), because P = 1 in that key."], [1.0, ["Cryptarithm 1", " IRRATIONAL", " HORRID", " LURCH", " FRANTICGHOUL", " WEIRDPHANTOM"], "If a team is stuck on Cryptarithm #1, and they describe the precise point where they are stuck, you may be able to get them unstuck by referring to p. 2 of this cryptarithm solution walkthrough: https://docs.google.com/document/d/1c4yQfUymVmQh6sYQf0nLNaGAbjXSFo-M_IEC_DJlnB8/edit?usp=sharing"], [2.0, ["Cryptarithm 2", " SORROWFUL", " MOURN", " WITCH", " AWFULMONSTER", " DUNWICHBEAST"], "If a team is stuck on Cryptarithm #2, and they describe the precise point where they are stuck, you may be able to get them unstuck by referring to p. 3 of this cryptarithm solution walkthrough: https://docs.google.com/document/d/1c4yQfUymVmQh6sYQf0nLNaGAbjXSFo-M_IEC_DJlnB8/edit?usp=sharing"], [3.0, ["Cryptarithm 3", " NECRONOMICON", " OLDONES", " MOLDY", " GHASTLYDEMON", " ELDRITCHMOAN"], "If a team is stuck on Cryptarithm #3, and they describe the precise point where they are stuck, you may be able to get them unstuck by referring to p. 4 of this cryptarithm solution walkthrough: https://docs.google.com/document/d/1c4yQfUymVmQh6sYQf0nLNaGAbjXSFo-M_IEC_DJlnB8/edit?usp=sharing"], [100.0, ["extraction", " CTHULHU", " FHTAGN"], "Are the words CTHULHU and FHTAGN involved in the extraction?\r\nNo.  They are part of the iconic Lovecraftian phrase used for the extraction, but they are not used in the extraction itself."], [100.1, ["extraction", " first line", " second line"], "Do we resolve the first line before the second line, or the second line before the first?\r\n\r\nThe second line needs to be resolved before you can resolve the first line."], [100.2, ["extraction", " apostrophe", " division bracket"], "Are the symbols on the second line apostrophes or division brackets?\r\n\r\nIn the original Lovecraftian phrase, there were apostrophes at those positions, but for the purposes of this puzzle, interpret them as division brackets."], [100.3, ["extraction", " second line", " division", " values"], "We have the following values for the division problems in the second line of the extraction.  Are these correct?\r\n\r\nThe intended values for the four division problems in the second line of the extraction are as follows:\r\n12 divided into 3095A,    1099 divided into 5409,     7 divided into 9B19,     2702 divided into A408"], [100.4, ["extraction", " first line", " ten letters", " final answer"], "We are getting the ten letters XXXX, X, XXXX, X as our final answer.  What's wrong?\r\n\r\nThe intended answer for this puzzle is WHITE TUNIC.   Hinters should not tell solvers that directly, but hinters may choose to tell solvers how many letters they have correct and how many they have wrong."]]