[[0.0, ["start"], "Start by factoring the smaller numbers. The website www.wolframalpha.com may help (but feel free to use any tool you like). You do not need to factor all the numbers at this point. In particular, any attempt to factor \"N\" or the numbers in the \"Extra practice\" section at this point will likely be unsuccessful."], [1.0, [""], "The numbers in the \"Factoring practice\" section can be organized into four groups based on the properties their factors have."], [1.1, [""], "The numbers in the \"Factoring practice\" section can be organized into four groups based on the properties their factors have.  Each number in the \"Extra practice\" section also belongs to one of these groups."], [2.0, [""], "You (or someone on your team) will need to write some programs to solve this puzzle."], [2.1, [""], "For each of the four groups (i.e, for each of the properties that each pair of factors may have), it is possible to write a program to quickly factor any number that has a factorization of that form. Once you have written such a program, try applying it to every number in the puzzle and see which ones factor in that way."], [26.1, ["Program writing -- Twin Prime group"], "If M is a product of two primes which differ by 2, then we can write M = (x-1)*(x+1) and then solve for x."], [27.1, ["Program writing -- Almost-all-1's group"], "There are not that many k-digit numbers with the property that all but one of their digits are 1.  Write a program to generate them all, then try dividing the given number by each of them, for all k less than the number of digits in the given number."], [28.1, ["Program writing -- 123/789 group"], "Suppose the given number is M and its factors are x and y (where x uses the digits {1,2,3}, and y uses the digits {7,8,9}).  Suppose M ends in the digit 1.  What is the last digit of x and y?  Now suppose the final two digits of M are \"31\".  What might the last two digits of x and y be?  As you extend this line of reasoning to more digits, how many products do you have to check, given the work you've already done?"], [29.1, ["Program writing -- Swapped Halves group"], "Suppose the given number is M and it has between 4k-3 and 4k digits.  Then each \"half\" has k digits, and we can write the factors as (10^k * u  +  v) and (10^k * v  +  u).  So  \r\nM  =  (10^k * u  + v)*(10^k * v  +  u)\r\nM  =  10^(2k)*(u*v)  +  10^k*(u^2)  +  10^k*(v^2)  +  (u*v)\r\nObserve that u*v, u^2, and v^2 are each at most 2k digits.  (Say they each have exactly 2k digits, allowing for a leading 0.  Also assume M is 4k digits.)  Then the terms in the above sum are:\r\n10^(2k)*u*v:   2k digits of u*v followed by 2k zeros.\r\n10^k*(u^2):  2k digits followed by k zeros.\r\n10^k*(v^2):  2k digits followed by k zeros.\r\n(u*v):  2k digits.\r\nSo the final k digits of M are the low k digits of (u*v).  And the initial k digits of M are the initial k digits of (u*v), or they would be if not for carries from the addition of the u^2 and v^2 terms.  So we can almost read off the value of (u*v).  If we have that, we can compute u^2 + v^2, and from those we can compute u and v."], [50.0, [""], "Look carefully at the factorizations of the numbers in the \"Extra practice\" section.  Each one contains a message."], [50.1, [""], "For three of the numbers in the \"Extra practice\" section, you can read a message by taking the digits of the factors two at a time and converting 01-26 into A-Z.  Stop when you get to \"99\" and ignore any digits which follow.  For the number whose factors contain the digits {1,2,3} and {7,8,9}, count the lengths of the runs of 1's and 7's, and convert 1-26 into A-Z.  Ignore the ends of these factors."], [51.0, [""], "In each of the four cases, the instruction from the \"Extra practice\" number should be applied to the factors of the 12 numbers in the \"Factoring practice\" section which have the same form as the number from which the message came."], [76.1, ["Twin primes / Base-36 group"], "When converted to base 36, each value should consist of a sequence of letters, followed by a non-letter (i.e, a digit 0-9), followed by zero, one, or two more characters. (In other words, the first non-letter should be the last, second-to-last, or third-to-last character.) If you do not have this, either you are not converting the appropriate things to base 36, or you should double check your computations."], [76.2, ["Twin primes / Base-36 group"], "Each sequence of letters is a word or phrase with some letters missing. Once these have been identified, the word or phrase doesn't matter; only the missing letters are relevant."], [76.3, ["Twin primes / Base-36 group"], "Each sequence of letters is a word or phrase with some letters missing.  Each set of missing letters is an anagram of something."], [77.1, ["Almost-all-1's / Morse group"], "Once converted to ternary, you should treat 1's as dots, 2's as dashes, and 0's as spaces and interpret the result as Morse code.  There is no relevance to repeated 0's.  In each case, the Morse code should read as a word or phrase. If you do not have this, either you are not converting the appropriate things to ternary, or you should double check your computations."], [77.2, ["Almost-all-1's / Morse group"], "There's important information in the factors that are almost all 1's."], [77.3, ["Almost-all-1's / Morse group"], "Each word or phrase from the Morse code describes a particular ordered list. In each case, the number of items in that list equals the number of digits in the almost-all-1's factor.  Use the location and value of the non-1 digit to extract a single letter for each of these."], [78.1, ["123/789 group"], "Each factor consisting of the digits {1,2,3} represents a sequence of x-coordinates and the corresponding factor consisting of the digits {7,8,9} represents a sequence of y-coordinates."], [78.2, ["123/789 group"], "Each factor consisting of the digits {1,2,3} represents a sequence of x-coordinates and the corresponding factor consisting of the digits {7,8,9} represents a sequence of y-coordinates.  If each factor has k digits, then these represent a sequence of k points in the plane, all within a certain 3x3 rectangle. Draw lines between these points in order."], [79.1, ["Swapped halves / T9 group"], "When you take the difference between the two halves, in each case the result should be a number without any 0's or 1's.  This value may have fewer digits than the halves themselves.  If this isn't true, then either you're not applying this instruction to the proper numbers, or you should double check your computations.  Now you must turn this number into a word or phrase by converting 2 to A, B, or C; 3 to D, E, or F; ... and 9 to W, X, Y, or Z.  You'll have to figure out what makes sense.  For all but the shortest ones, it should be clear when you have the correct word or phrase."], [79.2, ["Swapped halves / T9 group"], "Interpret these words or phrases as though they appear in a cryptic crossword clue.  Each produces a single letter."], [80.0, ["Key phrase"], "Each of the 48 numbers in the \"Factoring practice\" section yields a single letter.  Reading these in the order the numbers appear in the puzzle will produce an important piece of information."], [95.1, ["Final program"], "Let x and y be the factors of N, with x<y.  Consider the value of D = y-x."], [95.2, ["Final program"], "Let x and y be the factors of N, with x<y.  Consider the value of D = y-x.  Given the information from the clue phrase (combined with the fact that x and y are 140 digits and both odd), there are fewer than 100 possibilities for the value of D.  If you knew the value of D, then you would have the equations y = x+D and N = x*y which allows you to solve for x.  Try this for each possible value of D."], [100.0, ["extraction"], "Ignore the first and last digits of the factors. Then read two digits at a time, converting 01-26 to A-Z."]]