[[0.0, ["crossword", " diagramless"], "This looks like a whole bunch of diagramless crossword puzzles with their clue lists combined into one, and that's exactly what it is."], [10.0, ["number", " grid", " size"], "Based on the number of 1-across clues (since every crossword has a 1-across), there are seven crosswords here. Based on the fact that the clue numbers don't go very high, the grids are not that big. Based on the title, you might guess that they're 7x7, and you'd be right."], [20.0, ["flavortext", " rules"], "The flavortext refers to following certain rules when you make crosswords, and all of these grids follow those standard rules: rotationally symmetric placement of black squares, no unchecked letters, no two-letter words, no rows or columns of all black squares, all-over interlock."], [30.0, ["flavortext"], "You can solve all seven grids. Each grid has a different black square pattern (and, you've probably already noticed, lots of X's—three per grid). But what now? Is there any part of the flavortext you haven't used yet?"], [40.0, ["flavortext", " first", " last"], "\"From the first letter to the last\". What could that be referring to?"], [50.0, ["clue ordering"], "Have you noticed anything interesting about the ordering of clues that have the same number?"], [60.0, ["clue ordering"], "For the most part, clues that share a number are ordered alphabetically by clue. But this is not true of the clues for 1-across and 1-down."], [70.0, ["flavortext", " clue ordering", " first", " last"], "Can you apply the flavortext to the 1-across and 1-down clues?"], [80.0, ["first", " last", " acrostic"], "The first letters of the 1-across clues are an acrostic for MALAIKA. The last letters (actually, the last alphanumeric characters) of the 1-down clues spell out 7XWORDS."], [90.0, ["7xwords"], "This puzzle refers to the 7xwords Project, organized by Malaika Handa. This was a project to construct one crossword for each of the 312 valid 7x7 grid patterns that follow standard crossword rules, 6 per week lasting all 52 weeks of 2021. Some of the crosswords were made by Malaika herself, but many were by outside contributors."], [95.0, ["7xwords", " grids"], "Using the 7xwords gallery, you can find the unique date corresponding to each grid pattern of the seven 7x7 grids you've already solved. Each of those solved grids contains three X's. You can use these to pick out three letters of the corresponding grid from the 7xwords project."], [99.0, ["extraction", " ordering"], "Put the grids into chronological order by their corresponding grid in the 7xwords project and read off the three extracted letters from each grid to get a message."], [100.0, ["extraction"], "That message tells you to look at the clues from October 19. The October 19 puzzle (published under the low-key palindromic pseudonym \"Jesse J.\") has 14 clues; read off the first and last letter (or digit) of each clue for the final answer."]]