[[0.0, ["identification", " conversations", " dialogue"], "There are four groups of celebrities. What connects the members of each group?"], [5.0, ["conversations", " dialogue", " highlights"], "The full bordered box for each conversation represents a beginning. The bottom-bordered box represents an end."], [10.0, ["1", " one", " first", " group"], "[hint for conversation 1] This clue relates to a famous group of four awards."], [11.0, ["1", " one", " first", " group"], "[solution for convesration 1] This clues EGOTs, and in particular people who are one award short."], [20.0, ["2", " two", " second", " group"], "[hint for conversation 2] This clue points toward airports."], [21.0, ["2", " two", " second", " group"], "[solution for conversation 2] This clues people with codes for major US airports in their names."], [30.0, ["3", " three", " third", " group"], "[hint for conversation 3] This clue points towards CGI cats that come together to sing exciting numbers."], [31.0, ["3", " three", " third", " group"], "[solution for conversation 3] This clues cast members from the movie version of Cats."], [40.0, ["4", " four", " fourth", " group"], "[hint for conversation 4] This clue points to a long-running Saturday night feature with a rotating host."], [41.0, ["4", " four", " fourth", " group"], "[solution for conversation 4] This clues members of SNL's five-timers club."], [70.0, ["flavortext", " celebrities", " order"], "Does anything in the flavortext suggest a way you could connect celebrities to each other on the board?"], [70.1, ["celebrities", " order"], "Each group of celebrities can be navigated from start to finish by a series of knight moves, so that the whole board is a complete knight's tour."], [100.0, ["extraction"], "Sometimes, messages aren't revealed in a single straight line."], [100.1, ["extraction", " order"], "If extracting all the letters for each group separately isn't working, try plotting all the letters out on the combined board."], [100.2, ["extraction", " manages", " for", " hat", " hatl"], "Try reading around the board in a spiral."]]