[[0.0, ["crossword", " korean"], "The text on the page is mostly in Korean. You don't absolutely have to know Korean to solve it, but it would help to know that Korean is written in an alphabetic script (unlike, say, Chinese) which you can teach yourself how to read as you solve this puzzle. The script is called hangul and it has the convenient feature that it is phonetically faithful; by learning the sounds corresponding to each letters you can read hangul and pronounce Korean."], [10.0, ["flavortext", " korean", " translating"], "The English part of the flavortext tells that not even a dictionary will help you. The second half of the flavortext is in Korean; pasting it into Google Translate tells you \"neither will Google Translate\". This is important. You *don't* need to translate from Korean to solve this puzzle!"], [20.0, ["korean", " english"], "If it doesn't require translation, the only real possibility is that the clues are actually regular English-language clues encoded in Korean (but not translated into Korean). How might they be encoded?"], [30.0, ["korean", " transliteration", " phonetic"], "The clues are English-language clues *transliterated* into Korean and rendered in hangul. To solve them, you just need to pronounce them out loud (or have Google text-to-speech pronounce them for you) and try to figure out what English text is being pronounced."], [31.0, ["korean", " hangul"], "Hangul has 14 consonants and 10 vowels. The language is written in blocks, with each block corresponding to one syllable. Each syllable has a starting consonant (which can be the silent consonant), followed by a vowel or diphthong, optionally followed by an ending consonant (or in rare cases, a two-consonant cluster)."], [32.0, ["korean", " hangul"], "The consonant ㅇ sounds like \"ng\" when it appears at the end of a syllable, but is silent when it appears at the start of a syllable. Korean, like English, does not have words that begin with the \"ng\" sound."], [33.0, ["korean", " hangul", " english"], "There are a handful of consonant phonemes that are common in English but that *don't* exist in Korean; most notably, they include f, v, z, and both voiced and unvoiced \"th\" (as in \"this\" or \"thin\"). Koreans substitute the closest sounds they have in these cases. Most often, these are respectively p, b, j, d, and t for the five sounds above."], [40.0, ["cipher"], "Many clues (and the puzzle title) also contain capital letters in the Latin alphabet, but not ones that look like words or parts of words. They look like they must be some kind of cipher, which is exactly what they are."], [50.0, ["cipher", " hangul"], "Each Roman letter stands for one letter in the hangul alphabet. The substitution is consistent across the puzzle. It is possible to solve the cipher the same way you would solve any other cipher (making guesses using contextual clues and checking across other appearances of the same symbol), but there's also a couple of possible shortcuts."], [55.0, ["cipher", " hangul", " skats"], "One shortcut is to do some good googling. The other is to solve the clue at 74-across. Either way, you can arrive at SKATS, the Standard Korean Alphabet Transliteration System."], [56.0, ["title", " skats"], "The title of the puzzle is SKATS for \"crossword\". That won't necessarily help you solve it, but now you know."], [60.0, ["spacing", " punctuation"], "All spacing and punctuation has been preserved, which means you can tell where word breaks are by looking at spaces between blocks in hangul and in SKATS."], [70.0, ["crossword", " skats"], "Once you know about SKATS, you can translate all of every clue into hangul, and then transliterate it back into English (or play it through text-to-speech and listen). Use this to solve the crossword. Answers are entered just like any normal crossword, and in English."], [80.0, ["crossword", " instructions"], "Many of the crossword clues are of the form \"Part [n] of instructions\". Combine the answers to these clues together to get an important instruction step."], [90.0, ["shading"], "The instruction is SHADE IN EVERY ENTRY WITH A LETTER THAT ALSO IS USED IN ITS CLUE IN SKATS. What do you see when you do that?"], [100.0, ["extraction"], "You ought to be looking at more hangul characters in the grid. They don't spell out a word in Korean, and when you pronounce them (roughly \"go-dome-doh\") they don't sound like an English word either. What else could be happening?"], [100.1, ["extraction"], "Encoding these characters back into SKATS will give you the final answer."]]