[[0.0, ["how to start"], "The puzzle asks you to form a 5x5 word square, with 5 words reading across and 5 other words reading down. Any of the words can read backwards (that is, right to left, or down to up). But there is an additional constraint that the values of the letters (A=1, B=2, etc) must be added, and then taken Mod 26 (the rmainder after dividing by 26), and then those Mod remainders turned back into letters, and the down letters and across letters must also form 5-letter words that together use 10 different letters."], [10.0, ["we know what to do", " but how do we do it?"], "The construction part of this puzzle will likely require either programming, or use of a crossword program, or both."], [20.0, ["we know we need to program", " but then what?"], "One good way to proceed is: create a wordlist (LIST5) of all the 5-letter words, both in their forward and backwards direction (so, the list would include, for example, both BEGIN and NIGEB). Then, create a list (LIST6) of all the words in LIST5 FOLLOWED BY their Mod 26 letter. For example, BEGIN and NEGIB both sum to 37, which in Mod 26 is 11, which equates to the letter K. So, LIST6 should have both BEGINK and NIGEBK in it. Combine LIST5 and LIST6 -- you now have a list of all the entries you might need."], [30.0, ["we've created wordlists", " but then what?"], "Use the wordlists you created (from the previous hint) to fill a 6x6 grid with the bottom right square blacked out. That will automatically give a 5x5 word square with 5-letter words from the row and column sums. You will need to have 10 different letters among the sum-words -- keep re-filling until you get there, or try to look for words that will give you the most possibilities -- such as, if you start with NYMPH as the down sum-word, you will have a lot of good letters left over to fill the across sum-word. You can set your program to avoid 6-letter words ending in N, Y, M, P, H, or just keep going until you get a word with all different letters from those."], [40.0, ["we've done the first part and gotten the clues", " now what?"], "After submitting a valid word square for Part 1, you will be given a set of cryptic clues that form a 5x5 word square. Solve the clues and complete the word square."], [50.0, ["we've solved the cryptic word square", " but then what?"], "Look at the set of bigrams you received with your clues. How might those be used to derive a message?"], [60.0, ["We have looked at the bigrams", " but don't know what to do with them."], "If you try submitting a different word square as the answer to part 1, you will get a different set of bigrams. What might that mean?"], [100.0, ["How to extract the clue phrase"], "The bigrams you received with the cryptic clues represent coordinates. Write the down 5-letter word of your submission down the side of the cryptic square, and the across word across the bottom of the cryptic square. Then, use the bigrams as coordinates to extract letters from the completed cryptic square."], [105.0, ["But that answer is not working!"], "As indicated in the puzzle, make sure you use the name that the person is commonly known as (and that is the title of a Wikipedia page), not the longer name that appeared on the cover of the TV Guide."]]