[[0.0, ["flavortext"], "The initial letters of the flavortext may be helpful."], [1.0, ["investigation", " clues"], "The answer to each clue in \"The investigation\" should be written in the row of the grid next to it."], [1.1, ["investigation", " clues"], "There is a reason the tan spaces are double-wide, and have two question marks in them."], [1.2, ["investigation", " clues"], "Each tan spaces contains either two letters, or nothing at all."], [1.3, ["investigation", " clues"], "When entering a given answer, every tan space that is filled contains the same two-letter sequence."], [1.4, ["investigation", " clues"], "When entering a given answer, each cyan space contains one letter."], [2.0, ["cast", " characters", " clues"], "The answers to the clues in \"The cast of characters\" have something in common."], [2.1, ["cast", " characters", " clues"], "Many answers to clues in \"The cast of characters\" are single letters, but not all of them."], [2.2, ["cast", " characters", " clues"], "Each answer to a clue in \"The cast of characters\" is a character in the ASCII character set."], [3.0, ["cast", " characters", " investigation"], "Each character in the ASCII character set has a code number, which can be represented in various ways."], [3.1, ["cast", " characters", " investigation"], "7-bit binary ASCII codes are specifically relevant here."], [3.2, ["cast", " characters", " investigation"], "Each row entered in \"The investigation\" has a pattern of filled and empty tan spaces that matches the pattern of 1s and 0s for one 7-bit binary ASCII code from \"The cast of characters.\""], [3.3, ["cast", " characters", " investigation"], "The two-letter sequence that goes in the tan spaces of a row from \"The investigation\" goes into the two empty boxes in the corresponding row from \"The cast of characters.\""], [4.0, ["title"], "The title of this puzzle is from a quote that exists in various forms; one of these is relevant."], [4.1, ["title"], "Specifically, the quote that is relevant to the title is Ian Fleming's version (from Goldfinger): \"Once is happenstance. Twice is coincidence. The third time it's enemy action.\""], [4.2, ["cast", " characters", " conclusion"], "Each of the Roman numerals in the \"cast of characters\" chart must have a letter or letters added to match one item in the upper row of the \"conclusion\" chart."], [4.3, ["title", " investigation", " cast", " characters", " conclusion"], "What letters are added to each Roman numeral in the \"cast of characters\" chart is indicated by the corresponding row of the \"investigation\" chart, as per the title."], [4.4, ["title", " investigation", " cast", " characters", " conclusion"], "Specifically, a Roman numeral in the \"cast of characters\" chart has c (for coincidence) or ea (for enemy action) added based on whether the corresponding row of the \"investigation\" chart has two or three tan spaces."], [100.0, ["extraction", " cast", " characters", " conclusion"], "The letter in each yellow box from the \"cast of characters\" chart can be put into the yellow box in the \"conclusion\" chart that matches it by Roman numeral + c/ea."], [100.1, ["extraction", " conclusion"], "The 10 characters in yellow boxes in the \"conclusion\" chart consist of 8 Thai numerals and 2 Hebrew numerals."], [100.2, ["extraction", " conclusion"], "The \"conclusion\" chart will give you three separate pieces of information: The letters in all the yellow boxes read left to right, the letters indicated by Thai numerals in numerical order, and the letters indicated by Hebrew numerals in numerical order."], [100.3, ["extraction", " conclusion"], "The letters in the yellow boxes in the \"conclusion\" chart form a clue (whose sequence of word lengths is 4 4'1 4 2 7)."], [100.4, ["extraction", " conclusion"], "The answer to the final clue indicates how to put the 8-letter sequence and the 2-letter sequence together, in the same way that 8-letter sequences and 2-letter sequences were put together earlier in the puzzle."]]