[[0.0, ["intro", " language"], "As the intro indicates, this puzzle involves a language (the language of the Realm of Unspeakable Chaos) that was invented for a Mystery Hunt puzzle, and has been also been used in others. The intro has a link to all the Mystery Hunt puzzles that have used this language, and to a dictionary and grammar summarizing what is known of this invented language from these puzzles and their solutions; the latter two links in particular will be very helpful for solving."], [0.1, ["intro", " language"], "As the Dictionary states, italicized words are borrowings from ancient Greek; these words can thus be very helpful in figuring out what the text means."], [1.0, ["exam"], "The text presented is an exam, with some preliminary instructions, and eight questions. (The first is an example, showing how answers are to be entered.)"], [1.1, ["exam", " questions"], "Each of the eight parts of the exam has text above the circles with a blank to be filled in, and parenthesized text below the circles. The text above the circles is a fill-in-the-blank exam question."], [1.2, ["exam", " questions", " instructions"], "The parenthesized text below the circles is an instruction saying what to do with the fill-in-the-blank answer you get; the example section suggests what specifically this instruction tells you."], [1.3, ["exam", " questions", " instructions"], "For each of the first seven sets of circles, the instruction below the circles tells you which one of the three circles you should put the answer into; the answer goes into the square boxes in that circle."], [10.0, ["question", " first"], "You are given the answer to this question, which forms part of a compound word in the question; figuring out the meaning of this compound word may help."], [20.0, ["question", " second"], "The answer must be a verb, since otherwise there would be no verb in the unparenthesized part of the question before the semicolon."], [30.0, ["question", " third"], "The answer is an adjective directly modifying the word after it; the \"wudore\" is a hint to what kind of adjective."], [40.0, ["question", " fourth"], "The words \"zefolu\" in the question and \"uzefoly\" in the answer are different forms of the same verb (which appears nowhere else); figuring what it means and what the answer is will involve considering how one enters answers in this exam."], [40.1, ["question", " fourth"], "You can deduce which circle the instruction is telling you to use by considering word length."], [50.0, ["question", " fifth"], "The way the language of the Realm of Unspeakable Chaos forms certain negative sentences is different from the way English does; the answer here is a word (which can be found in the Dictionary) that is involved in this."], [60.0, ["question", " sixth"], "To find the answer, you will need to figure out what kind of item is meant by the long compound word in the second line, find the specific item of that kind that is referred to here, and examine it."], [60.1, ["question", " sixth"], "The specific MIT Mystery Hunt puzzle referred to here is one of the puzzles linked to in this puzzle's intro."], [60.2, ["question", " sixth"], "The answer is the title of a written work mentioned in the intro to the MIT Mystery Hunt puzzle that is being referred to."], [70.0, ["question", " seventh"], "The Grammar explains briefly how the components of compound words are ordered; this may help you in deducing which parts of the long compound word correspond to which meanings."], [80.0, ["question", " eighth"], "Letters from the first seven answers are assembled as indicated by Roman numerals i–xi form the eighth question, and as indicated by 1–49. However, not every number has a corresponding letter."], [80.1, ["question", " eighth"], "The numbers with no corresponding letter correspond to spaces between words; each word replaces one question mark."], [80.2, ["question", " eighth"], "The answer to the eighth question is a single five-letter word in the language of the Realm of Unspeakable Chaos."], [100.0, ["extraction", " instruction", " eighth"], "The eighth instruction consists of three parts; these should be performed in order."], [100.1, ["extraction", " instruction", " eighth"], "Specifically, it is not possible to perform the second part of the instruction until the first part of the instruction has been properly performed."], [100.2, ["extraction", " instruction", " eighth"], "It is also not possible to perform the second part of the eighth instruction if the first part of the preliminary instructions at the start of the quiz has not been followed."], [100.3, ["extraction", " instruction", " eighth"], "Following the second part of the eighth instruction involves writing something inside one of the letters written in the first part of the eighth instruction."], [100.4, ["extraction", " instruction", " eighth"], "Once all three parts of the eighth instruction have been performed, the answer will appear on the page."], [100.5, ["extraction", " instruction", " eighth"], "Specifically, once all three parts of the eighth instruction have been performed, the final answer can be read straight across, taking all the innermost letters."]]