[[5.0, ["Matching files with boards"], "Each pdb file can be matched up with one board; there is no mixing."], [10.1, ["Phrases with question marks"], "This is a biology-heavy puzzle; do you know of anything else in biology that's two words long, with only the first word capitalized, and that's usually italicized?"], [10.2, ["How to find species names"], "You can extract sequence files from the pdb files using ChimeraX if you have it, or alternatively an online tool like https://swift.cmbi.umcn.nl/servers/html/soupir.html. Then, use BLAST (https://blast.ncbi.nlm.nih.gov/Blast.cgi) to find the species. Be sure to look closely at the alignments you get! (Note for hinter: It's reasonably straightforward to do a Nutrimatic search or whatever to find the species but I'm not about to encourage that, and having an alignment can help with other parts of this)"], [30.1, ["Example", " colors"], "Play around with the pdb file in the viewing software some more (in particular looking at different ways to display it) and look at it in a text editor. Also, look up any unfamiliar terms in the flavor text."], [30.2, ["Example", " filling in grids"], "What might traditionally go in grids? Also, do you know of how you might represent a protein's primary structure?"], [30.3, ["Example", " colors", " how to view temperature/B/Debye-Waller factors", " RCSB", " Jena3d", " ChimeraX"], "Color the proteins by temperature factor. To do so: \r\nIn the RCSB viewer: Components > Protein > Set Coloring > Uncertainty/Disorder;\r\nIn Jena3D: Molecular Coloring > by Temperature;\r\nIn ChimeraX: Molecule Display > Coloring segment > b-factor button"], [30.4, ["Example", " letters"], "Each protein structure will have one or two highlighted segments of beta-sheet whose shapes match a piece of \"meat' on the cutting boards. Use the one-letter amino acid code to fill in grid squares; the RCSB viewer will be particularly useful for you here. Note some non-standard amino acids: ASX = B, PYL = O, SEC = U."], [60.1, ["What to do after filling in protein shapes"], "Make sure you've worked out the example, including the words in it. Can you make the other proteins do something similar? Also, do you know what the enumerations for each species refer to?"], [60.2, ["How to fill in trays"], "\"Cut out\" each \"meat slab\" by color, as shown in the example, and find a way to arrange each piece on their respective tray grids to make words. Each word is a synonym of the name of the meat made from each animal; you may have to think a bit laterally for these."], [60.3, ["Specific tray themes"], "In tray order:\r\nOvies aires = lamb (i.e., ingénue, new person);\r\nAnas platyrhynchos  = duck (i.e., bend down, escape);\r\nMeleagris gallopavo = turkey (i.e., dumb or silly person);\r\nGallus gallus = chicken (i.e., scared);\r\nBos taurus = beef (i.e., fight, argument);\r\nBison bison = buffalo (i.e., to bully)"], [100.1, ["Extraction"], "Have you tracked what's on the special squares on the \"serving trays\"?"], [100.2, ["Clue phrase", " species four"], "\"Species four\" refers to both the fourth (non-example) pdb file and board/tray combo. Do you know a baked good that contains that particular meat?"]]