[[0.0, ["start", "image"], "Each image is a mashup of two celebrity faces."], [5.0, ["photos", "identification"], "Photos are probably not amenable to reverse image searching.  This is a great puzzle for crowdsourcing with folks who enjoy celebrity identification puzzles."], [10.0, ["features", " face", " photos"], "The selection of which features come from each of the 2 parties is neither consistent nor clueful.  Photos have been blended at the edges to make them more seamless."], [20.0, ["photos", " identification"], "Have you made use of the enumerations at the bottom of the page? (this should clue them in to 1) There's only 1 enumeration per face, so they won't be using the actors but the character name, and 2) certain possibilities are eliminated because the enumeration isn't there)."], [20.1, ["enumerations"], "Enumerations at the bottom of the page are in order by total length."], [20.5, ["photos", " identification"], "You need the name of the character played by each of the 2 actors, not the actor names or movie or book names."], [25.0, ["photos", " identification", " character", " names"], "Have you noticed the \"1\" enumeration at the bottom of the page? (This should clue them in to a 1-letter name, which is a strong clue for either Q or M from the Bond movies)"], [30.0, ["characters", " names"], "Character names are generally first-last according to how characters are best known in the book.  No titles are used (no Dr., Mrs., etc.)"], [30.1, ["characters", " names"], "Photos are arranged l>r, top>bottom alphabetically by character name."], [30.2, ["characters", " names", " enumerations"], "The only face that can possibly go with M or Q is the one with the 2 \"1\" indices."], [30.3, ["characters", " names"], "All characters originate from books."], [100.1, ["extraction", " order"], "Count the number of faces (the 26 items should clue them in to the fact that one of the two indexes gives a letter A-Z that is used for ordering)."], [100.2, ["extraction", " indexes"], "The 2 numbers below each face indicate 2 separate extraction indexes into the character name."], [100.3, ["extraction", " indexes"], "Have you noticed anything about the set of letters extracted by the lefthand index under the faces? (The prevalence of unusual letters should clue the A-Z ordering)"], [100.4, ["extraction", " indexes"], "The left index extracts an ordering letter A through Z, and the right index extracts the clue phrase letter."], [100.5, ["extraction"], "Read the letters of the second index in alphabetical order of the letters in the first index."], [100.6, ["extraction", "clue phrase"], "The clue phrase is JOEHARDYINDAMNYANKEESMOVIE."]]