[[0.0, ["toys", " images", " note", " post-it", " order"], "The scattered toys should be separated into the 4 different types, and solved sequentially matching the 4 given instructions on the post-it note."], [1.0, ["letters", " blocks", " cubes", " colors", " viewpoint", " opposing", " see"], "The 5 sets of letter blocks comprise 5  different colored blocks each with all 6 faces shown having different letters."], [1.1, ["letters", " blocks", " cubes", " colors", " viewpoint", " opposing", " see", " hairstyles"], "Each set of letter blocks spell one of the pictured hair styles of the 5 girls. However, the letter blocks are shown from the opposite viewpoint of the solver, so each set reads right to left, and using the letters on the opposite faces (which can be deduced using some of the possible words)."], [2.0, ["flash", " cards", " collect", " pictures"], "The 20 picture flash cards each represent a two-word phrase matching the given enumerations, and numbered in alphabetical order. Each of the 5 girls need to collect the 4 unique cards that contain a word clued by her hairstyle. E.g. \"Flower Crown\" clues words that are prefixed by the name of a flower. [Note: Please refer to the full solution for the clues for the other hairstyles if necessary]"], [3.0, ["rings", " stackers", " unused"], "Each card has an unused word that did not reference the hairstyle. For each set of 4 cards for each hairstyle, the 4 unused words can be stacked by sequential lengths similar to the ring stackers."], [3.1, ["rings", " stackers", " unused"], "The stacked unused words are either the left or right word in their two respective two-word phrase. This matches the given left-right positions of the numbers of the ring stacker images, for pairing purposes. The numbers index into the corresponding unused words to extract a set of 4 letters for each hairstyle."], [100.0, ["wooden", " toys", " fix", " broken", " 4", " extraction"], "The remaining 5 wooden toys all have five-letter names. Each set of 4 extracted letters from the unused words in ring stackers matches 4 of the letters in one of the names. Extract the missing letter for each and use the given order associated with each hairstyle in the first image of the girls to get the answer."]]