[[0.0, ["Start", " beginning"], "This is a logic puzzle with a lot of information to keep track of, and is probably best solved with one person operating each car, and maybe a 5th person helping double-check and keep track of everything, but there is a logical way through it all."], [10.0, ["Stuck at instructions 2-3."], "In some cases you will need to read ahead to future instructions in order to determine the correct resolution of an earlier instruction."], [20.0, ["Stuck at instructions 6-7"], "As Main Instruction 8 tells you, it is useful to read ahead to future instructions, especially if you ever feel stuck. And this does not simply mean 1 or 2 instructions -- you were encouraged to read ALL instructions before you started, and sometimes instructions several places ahead might contain information useful to you now (just by reading ahead without actually following the various paths)."], [30.0, ["Still stuck at Instructions 6-7"], "Note that Instruction 10B says that a certain car turns left FOR THE FIRST TIME at Instruction 10. By Instruction 6, there is only one car that has not turned left, so that car cannot turn left at instruction 7, 8, or 9, and must turn left at Instruction 10."], [40.0, ["Still stuck at Instructions 7-9"], "Look ahead to Instructions 11D and 12ABCD. Those instructions, taken together, will tell you something important about the content of the scratchpads earlier in the event, which will be useful in helping navigate the Instruction 7-10 section."], [50.0, ["More detail on Hint 40"], "Instruction 12 means that there must be AT LEAST 3, 3, 3, and 1 letter on the scratchpads by that time, in order to comply with that instruction. But, there are only 10 instructions that tell you to add a letter to a scratchpad, so when the cars reach Instruction 12 there must be EXACTLY 3 3 3 1 letters on the scratchpads at that time. Thus, at no point earlier could a car add a 4th letter to its scratchpad, which helps with the logic. Also, because the car that added a letter during 11D had a different number of letters on its scratchpad that any other car, that car must have been the one with 1 letter on its scratchpad, and thus must have added its FIRST letter to its scratchpad during instruction 11D, which means it did not perform any of the earlier \"add a letter\" instructions."], [60.0, ["Still more detail on Hint 40"], "The Dodge is the car in Hint 40 that does not make a left turn until Instruction 10B, and is also the card that does not add a letter to its scratchpad until Instruction 11D. With those limitations, which can be logically worked out by reading ahead, the various routes during Instructions 6 through 11 should be more straightforward to determine."], [100.0, ["Final extraction"], "The bonus instruction tells you exactly what to do. Reading the roadsign words on the scratchpads at the end, in Car 1-2-3-4 order, gives the answer to the puzzle. If it does not, back up one instruction at a time to find your error. (Or, back up to an earlier spot you felt certain about, and proceed ahead from there.)"]]