[[0.0, ["clues", "boldface", "definition", "accusation"], "The boldface text in each accusation (i.e. each line of dialogue in which \"He\" or \"She\" accuses a guest of a crime against another guest) is a clue to an English word. (A few are somewhat uncommon.)"], [1.0, ["clues", "accusations", "identification"], "Each accusation gives a clue to the identity of the perpetrator of a crime (each of whom is a guest at the dinner)."], [10.0, ["clues", "perpetrators", " guests"], "Each word clued by the boldfaced text is a transaddition  (an anagram plus one letter) of the name of one of the dinner guests, but not the one being accused in the same line of dialogue."], [20.0, ["ordering"], "The accusations form a chain, with the start of the chain indicated in the dialogue."], [20.1, ["ordering"], "Each accusation clues 2 guests: a perpetrator and one other (plus an extra letter). Taking the other guest as the next perpetrator, and repeating, puts the accusations (and the extra letters) into a chain order."], [50.0, ["clues", "perpetrators", "identification"], "The dinner guests can be sorted into five subgroups, represented by the folders that \"She\" mentions, based on something they have in common."], [60.0, ["perpetrators", " identification", " sorting"], "The 5 subgroups are the varieties of great apes: orangutans, gorillas, human beings (specifically, human beings portrayed by Charlton Heston in movies), bonobos, and chimpanzees."], [90.0, [""], "\"He\" and \"She\" are not human beings."], [90.1, [""], "\"He\" and \"She\" are Cornelius and Zira, the chimpanzees from Planet of the Apes (1968)."], [90.2, ["ordering", "sorting"], "The groups of apes (i.e., the folders \"She\" mentions\") are to be ordered by genetic closeness to \"He\" and \"She.\""], [90.3, ["ordering", "sorting"], "The folders are to be ordered by genetic closeness to chimpanzees: orangutans, gorillas, human beings, bonobos, chimpanzees."], [100.0, ["extraction", " ordering"], "When you put the extracted letters in chain order, sort them into the five different groups, and put the groups in the order of their genetic closeness chimpanzees, they spell a clue phrase."]]