[[0.0, ["start"], "What can you identify about these images?"], [2.0, ["date", " stardate"], "As the flavortext said, dates (including stardates and air dates), \"don't matter\" for this puzzle."], [3.0, ["star trek"], "You've seen these before.  Can you identify them?"], [3.1, ["star trek"], "Can you identify the episode of Star Trek that these stills are from?"], [4.0, ["first picture", " question mark"], "What, or who, is the question mark obscuring?"], [4.1, ["first picture", " question mark"], "Does that person have some connection to science fiction besides appearing in Star Trek?"], [5.0, ["seth macfarlane"], "Does that person have some connection to science fiction besides appearing in Star Trek?"], [5.1, ["seth macfarlane"], "He created a show that has the same genre and general format as Star Trek."], [6.0, ["cipher", " letters"], "There's a hint in the flavortext as to the meaning of the strings of letters."], [6.1, ["cipher", " letters"], "Put together two of the words from the second line of the flavortext to find what cipher was used."], [7.0, ["playfair"], "Each string of letters can be decrypted with the Playfair cipher, but you'll need to find the key."], [7.1, ["playfair"], "Each string of letters follows a Star Trek picture, so it's reasonable that the key is connected to that picture."], [7.1, ["playfair"], "The key is the title of the Star Trek episode."], [8.0, ["decrypted", " self-referential"], "The decrypted messages seem to be talking about the Star Trek episode you've already identified.  Could they also be talking about something else?"], [8.1, ["decrypted", " self-referential"], "Has this puzzle hinted at a show besides Star Trek?"], [9.0, ["orville"], "Are there connections between Star Trek and The Orville?"], [9.1, ["orville"], "Are there connections between episodes of Star Trek and episodes of The Orville?"], [9.2, ["orville"], "Are there connections between these episodes of Star Trek and episodes of The Orville?"], [9.3, ["orville"], "Are there connections between these episodes of Star Trek (and their decrypted messages) and episodes of The Orville?"], [9.4, ["orville"], "Can you find an episode of The Orville that the decrypted description also applies to?"], [100.0, ["extraction"], "The flavortext asks for an \"absolute position\"."], [100.1, ["extraction"], "What are spring and summer examples of?  Whatever that is, it doesn't matter."], [100.2, ["extraction"], "Can you find the absolute position of the episode within the series, ignoring seasons?"], [100.3, ["extraction"], "How many episodes have there been in total?"], [100.4, ["extraction"], "There are 26 episodes, which lets you map episodes directly to letters."]]