[[0.0, ["flavortext"], "The flavortext hints at a couple of common methods of encoding information."], [0.1, ["flavortext"], "Specifically, the reference to flags in the flavortext points at semaphore or naval signal flags."], [0.2, ["flavortext"], "In fact, it is naval signal flags that are important. (As the note says, the ones in Wikipedia should be used.)"], [1.0, ["poem", " boldface"], "The first and last stanzas (which are boldface) form a group, which is to be treated separately from the others."], [1.1, ["poem", " boldface", " underline"], "In the boldface stanzas, each underlined phrase clues some pictoral figure."], [1.2, ["poem", " boldface", " underline"], "Specifically, each clues a naval signal flag."], [2.0, ["poem", " nonboldface", " underline"], "In the nonboldface stanzas of the poem, each underlined phrase clues a single word."], [2.1, ["poem", " nonboldface", " underline"], "Specifically, each clues a NATO radio code letter."], [2.2, ["poem", " nonboldface", " underline"], "It is the flag corresponding to each NATO code letter, as a pictoral image, that is important."], [2.3, ["poem", " nonboldface", " underline"], "Specifically, the pictoral images of the flags clued by the NATO code letters, supply information needed for correctly understanding the sequence of events described in the nonboldface stanzas of the poem."], [3.0, ["poem", " nonboldface", " logic"], "The nonboldface stanzas form a description of the movements of a number of vikings (comprising two groups, the Hrosssons and the Knutsons)."], [3.1, ["poem", " nonboldface", " logic"], "You must determine the positions, and directions faced, for all of the Vikings, at the start and also at the end of the story."], [3.2, ["poem", " nonboldface", " logic"], "The field is a 4x4 blue-and-white checkerboard, with no more than one Viking standing on any square at any time."], [3.3, ["poem", " nonboldface", " logic"], "There are only two empty squares at the start, so there are 14 Vikings at the start."], [3.4, ["poem", " nonboldface", " logic"], "Once 4 Hrosssons leave, there are equal numbers of Hrosssons and Knutsons (that's the color ratio in the \"weight\" = kilo, \"northerner\" = yankee, and \"kit\" = uniform flags) so there were originally 9 Hrosssons and 5 Knutsons."], [3.5, ["poem", " nonboldface", " logic"], "At the start, three Knutsons vertically arranged (like the bands of \"Capulet\" = Juliett) facing east (where the blue of \"Bantu\" = Zulu is) are facing two empty squares and a north-facing Hrossson who is facing another Hrossson; that gives almost two complete columns of the grid."], [3.6, ["poem", " nonboldface", " logic"], "The four Hrosssons who leave early on are all the Hrosssons that are facing in a horizontal direction (like the lines of Charlie and unlike the lines of Golf and Tango)."], [3.7, ["poem", " nonboldface", " logic"], "The length of each of the two runs that are made possible by Hrossfot being airborne (leaving his square temporarily unoccupied) is exactly 4 (the number of squares marked off by the cross in \"light from tubes\" = X-ray)."], [100.0, ["extraction"], "The message from the boldface stanzas (VIEW SHIELDS FROM ABOVE) refers to the single shields held by the Hrosssons and the shield pairs held by the Knutsons."], [100.1, ["extraction"], "As shown in the shield pictures above the poem, each Hrossson has a shield on the edge of his square, on the side he is facing, and each Knutson has two shields, forming a V whose tips are at the two corners he is facing away from, and whose angle is at the middle of the side he is facing."], [100.2, ["extraction"], "Put the view of the shields from above at the start, and at the end, in their respective squares, and read in two rows straight across the pair of squares."]]