[[5.0, ["palindrome", " team names", " Hunt history", " years", " symbols"], "The name badges are presented in order by length of Palindrome team name."], [10.0, ["palindrome", " team names", " Hunt history", " years", " symbols"], "What goes in the blank space on each name badge? The badge art and small symbols will be a big help here, as well as the years on each badge. Also keep in mind which team is running this year's Hunt, and what they may be known for."], [20.0, ["palindrome", " team names", " Hunt history"], "Palindrome is known for having distinctive name badges for Hunt depicting a new palindromic team name every year."], [25.0, ["palindrome", " team names", " Hunt history", " years"], "The years on the name badges will help you determine the palindromic team names."], [30.0, ["palindrome", " team names", " Hunt history", " years", " symbols"], "Arranging the name badges in order by the year on each badge will put the badges in alphabetical order by palindromic team name."], [40.0, ["symbols", " enumeration", " team names", " extraction"], "The small symbols along the top of each badge represent the enumeration of the team names depicted in the badge art. (Each symbol corresponds to a letter in the name.)"], [50.0, ["symbols", " enumeration", " team names", " extraction"], "Once you have the team names, the small symbols along the top of each badge will also be used in extracting an answer."], [60.0, ["lanyard", " string", " ordering"], "The unique placement of each lanyard will be helpful."], [70.0, ["lanyard", " string", " ordering"], "The number of times each lanyard crosses over itself is the order to put the name badges in to extract an answer."], [80.0, ["missing piece", " hole", " punch", " extraction"], "Each name badge is missing a piece or two. But where?"], [90.0, ["missing piece", " hole", " punch", " extraction"], "Look at where the holes are punched out on each name badge. That will help with the answer extraction."], [100.0, ["team names", " symbols", " extraction", " lanyard", " string", " ordering", " hole", " punch", " extraction", " answer"], "Each small symbol along the top of the badge corresponds to a letter in that badge's palindromic team name. Once the badges are in order by how many times their lanyards cross over themselves, take only the symbols that are touching a punched out hole to extract answer letters."]]