[[0.0, ["initial observations", " how to start"], "Here are several observations you should make about this puzzle at the start.\r\n1) The puzzle title is \"I'll Tumble 4 Ya\".\r\n2) There are 4 green START spaces around the outer parts of the grid.\r\n3) There are 4 red spaces near the center of the grid.  These spaces contain the letters of the word LOVE.  Those letters use a font different from any of the other letters in the grid.\r\n4) LOVE is also the last word in the list beside the grid.\r\n5) The font used for the 16 4-letter words matches the font of the letters in the red spaces.\r\n6) There is a box or bordered area at the top, labeled START.  Two of the 16 4-letter words -- FOUR and DICE -- are in this box.  Specifically, the text in the START box reads \"TOP: FOUR  /  NORTH: DICE\"\r\n7) The other 14 4-letter words are listed in a column under the header \"Tumbles, in order\".\r\n\r\nIf you failed to note any of these things, or failed to include them in any theories you formulated, you should rethink things."], [0.2, ["four dice", " swag"], "[ Does this puzzle use the 4 d20 that we received as swag? ]\r\nNo, every swag puzzle has a special indicator on its webpage of its status as a swag puzzle.  This puzzle has no such indicator, so the 4 d20 are completely irrelevant."], [1.0, ["four dice", " letters", " label", " castawords", " pips"], "The four dice used in this puzzle are not standard casino dice with pips.\r\nWhat might be on the faces of the dice instead?\r\nYou have four dice and a list of 4-letter words, so..."], [1.1, ["four dice", " letters", " label", " castawords"], "24 letters of the alphabet must be assigned to the 4 cubes or dice such that every listed 4-letter word can be formed by having one letter on each of the four dice. There are several valid logical paths to assign the letters to the cubes.\r\n\r\n[Note to hinters: One such logical path is detailed on the solution page.\r\nThe end result will be dice labeled with the following sets of letters: ABCJOY / DHMRSV / EKNPUW / FGILTZ    Hinters are welcome to confirm that distribution of letters if teams ask for confirmation, but should not give that info unsolicited.]"], [2.0, ["mechanics", " how this puzzle works"], "The following puzzle mechanics can be inferred:\r\nThe puzzle involves four dice.\r\nThe START squares are the starting locations of the dice, one per square.\r\nEach die has 6 letters on its faces (X and Q are not used), one per face.\r\nIn their starting positions and orientations, the top faces of the dice show the letters F, O, U, and R.  The north faces of the dice show the letters D, I, C, and E.\r\nThe dice will tumble one square at a time from the START squares to the red squares.\r\nThe four letters shown on the top faces of the dice after each step will correspond to the 14 4-letter words listed under \"Tumbles, in order\".\r\nAfter the dice tumble into the red squares, the letters on the top faces will be L (on the NW red square), O (on the NE red square), V (on the SW red square), and E (on the SE red square)."], [3.0, ["label", " faces", " dice", " tumble sequence"], "One step that will be very helpful for multiple parts of this puzzle (e.g. determining the START square for each die, determining each die's tumble path) is mapping the sequence of top faces shown by going through the word list in sequence for each die.  If you have skipped this step, create those sequences.\r\n\r\n[Note to hinters: The completed tumble sequences will be as follows -- \r\nF - Z - I - G - T - L - F - I - T - L \r\nO - A - Y - J - O - A - B - Y - A - C - O\r\nU - E - N - U - W - P - K - E - N - U - E\r\nR - M - V - S - H - D - R - M - S - V - H - R - V ]"], [3.1, ["label", " faces", " dice", " adjacency", " adjacent", " opposite"], "Just knowing the set of six letters on a die is not enough.  You will need to deduce exactly how each die is labeled -- which letters are adjacent and which are on opposite faces.  The tumble sequences are helpful in determining some of that.  If one letter tumbles directly to another, they must be on adjacent faces.  Furthermore, if one letter is adjacent to 4 other letters, it must be opposite the remaining letter.\r\n\r\n[ Note to hinters -- If a team is truly stuck on this step, you may include the following information, or teams may note some of the following in their hint request and ask you to verify it:  It can be determined that on the FGILTZ die I is opposite L; on the ABCJOY die, A is opposite J; on the DHMRSV die R is opposite S, V is opposite D, and H is opposite M. ]"], [4.0, ["START square", " dice placement"], "For the task of deducing which START square each die begins on, the concept of Manhattan distance is useful.\r\n\r\n[ Note to hinters: see this puzzle's solution page if a team needs a stronger, more detailed nudge on this. ]"], [5.0, ["tumble paths", " maze"], "If you are having trouble working out the tumble paths, you may want to look at the following:\r\n\r\n   The paper at https://www.logicmazes.com/rc/long-rolling.pdf, whose authors include the Demaines of MIT’s CSAIL, includes a result that is very useful in understanding and analyzing this puzzle.  In section 2.4 on p. 7 and the accompanying Figure 9 on p. 8, we see the concept of U-turns and Z-turns illustrated.  Can you apply those concepts to the information you have about how the dice tumble?"], [5.1, ["tumble paths", " maze", " more detail"], "[ Note to hinters: If a team needs more detailed help with a specific die's tumble path, see this puzzle's solution page. ]"], [100.0, ["extraction", " grid letters"], "You've discovered the path that every die travels to get from its START square to its red goal square, but you haven't yet used the grid letters.  Now is the time to do so."], [100.1, ["extraction", " grid letters", " ordering"], "Step 1: Form the first word MAZE by tumbling the labeled dice from their START squares onto their four new squares.  There are two natural orderings for reading the grid letters: (1) Row major -- L-to-R, top to bottom; (2) in order of the letters in the word MAZE.  One is right, one is wrong."], [100.2, ["extraction", " grid letters", " append new letters", " HERROELEINDIENIHARDTWTROTWASSAWASWMAANTHANTCOLETMANO"], "[ Note to hinters -- Some teams may send you an extracted string such as HERROELEINDIENIHARDTWTROTWASSAWASWMAANTHANTCOLETMANO\r\nTeams that are stuck on this final step will benefit from the following nudge: ]\r\n\r\nWhen forming the \"tumbles\" words, did every die tumble every time, or did some stay in place?"]]