[[1.0, ["Pokemon", " Lental", " Professor Mirror", " Rita", " Snap"], "In what video game would one take \"Lentalgram\" photos?"], [5.0, ["Pokemon", " Lental", " Professor Mirror", " Rita", " Snap"], "The photos are all from the game New Pokémon Snap which takes place in the Lental region. The Lentalgram comments are from the main in-game characters: Professor Mirror (rosseforP) and his assistant Rita (X💖x🅡🅘🅣🅐x💖x)."], [10.0, ["clues", " blanks", " phrases", " rearrange"], "The answers to the clues at the start of the puzzle will be needed to fill in the letter blanks in the next part."], [15.0, ["clues", " blanks", " phrases", " rearrange"], "Rearrange the words with letter blanks to form phrases."], [20.0, ["clues", " blanks", " phrases", " rearrange"], "Use the answers to the clues at the start of the puzzle to fill in the letter blanks to complete phrases in the next part."], [30.0, ["Pokemon", " alphabetical", " names", " identification", " Pokedex"], "The order of the screenshots will aid in identifying the Pokémon featured in each one."], [35.0, ["Pokemon", " alphabetical", " names", " identification", " Pokedex"], "The screenshots are in alphabetical order by the name of the Pokémon featured in each one."], [40.0, ["Requests"], "The phrases formed after filling in the blanks correspond with the enumerations shown in the upper right of the Lentalgram photos."], [50.0, ["reorder", " rearrange", " chronological"], "Reorder the screenshots in another order to get a hint as to what to look for next."], [55.0, ["reorder", " rearrange", " chronological", " requests"], "Reordering the screenshots in chronological order will help you get a hint as to what to look for next."], [60.0, ["reorder", " rearrange", " chronological", " requests"], "Rearrange the screenshots in chronological order 1-12 and use their corresponding dates as letters to get a hint as to what to look for next."], [65.0, ["reorder", " rearrange", " chronological", " Lentalk Requests", " missions"], "Rearranging the screenshots in chronological order 1-12 and using their corresponding dates as letters (1-26) spells out REQUEST NAMES. What does that refer to?"], [70.0, ["Lentalk Requests", " missions"], "The phrases you filled in the blanks for will be useful in conjunction with the two-word hint derived from putting the screenshots in chronological order."], [75.0, ["Lentalk Requests", " missions"], "A feature of New Pokémon Snap is \"Lentalk Requests\": special missions that can only be successfully completed by taking photos of particular Pokémon under certain conditions."], [80.0, ["phrases", " Lentalk Requests", " missions"], "The phrases corresponding with each Lentalgram photo are the titles of actual Lentalk Requests reworded."], [85.0, ["Lentalk Requests", " ratings", " Likes", " stars", " heart-eye emoji", " ★", " 😍", " extraction", " index", " answer"], "Notice that each photo has a number of ratings in three forms: Likes, ★s from Professor Mirror, and 😍s from Rita."], [90.0, ["Lentalk Requests", " ratings", " Likes", " stars", " heart-eye emoji", " ★", " 😍", " extraction", " index", " answer"], "The number of ratings (Likes, ★s, and 😍s) taken in the order they are presented in index into the Lentalk Request caption for each photo to extract 3 letters."], [100.0, ["reorder", " chronological", " Lentalk Requests", " missions", " ratings", " Likes", " ★", " 😍", " extraction", " index"], "The photos are all from the game New Pokémon Snap which takes place in the Lental region. The Lentlgram screenshots are in alphabetical order by the name of the Pokémon featured in each one. Solving the clues and using their letters to fill in letter blanks will let you rearrange those words into phrases matching the enumeration shown at the top right of each photo. Rearranging the screenshots in chronological order 1-12 and using their corresponding dates as letters (1-26) spells out REQUEST NAMES. This refers to a feature of New Pokémon Snap called \"Lentalk Requests\": special missions that can only be successfully completed by taking photos of particular Pokémon under certain conditions. The phrases you found are the titles of actual Lentalk Requests reworded. Using the actual Lentalk Request titles in conjunction with the number of ratings (Likes, ★s, and 😍s) on each photo as an index will extract 3 letters from each screenshot, spelling out the puzzle answer."]]