[[0.0, ["Part 1 -- books"], "All the phrases clue famous books with a single letter changed."], [10.0, ["Can't get all the books"], "There are 26 books -- the changed letters run from A to Z (in some order)."], [20.0, ["Part 2 -- What do I do with the pages?"], "There are 2 pages that have an obvious first part and second part. Those seem to be the beginning and end of the story. The beginning of the story hints at what to do."], [30.0, ["Need more help to break into the pages"], "The first page references PRINT and DEVIL and filling in missing things. This is a Printer's Devilry puzzle, where the text has an awkward section due to it's missing a word and you need to add it back in a way that makes sense. In all cases, the word that is added back will be added to the front, back, or middle of an existing word, and spacing may need to be adjusted, in order to create new words -- the word added will never remain in its original form, but rather will become part of a new word or words, though the letters will alward remain consecutive and in the same order. (If you have never seen a Printer's Devilry puzzle before, look online for examples.)"], [40.0, ["Printer's Devilry is hard"], "The words to be added to the pages in Printer's Devilry fashion have something in common. Once you find the commonality, that will reduce the possibilities and make solving easier."], [50.0, ["What do the Printer's Devilry words have in common?"], "The words to be added in Printer's devilry fashion are single-word answers to puzzles appearing earlier in the Hunt."], [60.0, ["After finding Prinetr's Devilry words -- part 1"], "The pages need to be put in the proper order. The obvious first page is first, and the obvious last page is last, but how might the rest be ordered?"], [70.0, ["After finding Printer's Devilry words -- part 2"], "The pages must be put in the order of the A to Z letter changes from the book titles portion of the puzzle -- each book had a letter change and an associated page."], [80.0, ["How do I get a message from the Printer's Devilry words?"], "Each page, and therefor each Printer's devilry word -- has a number associated with it, which you need to find. Use that number to index into the Printer's Devilry word on that page to get a letter."], [90.0, ["Still stuck on how to find the indexing number"], "The last paragraph of the last page has a hint to finding the indexing number of each page."], [100.0, ["extraction"], "The border of each page consists of branches that have a leaf at the top, and then 2 leaves on one side and 1 leaf on the other. In most cases, the single leaf is on the outside of the border. But in some cases -- 1 through 6 times per page -- the single leaf is on the inside of the border. Count the number of branches that have the single leaf on the inside of the border, and use that number to index into the Printer's Devilry word for that page."]]