[[1.0, ["start"], "Use the actual traits of each plant to find that plant in the idiosyncratic trinary search tree. [HINTER'S NOTE: plants are provided by scientific name. Puzzlers can use ordinary resources like Wikipedia to look up real-world properties of these plants. These properties (along with the writer's own preferences) have been used to classify the plants in a highly quirky taxonomy. The puzzle's trinary search implements this quirky taxonomy. Identifying each plant within the search tree will reveal a graphic element made of circles connected by lines. Each one is a kind of graph, mathematically. More specifically a tree, though we will use \"graph\" in hinter's notes to avoid confusion with the trinary search tree. The graphs must be substituted into the equations in order to do arithmetic on the graphs.]"], [2.1, ["start", " math", " basics"], "This puzzle requires doing math on things that aren't numbers. [HINTER'S NOTE: the arithmetic needs to be performed on the \"graphs\" revealed by finding each plant in the taxonomy, as discussed in hint 1.0. Puzzlers will need to substitute the graphs into the equations in place of the corresponding plants. The rules of this arithmetic were invented for this puzzle and no prior knowledge of graph theory or rooted tree algebras should be required, nor is there any need to do research in math journals. The example equations are there to teach puzzlers how the arithmetic works. The full rules of the arithmetic are explained in the solution.]"], [3.1, ["start", " math", " basics", " plants"], "You'll need to replace each plant name with something else. [HINTER'S NOTE: the equations have plant names, but the math is actually done on graphs (the circle-and-line images) as discussed in 1.0. Once puzzlers find each plant in the taxonomy, as discussed in hint 1.0, they should plug the corresponding graph back into the equation in place of the plant's scientific name.]"], [3.2, ["math", " plants"], "Each plant name in the seach tree has something else associated with it.  Try using it."], [3.9, ["math", " plants"], "Replace each plant name in the 'math problems' with the node-and-line graph associated with it according to the puzzle's trinary search taxonomy."], [30.1, ["math", " general"], "According to the puzzle, what do trees not do? [HINTER'S NOTE: the example equations try to help with this, and the puzzle has various flavor text about it, but puzzlers may still go astray here. The rules of arithmetic used in this puzzle only allow \"straight paths\" when combining or removing graphs. The rules never allow branching or forking. Puzzlers who are already familiar with at least one rooted tree algebra or arithmetic, or who research such things on the internet, may end up going astray because most of that prior art does use branching.]"], [30.2, ["math", " general"], "Trees and graphs never branch."], [30.3, ["math", " general"], "Solutions are built from left to right within bracketed sections. Operators are not commutative. [HINTER'S NOTE: the strangely-worded flavor text sentence about not being \"commutative\" is intended to hint at the latter point. Brackets work just like in regular math.]"], [40.1, ["math", " addition"], "The number of lines in the left graph plus the number of lines in the right graph will equal the number of lines in the resulting graph.  In contrast, node count is not conserved. [HINTER'S NOTE: puzzlers who are having trouble with this may be trying to add by branching. Branching also conserves line count, though, so consider asking the puzzler for how they think addition works. See the 30-series hints for more information on branching.]"], [40.2, ["math", " addition"], "The right hand graph is added to the left hand graph. [HINTER'S NOTE: everything starts from the left side of the equation (or bracketed section of the equation) and moves to the right. Consider giving hint 30.3 if the puzzlers seem more fundamentally stuck on how to read the equations.]"], [40.9, ["math", " addition"], "To add, overlap the top node of the left graph with the bottom node of the right graph. [HINTER'S NOTE: this is the explicit rule for addition.]"], [50.1, ["math", " subtraction"], "Subtraction undoes addition. [HINTER'S NOTE: most math-savvy puzzlers will guess that this should be true, but if they have already figured out addition then this may be all the hint that is needed.]"], [50.9, ["math", " subtraction"], "To subtract, remove the right graph from the top of the left graph, leaving an empty node at the top of the resulting graph where the right hand graph's dark node used to be. [HINTER'S NOTE: this is the explicit rule for subtraction.]"], [60.1, ["math", " multiplication"], "The number of nodes in the left graph multiplied by the number of nodes in the right graph equals the number of nodes in the resulting graph. In contrast, line product is not conserved. [HINTER'S NOTE: multiplication can also be thought of as an extension of addition, just like in regular math. If the puzzlers have figured out addition then you might consider hinting this instead, especially if they are still trying to use branching rules.]"], [60.9, ["math", " multiplication"], "To multiply, each instance of a node on the left graph becomes the entirety of the right graph.  The lines of the left graph remain in as the connections between the inserted graphs. [HINTER'S NOTE: this is the explicit rule for multiplication.]"], [70.1, ["math", " division"], "As multiplication, but in reverse. [HINTER'S NOTE: if the puzzler has not figured out multiplication already then division will be very hard. Consider confirming that the puzzler is doing multiplication right. If not, consider adding in a hint from the 60 series.]"], [70.2, ["math", " division"], "In this puzzle, division always results in whole graphs.  There are no 'remainders' or fractions. [HINTER'S NOTE: most mistakes that puzzlers may make in working out the rules of division will result in remainders, so this may well be enough to get them moving with some thought and consideration while still preserving an a-ha.]"], [70.3, ["math", " division"], "The number of nodes in the left graph divided by the number of nodes in the right graph equals the number of nodes in the resulting graph.  In contrast, line quotient is not conserved. [HINTER'S NOTE: this is implied by division being the inverse of multiplication, so consider combining it with 70.1 and/or 70.2. This will probably be most useful by itself if puzzlers are sort of getting division right but not quite.]"], [70.9, ["math", " division"], "To divide, each instance of the right graph within the left graph is replaced by a single node. [HINTER'S NOTE: this is the explicit rule for division.]"], [80.1, ["math", " double dagger"], "The double dagger is a line by line operation. [HINTER'S NOTE: as opposed to a mirror operation of the whole graph about the filled-in base circle, for example.]"], [80.9, ["math", " double dagger"], "The double dagger is a line by line operation: left tilting lines become right tilting, right tilting become left tilting, and vertical lines remain the same. [HINTER'S NOTE: this is the explicit rule for the double dagger.]"], [100.1, ["extraction"], "The resulting graphs all have some features in common.  Can you relate those features back to the non-math part of the puzzle? [HINTER'S NOTE: they all have 5 lines or 5 indicated directions. This is the same number of choices required to find a plant in the trinary search tree.]"], [100.2, ["extraction"], "What if the resulting graphs were interpreted as instructions instead?"], [100.3, ["extraction"], "Each resulting graph is a path through the trinary seach tree questions to a specific plant."], [100.4, ["extraction"], "Use the number in parentheses to index into the plant name."], [100.9, ["extraction"], "The resulting graphs are used as paths in the trinary search tree. Each locates a scientific name of a plant.  Index into each plant name by the corresponding number in parentheses. The answer is read off in order of the problems."]]