[[0.0, ["puzzle type", " swag"], "This is a swag puzzle.  If the solver does not have the physical activity book, the PDF is available.  There is one page, the Coloring Page, that is only available as PDF.  Both the physical activity book (or PDF) and the Coloring Page PDF are needed to solve the puzzle"], [0.1, ["sub-puzzle types"], "Each type of activity/ sub-puzzle is named, and can be googled for how it works."], [0.2, ["sub-puzzles"], "Have you actually completed each puzzle or did you stop when you recognized the image?"], [0.3, ["sub-puzzle order"], "the sub-puzzles images are in alphabetical order"], [1.0, ["hands", " fingers"], "Each character in each sub-puzzle is holding up a certain number of fingers"], [1.1, ["spiroglyph image"], "The image is of Barney the Dinosaur, he is purple"], [1.11, ["Barney finger count"], "Barney is holding up 1 finger"], [1.2, ["maze image"], "The image is of Big Bird, he is yellow"], [1.21, ["big bird finger count"], "Big bird is holding up 3 fingers"], [1.3, ["jigsaw puzzle image"], "The image is of Clifford the Big Red Dog"], [1.31, ["Clifford finger count"], "Clifford is holding up 4 fingers (toe beans)"], [1.4, ["rota-draw image"], "The image is of Cookie Monster, he is indigo"], [1.41, ["Cookie monster finger count"], "Cookie Monster is holding up 3 fingers"], [1.5, ["Connect the Dots image"], "The image is of Gossamer from Looney Tunes (hence the song references) and it is Orange."], [1.51, ["gossamer finger count"], "Gossamer is holding up 2 fingers"], [1.6, ["Color by Number image"], "The image is of Mavis from Hotel Transylvania, she is dressed in black, the bat clues that she is a vampire"], [1.61, ["Mavis finger count"], "Mavis is holding up 8 fingers on 2 hands"], [1.7, ["Fill-a-pix image"], "The image is of Oscar the Grouch, he is green"], [1.71, ["Oscar finger count"], "Oscar is holding up 1 finger"], [1.8, ["Curved Nonogram image"], "The image is of Sully from Monsters, Inc. He is blue."], [1.81, ["Sulley finger count"], "Sulley is holding up 1 finger"], [10.0, ["coloring page order"], "the characters on the coloring book page are shown in ROYGBIV+Black order"], [11.0, ["coloring page poses"], "They are Max-imally inspired by Maurice Sendak.  [further hint: Where the Wild Things Are PDF is available on the web for free]"], [21.0, ["Coloring page ID"], "Column 1 from top to bottom: ELMO (red), RUDY (orange), MINION (yellow), WALLY the Green Monster (green, obv)  Column 2: NIDORINA (blue), SONIC (indigo), GRIMACE (purple), TOOTHLESS, (black)"], [50.0, ["pairing images"], "Each monster in the sub-puzzles can be color matched to a monster on the coloring page"], [51.0, ["paired monsters"], "Clifford & Elmo (red), Gossamer & Rudy (orange), Big Bird & Minion (yellow), Oscar & Wally (green) Sully & Nidorina (blue), Cookie Monster & Sonic (indigo), Barney & Grimace (purple), Mavis & Toothless (black)"], [60.0, ["indexing"], "the number of fingers held up by the monster in the sub-puzzle indexes into the name of the monster on the coloring  page"], [75.0, ["ordering"], "Each pose on the coloring page can be put in order by matching the pose to the pages in the book Where the Wild Things Are"]]