[[0.0, ["start", "flavor", "format"], "[If they haven’t mentioned computer programming]\r\nWhy do the text blocks in this puzzle look the way they do?"], [0.1, ["start", "flavor", "songs", "lyrics"], "[If they haven’t mentioned song lyrics]\r\nDo some of the phrases in the text blocks sound familiar?"], [0.2, ["start", "flavor", "blanks", "songs", "titles"], "[If they haven’t figured out that song titles go in the blanks]\r\nWhat could go in the blanks? The parentheticals should help you."], [1.0, ["songs", "artists"], "Each text block contains songs from a single artist."], [1.1, ["songs", "artists", "titles"], "The blanks should be filled in using song titles."], [1.2, ["start", "songs", "titles", "initials", "letters"], "[If they haven’t matched the initials to the blanks]\r\nEach text block has the same number of blanks as lines of letters afterwards."], [1.3, ["songs", "artists", "titles", "initials", "letters"], "The initials of the song titles appear below each text block."], [2.0, ["programming", "language", "format"], "The text blocks are formatted like computer programs."], [2.1, ["programming", "language", "format"], "The text blocks don’t just *look* like code — they *are* code!"], [2.3, ["programming", "language"], "Rockstar developers write in Rockstar, of course! (https://codewithrockstar.com)"], [100.0, ["extraction", "last", "program", "input"], "The last program has no blanks, but it doesn’t seem to do anything. What is it waiting for?"], [100.1, ["extraction", "ordering"], "[Only if they haven’t made the Rock & Roll Hall of Fame connection]\r\n\r\nWhat kind of “induction” happens in Cleveland?"], [100.2, ["extraction", "ordering"], "The final program contains a hint to the ordering used in extraction."], [100.3, ["extraction", "ordering"], "Each program’s associated artist was inducted into the Rock & Roll Hall of Fame in a different class/year."], [100.4, ["extraction", "ordering"], "Sort the outputs of the programs chronologically by Rock & Roll Hall of Fame induction class/year, then give that list as input when runing the last program."], [100.5, ["extraction", "columns"], "[If they can’t see what to do with the text emitted by the last program]\r\n\r\nYou’ll need to read down the columns of the last program’s output."]]