[[5.0, ["Faces", " identify", " Infinity Train"], "Don't waste time trying to identify every face in the image on the puzzle page.  Most of them don't even have names."], [6.0, ["Faces", " image", " numbers", " green", " main page"], "If you just can't figure out where the image on the main page is from, ask a friend who's a fan of critically-acclaimed animated shows of the 21st century"], [10.0, ["Playplace"], "Phrases of the given enumerations can (almost) be found by stringing the letters from adjacent balls"], [10.1, ["Playplace"], "The phrases start with letters A-I"], [10.2, ["Playplace"], "A thematic word has been replaced with a single letter 9 times"], [10.3, ["Playplace"], "After you find all the phrases, read the letters that were replaced. You'll need to do the replacement one more time."], [20.0, ["Sunblock"], "Reverse-image google searches can help you identify the pictures on the bottles"], [20.1, ["Sunblock"], "The flavor text will help you determine what the sunblock's SPF should block out."], [20.2, ["Sunblock"], "\"Block\" the first SPF% of each word.  So, if SAMPLE had SPF 50, you'd end up with PLE."], [20.3, ["Sunblock"], "After you've applied the sunblock, the resulting strings of letters can be combined to form some places you might need sunblock-- with one letter missing from each."], [30.0, ["Mouse Taken", " pictures", " images"], "Once you've identified the images, have you tried googling a whole bunch of them together to see if they're a reference to something?"], [30.1, ["Mouse Taken", " pictures", " images"], "The title \"Mouse Taken\" may seem weird -- that's because it happens to be an anagram for something."], [30.2, ["Mouse Taken", " neko", " atsume"], "The flavor text mentions predators blending into the colors of their environment. Some of the cats' colorations fit better than others with respect to their positions in the grid."], [30.3, ["Mouse Taken", " extract", " numbers", " match", " color"], "Your fully filled in grid should have two matches per row. Is there anything else you have two of per row in the puzzle?"], [30.9, ["Mouse Taken", " letter"], "If you've fully filled in the grid and marked the cats that match, the letter should become visible."], [40.0, ["To-Do", " start"], "Each of the icons in the other tabs corresponds to a website that's described by an item in the list below. Whoever made the list wants to find another website that fits the description."], [40.1, ["To Do", " websites", " found", " identified", " extraction"], "What would the browser window looked like if each of the current websites were replaced with its counterpart?"], [40.9, ["To Do", " letter"], "Whoever made the list wants to replace Chrome as a browser. What's a popular rival that fits the description that's closely associated with a letter of the alphabet?"], [59.0, ["Castle Crisis", " Corgi"], "Corgi tracks are easy to find, because they spell out CORGI.  Make sure you get them all!"], [59.1, ["Castle Crisis", " Corgi"], "Did you get ALL the Corgi tracks?  What's left?\r\n(Check the truck for help with the enumeration)"], [60.0, ["Cracked", " Crystal", " Can't get started"], "The lines connect words that are frequently seen together, and the direction of the arrows is important. The numbers in the boxes are word lengths. To break into the puzzle, try to find a blank on the page with a number of already filled in words connected to it."], [60.1, ["get started", " cracked", " crystal", " follow up hint"], "(for teams still having trouble breaking in, a follow-up hint might be: Toward the bottom, center of the crystal, there is a space for a 5 letter word that could come before \"soup\" or \"age\" and after \"rolling.\""], [60.2, ["cracked", " crystal", " filled in most of crystal", " extra boxes around crystal"], "The extra boxes around the crystal with arrows leading to numbered blanks need to be filled in with a letter to each blank. Which l letter? You have an arrow leading back to a word and a number that's less than the length of that word..."], [60.3, ["cracked", " crystal", " filled in all the words", " final answer"], "In filling  in most of the puzzle, you had to find words that formed phrases or compound words based on words that come before and come after a particular word they had in common. You can use the same principle with the words you extract from the puzzle into the numbered boxes. You should get one word from the words at the top and one from the words at the bottom. Together, they'll form another compound word."], [60.4, ["cracked", " crystal", " solved crystal", " extract single letter", " 10 text paragraphs"], "You probably noticed that each numbered section refers to one of the compounds words or phrases you found earlier. But which of the two parts of the word is the one you want? Words and phrases follow a linear order...so something always precedes or follows something else. Is there something in each of the numbered paragraphs that could tell which of those you are looking for?\r\n[the answer is that each has a word such as \"after\" or \"first\" to clue which 1/2 of the phrase to focus on]"], [60.5, ["cracked", " crystal", " final letter", " numbered text blocks", " figured out words"], "What to do with the words you found? You need to repair the crystal & those words are where the cracks in the crystal change direction. Perhaps you should map out the work to be done...\r\n[they need to connect the words like a connect the dots puzzle]"], [70.0, ["The Pitch", " car crash", " engine", " video"], "This producer really likes \"car crashes.\"  What puzzly thing might that mean?"], [70.1, ["The Pitch", " car crash", " engine", " video"], "Did you notice the red dots?"], [70.2, ["The Pitch", " car crash", " engine", " video"], "Several phrases that the writer says can be anagrammed into car makes."], [70.3, ["The Pitch", " letter"], "The producer can help you figure out this mini puzzle's extra letter.  What's his name again?"], [75.0, ["Off the Grid"], "A certain string of letters in six clues is replaced by a different letter in the crossing answer"], [80.0, ["Historical Pictures"], "You can find these pictures in the MIT Mystery Hunt Archives"], [80.1, ["Historical Pictures"], "Each of the pieces of art is from a different Mystery Hunt between 2012 and 2020 (inclusive)."], [80.2, ["Historical Pictures"], "Since this uses a 2019 round, we can't do anything with the meta answer or mechanism. Round name is a good place to look for extraction."], [85.0, ["Unfinished Symphonies", " crossword"], "The artists in the flavor text all have songs in the grid, but you need to finish them."], [90.0, ["Numbers", " \"order by car\""], "The flavor text contains clues to help you figure out how to \"order by car.\""], [90.1, ["Faces", " numbers", " shell", " theme"], "Google \"Perennial Child Tulip Car\""], [90.2, ["Faces", " numbers", " shell", " theme"], "Think of synonyms for each of the words in the puzzle title."], [90.3, ["Faces", " numbers", " shell", " theme"], "Something that is Endless extends into _____.  You don't Practice for the Olympics, you _____."], [100.0, ["extraction", " math", " formulas"], "The math is not solvable if the expressions aren't in the proper order."], [100.1, ["extraction", " math", " formulas"], "Note that the mathematical expressions don't have normal equal signs.  So these aren't equations!"], [100.2, ["extraction", " math", " formulas"], "The results of previous expressions will change the inputs for later ones."]]