[[0.0, ["start", " beginning"], "The object here is to place the letters A-Z onto the gears, so that you can spell out each of the clued words by turning the gears and taking a letter every time an arrow hits a letter. You can reset the gears between words. The letters ABCDE have already been placed."], [10.0, ["Placing first letters", " part 1"], "The gears start with the letters ABCDE on them. It helps to start with an answer word that has at least 3 of those letters in it. At the beginning, there are 2 of those. Start with them, in either order."], [11.0, ["Placing first letters", " part 2"], "The answer CENA allows you to place the N on gear B -- there is only one place it can go in order for you to be able to spell out CENA."], [12.0, ["Placing first letters", " part 3"], "The answer BAES allows you to place the S on gear C -- there is only one place to put the S that will allow you to spell out BAES."], [20.0, ["After CENA and BAES", " part 1"], "After placing CENA and BAES, at least one additional word will now have 3 letters already in place on the gears. Try one of them next."], [30.0, ["After CENA and BAES", " part 2"], "The word MANCY will allow you to place the Y with certainty on gear D, and will narrow down the possibilities for M significantly."], [35.0, ["After MANCY"], "After MANCY, consider ARMY next."], [40.0, ["After the Y is in place"], "Consider ZARDS next. [*** IF THEY NEED MORE:  ZARDS helps place the Z on gear E and the R on gear B]."], [41.0, ["After the Z is in place", " part 1"], "Consider BOXES and KNOX together. [***IF THEY NEED MORE: These help place the O on gear A and the X on gear B]."], [42.0, ["After the Z is in place", " part 2"], "Consider TENS, ZPAD, and THARP together, which will help place a few additional letters."], [43.0, ["After the Z is in place", " part 3"], "Consider QAX, which will help place the X."], [50.0, ["here is the full list of letters on gears -- use discretion as to how much to hint"], "[***NOTE TO HINTER -- might be best to give one new letter at a time here, but see what the teams wants. They've already done a lot to get to this point.] The letters appear on the gears as follows:  Clockwise from arrows: (Gear A) O, STOP, G, STOP, STOP, A, STOP, STOP, STOP, L, STOP; (Gear B) X, B, STOP, N, R, F, STOP; (Gear C) STOP, STOP, STOP, C, W, STOP, STOP, S, STOP, STOP, STOP, H, U; (Gear D) Y, STOP, D, I, STOP, STOP, P, T, Q; (Gear E) M, STOP, Z, E, STOP, J, STOP, K, V, STOP"], [100.0, ["first part of extraction"], "After placing the letters on the gears, spell each clued word and its subsequent STOP. Then with the gears in that configuration, look at the indicated gear and take the letter at the indicated position."], [101.0, ["extracted clue phrase"], "The extracted clue phrase is THE WORD AFTER WIZARDS STOP"], [102.0, ["how to apply extracted clue phrase"], "The extracted clue phrase is THE WORD AFTER WIZARDS STOP.  Set up the gears so that they spell out the word WIZARDS in the usual way, and continue to the STOP that follows the word WIZARDS. Keep turning the gears, and you will spell out the answer to the puzzle, followed by another STOP to let you know you have finished."]]