[[0.0, ["start"], "This is a puzzle about Scrabble."], [10.0, ["blanks"], "Each epitaph has 100 letters, which match the letter count for a Scrabble game — except two letters are the blanks. First step is to figure out the blanks."], [10.5, ["blanks answers"], "(See solution for which epitaph has which letters. Note they are unique from A to P. You'll use this later.)"], [20.0, ["scores"], "After you know which blanks are which, you have to figure out how to get each of the scores. The design of the page, and the flavor, should help you figure out how to map this game onto a Scrabble board."], [20.1, ["scores"], "Start with MAX A. SKINNER. His name has a ★. The background color of the line with the star is pink. That means the entire line has to fit onto the starting square. In Scrabble, you sum up the values of the letters. In this game, you'll sum up the values of each line. (And apply premium square multiplier as needed.)"], [20.2, ["scores"], "The flavor tells you that these lives were the \"product of circumstances\". The title uses the word \"Times\". To find the title of a line: start with the value each letter, then multiply them all together. Do that for all the lines and sum them together.\r\n\r\nNote that for lines on light blue DLS (DOUBLE LETTER SCORE) spaces, you'll first need to double that line. And for words with a pink DWS (DOUBLE WORD SCORE) space, you'll need to double at the end.\r\n\r\nThere's one more thing to consider, however, and it involves the blanks…"], [20.3, ["scores", " blanks"], "Blanks are worth 0. So two lines will need to be zeroed out in order to achieve the proper final score. That will clearly indicate which letter has the blank. (With one exception, there's one word where the blank could be one of two same letters in the word.)"], [30.0, ["placing on board"], "After you place MAX A SKINNER on the board, you'll need to figure out where the other epitaphs intersect. To do that, find lines in MAX's that match lines in other epitaphs…"], [30.1, ["placing", " anagrams"], "Max intersects 3 other epitaphs. One intersection is the second-to-last line: YOUNG, TWISTY. That is an anagram of TWO TINY GUYS in Eva Zola's epitaph."], [40.0, ["message"], "Once you've placed all the words on the board and determined exactly which letters are the blanks, look at the words each blank is in."], [40.1, ["message"], "Put them in order by letter, and look at the first letter of the word."], [40.2, ["message"], "(see solution for explanation.) The message is PLAY WORD FROM EACH."], [50.0, ["interpreting message"], "Each epitaph has one word that has the same number of letter as the epitaph has lines. For Max, that word is SKINNER — it's the only 7 letter word in the epitaph. The other words are all 8 letters, because their epitaphs have 8 lines."], [50.1, ["interpreting message"], "You've made a game using the epitaphs. Now turn that game into a real game, using these new words."], [100.0, ["extraction"], "Use your re-constructed game — with 8 bingos shown — for the final extraction. The letters you need are highlighted."]]