[[0.0, ["flavortext"], "The flavortext's reference to some things that are even older refers to a specific item that is older than FDA regulations are."], [0.1, ["flavortext"], "Specifically, the even older item is another piece of written text; you will need to find it to solve this puzzle."], [0.2, ["flavortext"], "The older written text is also a five-book set; the fact that there are five speakers is not a coincidence."], [0.3, ["flavortext"], "Each speaker corresponds to one of the five books of the written text."], [0.4, ["flavortext", " delia"], "Delia's list of names is not English; the same applies to the written text. There are various hints throughout the puzzle about what non-English language is involved."], [0.5, ["flavortext", " delia"], "The language involved is Hebrew."], [0.6, ["flavortext"], "The text is the Five Books of Moses, in the original Hebrew; each speaker corresponds to the book whose English name starts with the same letter."], [1.0, ["delia"], "Delia's \"very flighty\" list is one that occurs within her corresponding book."], [1.1, ["delia"], "Delia's list is a list of birds that occurs in the book of Deuteronomy."], [1.2, ["delia"], "Delia's list is specifically the list of 21 names of non-kosher birds from the book of Deuteronomy."], [1.3, ["nigella", " delia"], "There are 21 names on Delia's list. Nigella mentions that there are 15 names crossed off so far. That leaves 6 names not yet eliminated, to participate in the 5 matches we here described."], [1.4, ["delia", " lidia"], "The differences between Delia's list and Lidia's list are the differences between the list of non-kosher birds in Deuteronomy and the list of non-kosher birds in Leviticus."], [1.5, ["delia", " lidia"], "Each of Delia's five specific references to a difference between her and Lidia's lists clues one of the 15 already-eliminated names from Delia's list."], [2.0, ["nigella"], "Each of Nigella's program announcements clues a number."], [2.1, ["nigella"], "Each letter in the Hebrew alphabet has a numeric value. Each of Nigella's program announcements thus indicates a Hebrew letter and what it is \"at\"."], [2.2, ["nigella", " delia"], "Each of Nigella's five program announcements indicates one already-eliminated name from Delia's list by indicating that a particular Hebrew letter appears at a particular position."], [3.0, ["guy"], "The underlined words Guy utters have something in common."], [3.1, ["guy"], "Each underlined word Guy utters is the original meaning of the name of a Hebrew letter."], [3.2, ["guy", " delia"], "Each statement from Guy containing an underlined word indicates one already-eliminated name from Delia's list by indicating that its \"first ingredient\" (first letter) is a particular Hebrew letter."], [100.0, ["extraction", " delia", " lidia"], "Once you know which 15 names from Delia's list have been eliminated, this leaves 6 names as the ones participating in the 5 matches Lidia describes."], [100.1, ["extraction", " lidia"], "From Lidia's descriptions of the matches, you can deduce exactly who won what match."], [100.2, ["extraction", " order"], "The results of each match are written by a different person. This is an ordering mechanism."], [100.3, ["extraction", " delia", " emerial"], "According to Emeril, each name from Delia's list has an assigned English letter. Thus, the winner and loser of each match shown can be written as two letters."], [100.4, ["extraction"], "Take the letters corresponding to the winner and loser of each match, and order these pairs as per the books correspondning to the people who wrote down the results of the matches, to get the final answer."]]