[[1.0, ["first steps"], "Each of the four dice contains a different set of symbols that represent a set of 20. Identifying each set will be crucial to solving this puzzle."], [10.0, ["die #3", " blue die", " Mayan die"], "The faces of this die represent the numbers 1 through 20 in a non-Arabic numbering system. The phrase \"land of the feathered serpent\" should lead you to the correct numbering system."], [12.0, ["die #3", " blue die", " Mayan die"], "The numbers on this die are in the Mayan numbering system."], [20.0, ["die #4", " orange die", " Dzongkha die"], "The faces of this die represent the numbers 1 through 20 in a non-Arabic numbering system. The phrase \"land of the thunder dragon\" should lead you to the correct numbering system."], [22.0, ["die #4", " orange die", " Dzongkha die"], "The numbers on this die are in the Dzongkha numbering system (as used in Bhutan)."], [30.0, ["die #2", " black top hat die", " Tarot die"], "The faces of this die represent a sequence that is traditionally numbered from 1 to 20. When you list them all, trying to determine the common theme, you might find it particularly helpful to consider the hermit crab."], [31.0, ["die #2", " black top hat die", " Tarot die"], "The images on this die represent the major arcana of Tarot cards."], [35.0, ["die #2", " black top hat die", " Tarot die"], "If you are having confusion or uncertainty on the order of the major arcana: the text of the puzzle tells you “Be a walker, not a rider—but do not wait.” In other words, avoid the Rider-Waite ordering."], [40.0, ["die #1", " black videocassette die", " Soderbergh die"], "The faces of this die represent the first 20 entries in a particular body of work. When you list them all, trying to determine the common element, you might find it useful to consider the numbers 11, 12, and 13, paying particular attention to the question of why they are presented in casino chips."], [42.0, ["die #1", " black videocassette die", " Soderbergh die"], "The images on this die are the first twenty movies directed by Steven Soderbergh: the movies start with Sex, Lies, and Videotape and go up to Contagion."], [50.0, ["alphanumeric list"], "Considering the twenty alphanumeric strings, you may notice that they combine the numerals 0 through 9 and characters ranging from A through J: they are numbers in base-20. The puzzle's text suggests a more useful numbering system to convert them into."], [52.0, ["alphanumeric list", " grid"], "If the base-20 numbers are converted into base-2, the longest resulting binary string is 20 digits. In other words, all the numbers will fit into the 20-by-20 grid (with some zeroes appended at the beginning of shorter numbers)."], [60.0, ["dice", " correlation"], "Each of the black dice correlates with the numbers on one of the colored dice. The text of the puzzle suggests how to pair them up. The red triangle on each die provides a starting face for each die--and the appropriate orientation"], [62.0, ["dice", " correlation"], "The Soderbergh die corresponds to the numbers on the Mayan die: putting the Mayan numbers in the order of the Soderbergh faces produces a list of 20 numbers. Confirming that your sequence of numbers is correct: “Your quest will lead you through eleven blocks of an insane city: you will meet nine blind men and then brawl with seven British sailors.” That alludes to three consecutive pairs of matching faces (5th-6th-7th): Schizopolis (11), Out of Sight (9), The Limey (7)."], [64.0, ["dice", " correlation"], "The Tarot die corresponds to the numbers on the Dzongkha die: putting the Dzongkha numbers in the order of the Tarot faces produces a list of 20 numbers. Confirming that your sequence is correct: “resist the temptations of ten succubi, take shelter in a castle with nine turrets, and get autographs from eight celebrities.” That alludes to three consecutive pairs of matching faces (15th-16th-17th): The Devil (10), The Tower (9), The Star (8)."], [100.0, ["extraction"], "Once you have correlated the two pairs of dice and produced two lists of 20 numbers, you can use those numbers to reorder the filled-in grid."], [102.0, ["extraction"], "The text suggests that the Soderbergh/Mayan sequence is useful for traveling east and that the Tarot/Dzongkha sequence is useful for traveling south, and that they will provide the true path after the terrain is reordered."], [105.0, ["extraction"], "Shuffle the columns and then the rows according to two sequences of numbers you have generated. For example, you will reorder the columns heading west to east according to the Soderbergh/Mayan sequence, beginning with the 19th column (moved to the 1st column), then the 17th (moved to the 2nd), and so on."], [110.0, ["extraction"], "The 1s, or occupied cells, in the reshuffled grid will create an image spelling out the answer."]]