[[0.1, ["start"], "Be sure to save the image, not just copy and paste it or screenshot to an image editor"], [0.2, ["start"], "Images have EXIF metadata.  Some viewers may complain about the image, but still should be able to give you some information."], [0.3, ["start"], "Look in the EXIF comment for a clue."], [0.4, ["start", " image type"], "What is unusual about the type of image this is?   [Answer: It is an indexed color image - normally modern images are 32-bit color rather than indexed]"], [0.4, ["start", " color table"], "Why is the image such a strange color?   [Answer:  Due to manipulations in the color table]"], [1.0, ["color table"], "What is unusual about the color entries in the color table?"], [1.1, ["color table"], "Check each color separately"], [1.2, ["color table"], "There are two hidden messages in the color table"], [1.3, ["color table"], "You can ignore the Red component - note that the first few of them are 0x00, which is zero in hexadecimal"], [1.4, ["color table"], "Look in the Green and Blue components - the values represent letters.  There is an easier way to extract the message than using an image editor or coding a program.  Investigate the PNG format to find out how it stores color information."], [1.5, ["color table", " extracting messages"], "Opening the file in a hex editor (FrHed is a great free one) and searching for the string PLTE will take you to the pallete (color table) section.  This is only relevant in an indexed color image like this one.  Resize your view so that only 3 characters are in each row, and then you can read down the Green and Blue values to get the two hints."], [2.0, ["hidden file", " magic bytes", " where does the image end"], "Do you know what \"magic bytes\" are, and what they are used for?  They will help you both to find the file and know what to do with it."], [2.1, ["hidden file", " magic bytes", " where does the image end"], "Where could an entire file be hidden?  There are some nasty places that would be almost impossible to find without complex programming (and knowing the algorithm to hide it), but those are unlikely because they would mess up the hidden messages."], [2.2, ["hidden file", " magic bytes", " where does the image end"], "What indicates the end of a PNG image? You don't need to understand everything about the PNG file format, only the indication that the file has finished."], [2.3, ["hidden file", " magic bytes", " where does the image end"], "You are looking for the IEND section - don't forget it has a checksum attached as well. Everything after the IEND (and 4 byte checksum) is ignored when displaying the image."], [2.4, ["hidden file", " magic bytes", " where does the image end"], "Can you identify what is after the end of the PNG?  Magic bytes are useful again for this."], [2.5, ["hidden file", " magic bytes", " where does the image end"], "The file is a zip file.  Inbuilt operating system in-line tools (i.e. Windows File Explorer or Mac Finder) don't cope well with password protected zips - use a proper zip tool."], [3.0, ["what to do with files in zip"], "For the audio files, there are multiple pieces of information they contain.  Have you gathered all the information they can give you?\r\nThe other files are named in an interesting way.  Why are they named that way in particular?"], [3.1, ["audio files"], "The words spoken are \"This audio is a red herring\", not \"This audio file is a red herring\""], [3.2, ["audio files"], "Where could you obtain additional information about the audio file?   [Answer - look at the metadata, in particular the comments]"], [3.3, ["audio files", " read audio", " spectrogram"], "Do you know how to view a spectrogram? Audacity is a great tool for this, although there are others, including online viewers if you prefer those."], [3.3, ["audio files", " read audio"], "The metadata comments tell you to \"see the sound\" and \"read the audio\" - but have you followed the last instruction?  [Answer - the numbers are hexadecimal and spell out \"spectrogram.\"]"], [3.4, ["audio files", " read audio", " spectrogram", " RAW RGBA 78x43"], "What does RAW RGBA 78x43 mean?  Unfortunately magic bytes won't help here as there is no header to hold them.  What does RGBA normally indicate?"], [3.5, ["other files"], "The non-audio files have a common theme.  Have you identified that theme?  [Answer: scientific name of fish]"], [3.6, ["other files", " fish files", " RAW RGBA 78x43"], "The non-audio files are named after fish.  And you are looking for the raw (the color bytes without any header describing image size or type) data for an RGBA image."], [3.7, ["other files", " fish files", " RAW RGBA 78x43"], "How big should a file be that contains 78x43 RGBA bytes?   [Answer: the same size as 3 of the fish files]"], [3.8, ["other files", " fish files", " RAW RGBA 78x43"], "Put three of the fish files together to form a single file and open it in an image tool (e.g. GIMP).  How to determine which files go together - have you found the common names for the fish?"], [100.0, ["extraction", " 3 fish files together"], "You should end up with what *seems to be* a completely red rectangle for each set of three fish."], [100.1, ["extraction"], "There is only one raw image file that gives you a useful message - and finding the answer that fits that statement should be straight forward"]]