[[0.0, ["start"], "In the cell with the arrow, look to the upper left and the upper right to find the games for that coordinate.  Figure out which has a larger value."], [0.1, ["start"], "One way to do this is to find each value (by calculating them, or by looking them up somewhere)."], [0.2, ["start"], "Another way is to reverse one game, put it alongside the other, and play the combination: if Blue/Left always wins this combination or if Red/Right always does, that tells you which is bigger -- and if the first player always wins, then neither is bigger."], [2.0, ["colors", " pens"], "The instructions say to change to a new pen color.  What color you use is not important, just the fact that you changed."], [3.0, ["stuck getting values"], "A reliable way to tell if one game is greater than another is to reverse one game, put it alongside the other, and play the combination: if Blue/Left always wins this combination or if Red/Right always does, that tells you which is bigger -- and if the first player always wins, then neither is bigger."], [4.0, ["equal"], "None of the comparisons you need to make will be between games with equal values (that is, G1 minus G2 is a second-player win)."], [4.1, ["equal"], "Did you perhaps count a first-player win as meaning zero?  Those are different."], [4.2, ["equal"], "Some cells in the grid do have two coordinates of equal values, so if you're getting this result it might mean you've gone the wrong way in the maze."], [5.0, ["boxes around shelf games"], "Boxes have been drawn around some of the shelf games as a small check.  Those shelf games, but not the others, have something in common within the puzzle."], [5.1, ["boxes around shelf games"], "These are the puzzles that are taken from the shelf when we have hit an \"incomparable\" result, and we switch to a new pen color."], [100.0, ["extraction"], "Does your path through the grid suggest anything?"], [100.1, ["extraction"], "Each different pen color of your path should be examined separately."], [100.2, ["extraction"], "Each different pen color of your path traces out a letter."]]