[[0.0, ["rows garden"], "This is a Rows Garden puzzle. If you haven't seen puzzles like this before, probably somebody on your team has, but it's not that complicated. The answers to the Row clues go into the grid in from left to right, one letter in each triangular space (skipping over the gaps in the top and bottom rows). The answers to the Bloom clues go into one of the shaded blooms around one of the little circles in the grid. The bloom answer can start in any of the six spaces and read either clockwise or counterclockwise. Furthermore, the bloom clues are not given in grid order, but merely separated by color. You'll have to work back and forth with the row answers to figure out where and how the bloom answers go in."], [10.0, ["grid"], "Nothing tricky is happening in the grid (empty spaces, more than one letter in a space, letters going off the edge of the grid, etc.)."], [20.0, ["flavortext", " losing head", " beheading"], "The flavortext mentions \"losing your head\". This is a cryptic hint to beheading, i.e. removing the first letter of a word."], [30.0, ["flavortext", " losing head", " beheading", " blooms"], "Some of the bloom entries specifically can be beheaded to form a valid 5-letter word or entry. Actually, a lot of them can. But the flavortext says \"though you can still function\". This means we're only interested in the ones that still function, i.e. that still satisfy their clues after being beheaded."], [100.0, ["extraction"], "Find all the bloom entries that can still satisfy their clues after being beheaded. Read off the beheaded letters in grid order."], [100.1, ["one more time", " beheading"], "Read off the letters you've found. It's a six-letter word, but not a particularly apt one, and indeed, not the correct answer (you've probably already called it in and found that out). Apply the beheading one more time for the final answer."], [200.0, ["fantasy", " extraction", " blooms", " glyph"], "The glyph suggests swapping light and medium blooms, while dark blooms remain fixed in place."], [210.0, ["fantasy", " extraction", " blooms", " glyph"], "Which light and medium blooms should you swap? The glyph orientation doesn't correspond to any specific set of three touching blooms in the grid. Perhaps a more global approach is required."], [220.0, ["fantasy", " extraction", " blooms", " glyph"], "How many of each color bloom are there in the entire grid?"], [230.0, ["fantasy", " extraction", " blooms", " glyph"], "There are 15 light blooms, 15 medium blooms, and 12 dark blooms. Keep all 12 dark blooms where they are, but switch the places of *all* the light blooms with *all* of the medium blooms. You can number each set from 1 to 15 in logical grid order (top to bottom, left to right); then swap light #1 with medium #1, light #2 with medium #2, etc. Notice anything?"], [300.0, ["fantasy", " extraction"], "After swapping the light and medium blooms, look for new words in the cells that jut out from the top and bottom of the grid. This is a clue phrase. (If it doesn't mean anything to you, google it.)"]]