[[0.0, ["start", " beginning"], "The puzzle is a rebus, where you add and subtract words to a string of letters in order to eventually arrive at an answer."], [10.0, ["colors", " order"], "Puzzle answers, all of which have colored borders, are to be added to your string of letters, in some order, in the correspondingly colored boxes. Images, which have black borders, are to be added to the black boxes of the rebus, and get subtracted from the string. Finish adding or subtracting a word completely before adding or subtracting the next word."], [20.0, ["stuck", " remove", " ambiguous"], "This phrase from the flavortext about how to remove words is important: \"Always remove letters in order, but do not remove a word at a time when there is a different way of removing it that would leave a different leftover string.\" That means that if your string is BTANAKE, you cannot remove TAKE, because you could do so in 2 different ways, leaving BNA or BAN. But taking a letter from a pair of doubled letters is fine -- that is, if your string is BTAANKE, you can remove the word TAKE, because you would be left with the string BAN regardless of which A you removed."], [22.0, ["help IDing images"], "Each of the 9 images to be identified represents a single word, and those 9 words are in alphabetical order from left to right, top to bottom."], [25.0, ["images", " identification"], "[***NOTE TO HINTER -- determine what image IDs they are stuck on, and what the think those images might be, and hint accordingly, such as by telling them one of their guesses for an item is correct (if it is) or hinting in a different direction to get there. Generally only get them through one image at a time, but use your discretion if it's appropriate to do more or to simply give them one or more words. The 9 images to ID, in order, are: BLANKET, BREAD, CENT, DRILL, HAT, KEYCHAIN, LUTE, PUMP, YODEL.]"], [30.0, ["getting started on rebus"], "The rebus starts with adding 2 words and then subtracting a word. What 2 answer words can be added, one after the other, that allow an image word to be subtracted (with its letters in order, though not necessarily touching)? There are very few possibilities."], [31.0, ["BIRTHDAY = word 1"], "The first word is BIRTHDAY"], [32.0, ["STAPLER = word 2"], "The second word is STAPLER"], [33.0, ["HAT = word 3"], "The third word is HAT"], [34.0, ["KILO = word 4"], "The fourth word is KILO"], [35.0, ["ADDLE = word 5"], "The fifth word is ADDLE"], [36.0, ["DRILL = word 6"], "The sixth word is DRILL"], [37.0, ["BREAD = word 7"], "The seventh word is BREAD"], [38.0, ["UPCYCLE = word 8"], "The eighth word is UPCYCLE"], [39.0, ["HABIT = word 9"], "The ninth word is HABIT"], [40.0, ["LONE = word 10"], "The tenth word is LONE"], [100.0, ["full (unsolved) rebus / extraction"], "The complete rebus is: BIRTHDAY + STAPLER - HAT + KILO + ADDLE - DRILL - BREAD + UPCYCLE + HABIT + LONE - KEYCHAIN - LUTE - YODEL + LATHE + UNKEMPT - BLANKET - PUMP + NOLTE - CENT. Remember, according to the instructions, add or subtract words one at a time, always with the letters in the correct order. There will only be one way to subtract the given letters at each step (except that if you need to remove one of a doubled letter, you can remove either one)."]]