[[1.0, ["words"], "The two words on each sticker clue a word that can be associated with either word."], [1.1, ["words"], "For each sticker, you can add the same word after the first word and before the second word to form two familiar phrases or compound words."], [1.2, ["words", " stickers", " order"], "The words you'll need from each sticker are arranged in alphabetical order."], [2.0, ["words", " stickers", " tag", " arrange"], "After finding the words from each sticker, take a look at the tag."], [2.1, ["tag", " arrange"], "Notice how there are 37 numbers and 37 stickers."], [2.2, ["tag", " arrange", " words"], "Each sticker is numbered from 1-37. If you properly group the words according to the numbers of the tag, you may notice something."], [2.3, ["tag", " arrange", " words"], "Each of the 14 groups of words is missing one thing each."], [2.4, ["tag", " arrange", " words"], "You're looking for a canonical group of 12, and 2 extra."], [3.0, ["animals", " zodiac"], "There are only 12 characters in the traditional Chinese zodiac. The other two are not usually associated with the zodiac."], [3.1, ["animals", " zodiac", " last sticker"], "It may help to figure out the first group of stickers and find out what is being hinted by the word for that first group and the 12 characters of the Chinese Zodiac. This may also help disambiguate the one sticker/word at the end of the tag."], [3.2, ["animals", " zodiac", " god"], "Isn't it strange that the title of the puzzle is FRUIT<u>S</u> STICKERS and not just FRUIT STICKERS? Perhaps the next step has something to do with that."], [3.3, ["animals", " zodiac", " god"], "You're looking for a specific anime that has a \"family\", \"curses\", and makes use of the Chinese Zodiac."], [4.0, ["fruits basket", " anime", " stickers"], "Associate the groups of stickers with the right characters."], [4.1, ["fruits basket", " anime", " stickers"], "The stickers specifically relate to the names of each character."], [4.1, ["fruits basket", " anime", " stickers", " names", " syllables", " kana", " shape", " color"], "Each sticker is one of nine different shapes, and one of five different colors. The shape represents the consonant sound, and the color represents the vowel sound."], [4.2, ["fruits basket", " anime", " stickers"], "Traditionally, the names of each character would be written in kanji, but the flavour text implies that they aren't written in the traditional way."], [4.3, ["fruits basket", " anime", " stickers"], "Perhaps it would be helpful to see the difference between KYO and HATSUHARU, and the stickers that they have."], [4.4, ["fruits basket", " anime", " stickers"], "HATSUHARU has 4 stickers, YUKI has 2 stickers, KYO has 1 sticker. Why is that?"], [4.5, ["fruits basket", " anime", " stickers", " names"], "The number of syllables in a character's first name is the number of stickers they have in the puzzle."], [4.6, ["fruits basket", " anime", " stickers", " names"], "Each sticker represents a different character in kana, the phonetic writing system of Japan."], [4.7, ["fruits basket", " anime", " stickers", " names", " syllables", " kana"], "The properties of each sticker is dependent on the syllable it represents."], [4.71, ["fruits basket", " anime", " stickers", " names", " syllables", " kana", " color"], "There are 5 different colors for each sticker. What could the colour represent for a syllable?"], [4.72, ["fruits basket", " anime", " stickers", " names", " syllables", " kana", " shape"], "If you notice that there are 5 different colors and know what those colors mean, then you'll know what the shapes represent."], [4.73, ["fruits basket", " anime", " stickers", " names", " syllables", " kana", " shape", " color"], "Each sticker is one of nine different shapes, and one of five different colors. The shape represents the consonant sound, and the color represents the vowel sound."], [5.0, ["blank stickers"], "You can figure out the final clue phrase by knowing what the properties of the stickers mean."], [100.0, ["blank stickers", " extraction"], "By figuring out the meaning of the properties of the stickers, you can spell out the correct clue phrase indicated by the blank stickers below."], [100.1, ["blank stickers", " extraction"], "Your final clue phrase is not in English."]]