[[0.0, ["Images", " pictures", " animals"], "Only the type of animal and how it is depicted is important. The actual animated character and source can be ignored."], [1.0, ["aha", " reference", " flavortext"], "[Provide as many as deemed necessary]\r\nThere are a few clues to the aha and reference for this puzzle - \r\n(1) The description and type of the animals in the images (in particular the one which has been image-edited)\r\n(2) The lone non-animal image\r\n(3) The borders around the images\r\n(4) The numeral characters\r\n(5) The words \"armies\", \"checking\", \"large\" and \"general\" in the flavortext\r\n(6) The word \"large\" in the puzzle title"], [1.1, ["aha", " reference", " flavortext"], "The clued reference is to Dai Shogi, a Japanese chess/Shogi variant played on a 15x15 board. The images represent Dai Shogi pieces, with the white/black borders representing which side they belong to."], [2.0, ["numerals", " board"], "After identifying the game, notice what is referenced in the puzzle about the board. Think about how you can use the given numerals."], [2.1, ["numerals", " board"], "The Arabic and Japanese numerals give the coordinates for each represented piece on the Dai Shogi board based on standard board notation (Arabic for columns right to left, Japanese for rows top to bottom, with Black pieces going up the board)."], [3.0, ["board", " position"], "After placing the pieces on the board, notice only White has a king. What kind of Shogi position does this resemble, and what do you think Black needs to do? You will need to know all the rules for the game and how the pieces move."], [3.1, ["board", " position"], "The setup is a Dai Shogi mate problem (Tsume Shogi), where you have to solve for the sequence of checks by Black to deliver mate (while White tries to delay mate for as long as possible). Black moves first and up the board."], [4.0, ["solve", " mate", " sequence", " move", " promote", " paradrop"], "To find the mating sequence, you need to know all the rules for the game and how the pieces move. This includes promotion and special moves. The two constraints hinted in the flavortext will help you as well."], [4.1, ["solve", " mate", " sequence", " move"], "In a Shogi mate problem, every move by Black must be a check, and White moves optimally to delay the mate as long as possible. An additional hint in the flavortext is that in this mating sequence, only the Black horned falcon made a capture."], [4.2, ["solve", " mate", " sequence", " move", " promote"], "You need to know the rules for promotion as one of the moves by Black is a promotion."], [4.25, ["solve", " mate", " sequence", " move", " promote"], "The Black Cat Sword moves into the promotion zone and promotes to a Gold General before giving check. This is the only promotion in the move sequence, as pieces already inside the promotion zone cannot promote unless they capture a piece within the zone. This is also a sacrificial move, in order to open up the rank for another Black piece to check next."], [4.3, ["solve", " mate", " sequence", " move", " special"], "You need to know the special moves for the pieces as one of the moves by White is a special move."], [4.4, ["solve", " mate", " sequence", " move", " special"], "The special move made by the White Horned Falcon is an \"Igui\" (stationary capture). The piece moves 1 space to capture a Black piece, before retreating back to its original square. This is also the only capture made in the sequence."], [100.0, ["extraction"], "Black mates White in 6 moves, and only Black's moves are important for extraction. Think about the referenced theme of the board for this game and why the original positions of the moved pieces might be important. There is a hint in the flavortext."], [100.1, ["extraction"], "Index the number of squares moved by each Black piece into its name, in move order, to get the puzzle answer."]]