[[0.0, ["footnotes"], "It will be helpful to identify what the footnotes refer to. The author lists will help."], [0.1, ["footnotes"], "The footnotes refer to versions of the same work."], [0.2, ["footnotes"], "The footnotes refer to performances of versions of the same song by two different groups."], [0.3, ["footnotes"], "The footnotes refer to performances by The Scaffold and by The Irish Rovers of different versions of \"Lily the Pink.\""], [1.0, ["studies", " footnotes"], "The entries in \"Case Studies\" correspond to parts of the works referenced in the footnotes."], [1.1, ["studies", " footnotes"], "Specifically, each entry in \"Case Studies\" refers to a verse in one or both of the versions of \"Lily the Pink\" the footnotes refer to; which footnotes are used indicates which version(s)."], [1.2, ["studies", " names"], "Each \"patient name\" from a case study can be matched up letter by letter with the patient name in the corresponding verse of \"Lily the Pink.\""], [1.3, ["studies", " names"], "If you find a name that does not seem to match up lengthwise, pay heed to the parenthetical note on \"Case Studies.\""], [1.4, ["studies", " names"], "Each \"patient name\" from a case study can be thought of as an encoded version of the name from the corresponding song verse."], [2.0, ["footnotes"], "The works referenced in the footnotes are inspired by a certain medical treatment; you will need to get information about the latter."], [2.1, ["footnotes"], "Specifically, \"Lily the Pink\" is inspired by Lydia E. Pinkham's Vegetable Compound."], [2.2, ["ingredients"], "The \"Ingredientia originalia\" section relates to the original ingredients of Lydia E. Pinkham's Vegetable Compound."], [2.3, ["ingredients"], "The use of the Latin term \"Ingredientia originalia\" for \"original ingredients\" is a hint to how the original ingredients of Lydia E. Pinkham's vegetable compound are to be used here."], [2.4, ["ingredients"], "Specifically, you will be using the Latin genus and species of each of the five original herbal ingredients of Lydia E. Pinkham's Vegetable Compound."], [2.5, ["ingredients", " clues"], "You may notice some similarity between answers to the \"Ingredientia originalia\" clues for and the genus and species names for the original ingredients."], [2.6, ["ingredients", " clues"], "Specifically, you can match each genus + species to one of the five \"Ingredientia originalia\" rows and answer the two clues so that all the letters in the left-hand answer are in the genus and all the letters in the right-hand answer are in the species."], [2.7, ["ingredients", " clues", " studies", " names"], "When you match up the \"Ingredientia originalia\" clue answers with the genus/species names, in each case the letters left over may seem familiar."], [2.8, ["ingredients", " clues", " studies", " names"], "When you match up the \"Ingredientia originalia\" clue answers with the genus/species names, in each case the letters left over are the non-X letters from one of the \"patient names\" in \"Case Studies.\""], [100.0, ["extraction"], "The letters from each genus/species name that come from an encoded patient name (rather than from the clue answer) can be matched up with the number-letter combinations after the clue."], [100.1, ["extraction"], "If you are not clear on which instances of repeated letters are to be treated as coming from the encoded patient names, the parenthetical note on \"Ingredientia originalia\" is intended to disambiguate this."], [100.2, ["extraction"], "Since you can match up the number-letter combinations to the non-X letters from the encoded patient names, that means you can match them up with the corresponding letters from the (nonencoded) patient names in the song verses."], [100.3, ["extraction"], "The number-letter combinations matched up with letters from the patient names in the song verses show how to arrange those letters into three clue phrases."], [100.4, ["extraction"], "Each clue phrase you get should be interpreted as pertaining to the same person."], [100.5, ["extraction"], "Specifically, each clue phrase should be interpreted as pertaining to Lily the Pink (Lydia E. Pinkham)."], [100.6, ["extraction"], "The answers you get from the three clue phrases will just be concatenated together to get the final answer."]]