[[0.0, ["start", " beginning"], "Solving puzzles gives you a sentence or paragraph of information. Those sentences and paragraphs form a logic puzzle, which must be solved, or at least mostly solved, to solve the metapuzzle."], [10.0, ["what is the logic puzzle about?"], "Googling some of the key words in the logic items will identify that the logic puzzle involves the board game Love Letter, and specifically the Premier Edition. You will need to use the rules for the game Love Letter -- and again, specifically the Premier Edition -- to solve the logic puzzle. Those rules are available in a number of locations online."], [20.0, ["getting started with logic puzzle"], "A good place to start on the logic puzzle is to determine exactly how many rounds were played in the game."], [25.0, ["How many rounds did the game last?"], "The logic can be used to determine that the game lasted exactly 5 rounds. And one person discarded the Princess in each round, of which there is only one copy in the game, so the Princess was discarded a total of 5 times during the game."], [30.0, ["After determining number of rounds", " then what?"], "After determining the game lasted for exactly 5 rounds, use givens 3, 4, and 6 to determine what the pattern of discards was. From #4, we know it goes from 1 to N with no gaps. There are 14 attendees -- we can determine the numbers of discards for the attendees at this time (how many were discarded once, how many were discarded twice, etc), even though the first 6 givens do not yet allow us to determine WHICH attendees were discarded which number of times."], [35.0, ["Need more help on numbers of discards"], "From the first 6 givens, we can determine that the 14 attendees were discarded 1, 2, 3, 4, 5, 6, 7, 8, 9, 9, 9, 10, 10, 10 times, in some order."], [40.0, ["Answer to logic puzzle part"], "The logic puzzle allows you to conclude that the attendees were discarded the following number of times:  Constable 1, Countess 2, Bishop 3, Dowager Queen 4, Princess 5, Count 6, Handmaid 7, Baron 8,  Cardinal 9, Prince 9, Baroness 9, Guard 10, Priest 10, Sycophant 10."], [100.0, ["Extraction Part 1"], "The costumes can be used to relate the answer words (celebrities) to a number of discards from 1 to 10. Use those numbers to index into the celebrities' full names to get an instruction."], [101.0, ["What does the extracted instruction mean?"], "The first extracted phrase is USE THE PARTNERS. Google what the celebrities all have in common, then use their partners' names and extract a new message."], [103.0, ["Last hint"], "The answer celebrities were all in A.R. Gurney's play Love Letters, starring opposite a partner. Find those partners (Wikipedia has a list, but they can also be found elsewhere), and index the same numbers into the partners' full names to extract the final answer phrase."]]