[[0.0, ["grid", " clues"], "The answers to the 18 clues for each grid must be placed in the grid (stopping/ending at the black bars or grid edges) in locations determined by their lengths, the clockwise or counterclockwise direction, and how they interlock."], [1.0, ["clues"], "Some clues may appear not to work. This is important."], [1.1, ["clues"], "Specifically, one clockwise clue and one counterclockwise clue for each grid will not quite work."], [1.2, ["clues"], "More specifically, each non-working clue will have one word that is incorrect in some way."], [1.3, ["clues"], "Identifying which clockwise clue and counterclockwise clue for each grid do not quite work (even if the specifics of what is incorrect are elusive) will be very helpful for proceding further."], [2.0, ["flavortext", " grid"], "The flavortext refers to arches; the gray squares in at the top of each grid form an arch."], [2.1, ["flavortext", " grid"], "The flavortext indicates that the keystones (top stones) of the arches are only one third of the key stones; this means that there are (at least, on average) two other \"key stones\" in each arch."], [2.2, ["flavortext", " grid", " clues"], "For a given grid, the locations where the entries for the non-working clues intersect the arch are two more stones; these can be taken as the two other \"key stones\"."], [100.0, ["extraction", " flavortext", " grid"], "Reading all the key stones (in top-to-bottom, left-to-right reading order for each arch) spells out COLOR THE GOTHIC WORDS' INITIALS."], [100.1, ["extraction", " clues"], "The nonworking words in the nonworking clues are in the Gothic language (a now-extinct East Germanic language), and must be read as such for the clues to work. (There are various online Gothic dictionaries, and Wiktionary also includes Gothic.)"], [100.2, ["extraction", " clues", " grid"], "You must take the initials of the two Gothic words in the nonworking clues for a given arch, and color in the grid spaces for those two letters wherever they appear."], [100.3, ["extraction", " grid"], "In each case, the colored-in spaces will form a letter."]]