[[0.0, ["start"], "The italicized words in the flavor text hint at what logic puzzle this maze represents."], [0.1, ["start"], "This is the logic puzzle Slant (also called Gokigen Naname), solve this to create paths that connect pairs of lovers."], [10.0, ["names", "path lengths"], "The number of steps each person has walked to reach the meeting point is important. Notice the people who took a longer path tend to be those with longer names."], [10.1, ["names", "path lengths"], "Index into each person's name the number of steps s/he has walked. As the flavor text suggests, read the letters given by the women and men separately (ordered clockwise around the maze) to get two different clue phrases."], [30.0, ["scoring", "women's clue phrase"], "The clue phrase given by women should point to a scoring system that you can apply to each couple."], [30.1, ["scoring", "checksum"], "The checksum is provided for the categories represented by the letters NUPTIALS in Katie Baker's Matrimonial Moneyball scoring system."], [40.0, ["polynomial", "men's clue phrase"], "The clue phrase given by men points to the characteristic polynomial... but of what? Where can we find a square matrix?"], [40.1, ["characteristic polynomial", "square matrix"], "If the characteristic polynomial is degree 10, then the square matrix is 10x10. What is also 10x10 in this puzzle?"], [40.2, ["characteristic polynomial", "square matrix"], "The garden is 9x9 with 10x10 vertices. Recall some vertices were given numerical clues for the Slant puzzle. We can backfill all 10x10 vertices using the Slant solution to get a 10x10 matrix."], [100.0, ["extraction"], "\"argued\" in the flavor text is hinting at the \"argument\" (in the argument to a function sense). What's the function? And what should be used as the value of the argument?"], [100.1, ["extraction"], "Plug each couple's Matrimonial Moneyball score into the characteristic polynomial, and then mod 31 to get a number between 1 and 26. Use A1Z26 to convert this into a letter."], [100.2, ["extraction ordering"], "The letters you get from each couple should be placed on their meeting points, which can then be read as a (6'1 6 5) clue phrase."]]