[[0.0, ["diagram"], "The shape of the diagram is an indication of what it represents."], [0.1, ["diagram"], "The diagram is a periodic table (with the lanthanides and actinides omitted)."], [1.0, ["diagram", " formulas"], "The items in the diagram that appear to be structural formulas are actually pieces of structural formulas that must be put together."], [1.1, ["diagram", " formulas"], "The formula pieces are similar to skeletal structural formulas, except they leave *all* the hydrogens out. Certain elements in the periodic table diagram have text instead of a formula piece; that text indicates which elements are shown or not in the formula pieces."], [1.2, ["formulas", " flavortext"], "The flavortext gives hints as to how the pieces are to be put together, and what the results will be."], [1.3, ["formulas", " flavortext"], "The \"fifth element\" referred to in the flavortext is meant in a chemical sense."], [1.4, ["formulas", " flavortext"], "The \"B\"s in the formula pieces, which appear to be boron, just show where to hook them together."], [1.5, ["formulas", " flavortext"], "As the flavortext hints, the formula pieces will be assembled into 8 formulas. These are the formulas for 8 substances in a certain category."], [1.6, ["diagram", " formulas"], "To figure out one of the substances involved, which may help in determining the category they are all in, the formula piece in the \"chromium\" space may be a good starting place."], [1.7, ["formulas", " flavortext"], "The flavortext gives the word lengths for all 8 substances, and some additional hinting for the category they are in."], [1.8, ["formulas", " flavortext"], "When assembled, the 8 formulas will be formulas for forms of the 8 B-complex vitamins. (Some vitamins have multiple forms and variant spellings for the same form; the word-lengths, given by the asterisks, will help in disambiguating these.)"], [2.0, ["clues"], "The clues are indeed cryptic clues, but have something unusual going on."], [2.1, ["clues"], "Each cryptic clue has something missing from it. All the omitted items have something in common."], [2.2, ["clues"], "Each cryptic clue has the name of a chemical element missing from it."], [2.3, ["clues", " diagram", " formulas"], "Specifically, each cryptic clue is missing the name of one of the chemical elements at which one of the formula pieces is located."], [3.0, ["clues", " answers"], "The answers to the clues may seem a bit familiar if you have been looking at other parts of this puzzle."], [3.1, ["clues", " answers", " formulas"], "Specifically, the clue answers resemble parts of the names of the 8 B-complex vitamins."], [3.2, ["clues", " answers", " formulas"], "Each B-complex vitamin name can constructed by taking two or three clue answers, dropping one letter or digit from each of them, and concatenating the remainder together."], [100.0, ["extraction", " answers"], "The number of answers forming the name of each B-complex vitamin is always the same as the number of formula pieces making up its formula."], [100.1, ["extraction", " answers", " elements"], "You can match up the answers forming the name of each B-vitamin (left to right) with the formula pieces making up its formula (left to right). That gives you one way to match every answer with one element — the element its corresponding formula piece appears in."], [100.2, ["extraction", " answers", " elements"], "There is another way to match each answer to an element — the element its clue is missing."], [100.3, ["extraction", " answers"], "You can form a big 21-part circle of answers, connecting them by the elements they are linked to in two different ways."], [100.4, ["extraction", " answers"], "Each answer drops a letter or digit when helping form the name of a vitamin; read these around the big 21-part circle (starting where indicated, and continuing in one of the two possible directions) to get a clue to the final answer."]]