[[0.0, [""], "The rules for piece placement are essentially the rules of Scrabble.  Each horizontal and vertical sequence of letters must be a word in the wordlist that is linked to in the puzzle."], [10.0, [""], "The piece with symbols on it is the final piece in each level.  Although most placements of this piece will produce the \"illegal placement\" message, there are many configurations for each level which will produce the message \"Level completed\"."], [20.0, [""], "Levels can be done in any order.  Level 1 is not necessarily the easiest.  In order to get the answer for each level, it is not enough to get the \"level completed\" message.  You must analyze the configurations which lead to successful completions and those which don't.  Don't forget that you can use the \"undo last piece\" button at any time (it does exactly what it says; this advice is not meant to be cryptic or clueful in any way)."], [30.0, ["symbols"], "Each symbol represents a letter.  Different symbols represent different letters.  Symbols which appear in multiple levels represent the same letter in all levels."], [40.0, [""], "You will need to deduce which symbols represent which letters based on which placements of the final piece are legal.  The final piece in each level is itself a word (as it has to be for the final grid to be legal).  You may find it helpful to download the wordlist and use a program (such as the UNIX command \"grep\") to search for words matching certain patterns (this advice is not meant to be cryptic or clueful in any way)."], [50.0, ["taking too long"], "[ If the team understands what they need to do, but it's taking too long and they're finding it too difficult to make deductions (or they think they've reached a contradiction), then feel free to confirm (or provide) individual symbol/letter pairings for them.  The mapping is (A ;) (B ?) (D %) (F !) (I *) (K -) (L /) (M $) (N &) (O @) (R +) (S ~) (T :) (U =) (Y #). ]"], [90.0, ["final step"], "The answer to each level is the word represented by the final piece in that level.  For the final step, you only need this sequence of six words.  The mapping from symbols to letters is no longer important."], [100.0, ["extraction"], "Suppose there were an additional level in this game, where the pieces were the six answer words from levels 1-6 (in that order)."], [100.1, ["extraction"], "Imagine an additional level that used the six answer words from levels 1-6 as the pieces (in that order).  There is exactly one way to place the pieces so that the configuration is legal after each placement.  (Once the first piece is placed horizontally, there is only one legal placement for each subsequent piece.)  Some pieces may need to be rotated before placement.  The answer to the puzzle is the longest word present in the final grid."]]