[[0.0, ["flavortext"], "Finding out who Allan S is will help greatly. (It's Allan Sherman.)"], [0.1, ["flavortext"], "Among the \"many, many\" songs referred to, one supplies the tune the puzzle is sung to, but there are others you will need."], [1.0, ["authors", " people"], "The people mentioned as writing stories are all part of a particular group."], [1.1, ["authors", " people"], "The people mentioned as writing stories, specifically, are all mentioned in the song \"Oh Boy!\" by Allan Sherman."], [2.0, ["stories", " titles", " clues"], "The \"story titles\" are all clues for specific words or word sequences."], [2.1, ["stories", " titles", " clues"], "The number after each \"story title\" gives the word length(s) for the clued word(s)."], [2.2, ["stories", " titles", " clues"], "The answers clued by the \"story titles\" are all part of a particular group."], [2.3, ["stories", " titles", " clues"], "The answers clued by the \"story titles\" all appear in the song \"Good Advice\" by Allan Sherman."], [100.0, ["keyboard", " extraction"], "The puzzle refers to the (computer) keyboard having columns matching \"ten tales\"; the ten verses of \"Good Advice\" are ten such tales."], [100.1, ["keyboard", " extraction"], "Each \"tale\" (verse) in Good Advice is rhymed AABB."], [100.2, ["keyboard", " extraction"], "Each \"story title\" clues the word(s) at the end of one of the four rhyme lines of an AABB verse of \"Good Advice\"."], [100.3, ["keyboard", " extraction"], "The answer to each \"story title\" indicates a key on the keyboard: An answer ending the nth AABB rhyme line of the mth verse of \"Good Advice\" indicates the nth key (starting at the numeric row) of the mth column (starting with the column headed by 1)."], [100.4, ["authors", " ordering", " extraction"], "The extracted letters and numbers clued by the \"story titles\" must be ordered by the corresponding \"authors\" as per the order they appear in \"Oh Boy!\""], [100.5, ["code", " extraction"], "The \"secret code\" referred to in the extracted message, which must be used for decoding the sequence of numbers and letters at its end, is the code from the Allan Sherman song \"Secret Code\"."]]